dofile ".\\script\\nino_MP_event.lua"; --nino门派剧情
dofile ".\\script\\nino_quest_event.lua"; --nino奇遇+任务
dofile ".\\script\\tjm_event.lua"; --nino奇遇+任务
--dofile ".\\script\\nino_gambling_event.lua"; --赌博
--dofile ".\\script\\nino_emblem_event.lua"; --勋章
--dofile ".\\script\\change_zhujue.lua"; 
--[[LDCR - 2000-2005
OEVENT - 2006, 8001-8017, 8201-8208, 8301-8306, 8601-8615, 8650-8651
ninoevent - 9999, 10000, 10001-10019, 10020-10024 郭襄支线，20000-20011 离队 5000-5008 新增事件
tjm_event - 5009 -6000
newevent - 1300 and so on
free to use: 3000-4999   ]]
OEVENTLUA[508] = function() --射中一灯居
    say("阿弥陀佛，苦海无边，回头*是岸。",65)
    if inteam(53) then 
	say("誉儿拜见皇爷爷。",53)
	say("誉儿，多回家陪陪你父王。",65)
	end
end
OEVENTLUA[828] = function()
    say("哪里来的野小子，敢硬闯我*嵩山派！",22)	
	say("嵩山派身为五岳盟主，我以*为武功必是极高的，没想到*，唉，不过如此。",0)
	say("好小子，你够狂，今日就让*你尝尝嵩山剑法的厉害。",22)	
	if instruct_6(38,40,0,0) == false then 
	   instruct_15(0)  
			do return; end
    end
	instruct_0()
	instruct_13();
	instruct_2(128,1) --得到万岳朝宗
	instruct_0()
	say("小子，你功夫不错，我正在*进行一项功在千秋的大事业*，你加入我嵩山派吧。",22)
	if MPPD(0) == 14 and MPDJ(0) == 2 then 
	say("哦，看你的功夫，原来你在岳师弟那入了门啊，哈哈，要不你到我这里来当个太保吧",22) 
	end
    if DrawStrBoxYesNo(-1, -1, "要加入嵩山派的事业么？", C_WHITE, 30) == true then 
	say("左盟主真当人杰也，小子我愿为嵩山派的事业赴汤蹈火",0)
	say("小子还挺识相，不错不错，我这有一本寒冰真气的秘籍，你也拿去看看吧",22)
	instruct_2(261,1) --得到寒冰真气
	say("多谢左盟主。*＜哈哈，随便忽悠一下就能拿到本秘籍，赚了，赚了＞",0)
	say("好好学吧，小子，以后也能为我排忧解难。*＜嘿嘿，又多了个炮灰，不错，不错＞",22)
	JoinMP(0, 14, 3)
	else		
	say("对不起，我没兴趣。*＜你能有什么大事业，南贤*老头都已经说了，我找寻十*四天书才是最大的事业！＞",0)
	end
	instruct_0()
	instruct_3(-2,-2,-2,0,829,0,0,-2,-2,-2,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
end

OEVENTLUA[829] = function()
    if MPPD(0) == 14 and MPDJ(0) == 3 then 
	say("好好学吧，小子，以后也能为我排忧解难。*＜嘿嘿，又多了个炮灰，不错，不错＞",22)
	else
    say("小子，你功夫不错，我正在*进行一项功在千秋的大事业*，你加入我嵩山派吧。",22)	
	if MPPD(0) == 14 and MPDJ(0) == 2 then 
	say("哦，看你的功夫，原来你在岳师弟那入了门啊，哈哈，要不你到我这里来当个太保吧",22) 
	end
    if DrawStrBoxYesNo(-1, -1, "要加入嵩山派的事业么？", C_WHITE, 30) == true then 
	say("左盟主真当人杰也，小子我愿为嵩山派的事业赴汤蹈火",0)
	say("小子还挺识相，不错不错，我这有一本寒冰真气的秘籍，你也拿去看看吧",22)
	instruct_2(261,1) --得到寒冰真气
	say("多谢左盟主。*＜哈哈，随便忽悠一下就能拿到本秘籍，赚了，赚了＞",0)
	say("好好学吧，小子，以后也能为我排忧解难。*＜嘿嘿，又多了个炮灰，不错，不错＞",22)
	JoinMP(0, 14, 3)
	else		
	say("对不起，我没兴趣。*＜你能有什么大事业，南贤*老头都已经说了，我找寻十*四天书才是最大的事业！＞",0)
	end
	end
end

OEVENTLUA[747] = function()
    say("晚辈拜见君子剑岳先生。",0)	
	say("少侠不必拘礼。珊儿、平之*他们都在外面，可以去和他们聊*聊吧。",19)--岳不群
	say("不过我听说少侠你是南贤的弟子*不知可否加入我们华山派*在江湖中做番事业。",19)
	say("＜据说岳先生在江湖中风评不错*要不要加入呢？＞",0)
	if DrawStrBoxYesNo(-1, -1, "要加入五岳剑派么？", C_WHITE, 30) == true then 
	say("多谢师父，请受弟子一拜",0)
	say("少侠无须多礼，你是南贤的弟子，我不敢夺人之徒，有误礼法",19)
	say("但你既然已经入我华山派的门*我也会多加照顾的。",19)
	say("多谢岳先生的厚爱。*＜太好了，终于有组织了＞",0)
	say("哈哈，以后，还请少侠多为*华山派出出力啊。*＜嘿，关键时候又多了个替死鬼＞",19)
	say("＜五岳剑派盟主的位置*迟早是我岳不群的，哈哈！*啊，淡定，淡定，不能让这小子看出来＞",19)
	JoinMP(0, 14, 2)
	else		
	say("承蒙先生厚爱*但我仍然想要自己闯荡一番*抱歉了。*＜找寻十四天书要紧！＞",0)
	say("哎，也罢，以后有需要帮助的地方*可以来华山派找我*＜不识好歹的小子！＞",19)
	end
end

OEVENTLUA[465] = function() --桃花
    --say("阿弥陀佛，苦海无边，回头*是岸。",65)
    if not inteam(78) or cxzj() == 78 then
    else	
	instruct_14();   --  13(D):重新显示场景
	instruct_13();   --  13(D):重新显示场景
	say("这里……这里是桃花岛？…*…不……我不能回来……我*不能回来……！",78)
	instruct_0();
	instruct_21(78);
	instruct_3(70,59,1,0,171,0,0,7106,7106,7106,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
	do return; end
	end
end
OEVENTLUA[614] = function() --星宿
    --say("阿弥陀佛，苦海无边，回头*是岸。",65)
    if not inteam(47) or cxzj() == 47 then
    else	
	instruct_14();   --  13(D):重新显示场景
	instruct_13();   --  13(D):重新显示场景
	say("不，我不要回这里，我不要*回这里……",47)
	instruct_0();
	instruct_21(47);
	instruct_3(70,23,1,0,133,0,0,6374,6374,6374,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
	do return; end
	end
end
OEVENTLUA[1081] = function() --武duang
    --say("阿弥陀佛，苦海无边，回头*是岸。",65)
    if not inteam(82) or cxzj() == 82 then
    else	
	instruct_14();   --  13(D):重新显示场景
	instruct_13();   --  13(D):重新显示场景
	say("我不能回武当，我不回！",82)
	instruct_0();
	instruct_21(82);
	instruct_3(70,54,1,0,179,0,0,7040,7040,7040,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
	do return; end
	end
end
OEVENTLUA[468] = function()
    instruct_14();   --  13(D):重新显示场景
	instruct_37(2);   --  37(25):增加道德2
	instruct_26(61,0,1,0,0); --增加场景事件编号的三个触发事件编号
	instruct_26(61,8,1,0,0); --增加场景事件编号的三个触发事件编号
	instruct_26(61,17,1,0,0); --增加场景事件编号的三个触发事件编号
	instruct_26(61,16,1,0,0); --增加场景事件编号的三个触发事件编号
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_13();   --  13(D):重新显示场景
	instruct_25(34,20,30,21); --场景移动34-20--30-21
    say("妹子，你在这里练功夫么？",61)	
	say("＜靖哥哥受了重伤，还需五*天五夜方能痊癒。偏巧在这*时候碰见这个姓欧阳的，真*是倒楣，怎生撒个大谎，将*他远远骗走＞",56)	
	say("妹子，出来罢，躲在这里气*闷得紧。我知道那姓郭的小*子已经深受重伤，妹子，你*就依了我吧，咱俩做个长久*夫妻。只要你答应我，我保*证不加害这个姓郭的小子。",61)
	say("＜不好，郭大哥和黄姑娘有*难，我得帮帮他们＞，欧阳*兄，好久不见啊？",0)	
	say("啊？又是你！",61)	
	say("小兄弟你来得正好，快来结*果了这个恶人。",56)
	say("听见了吗？欧阳克，你作恶*多端，今日我就要送你归西*！",0)
	     if instruct_6(178,4,0,0) == false then 
		 instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
         end
	instruct_3(-2,1,1,0,0,0,0,5154,5154,5154,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_19(30,21); --场景移动3
	instruct_40(2)--面向
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	instruct_37(2);   --  37(25):增加道德2
	say("多亏小兄弟及时赶到，否则*今日定难逃脱。",56)	 
	say("郭大哥怎么了？好像伤得很*严重！",0)
    say("靖哥哥和我得知金人要偷武*穆遗书，我们就连夜赶到皇*宫保护，没想到西毒欧阳锋*竟然帮着金人，以蛤蟆功掌*力震伤靖哥哥。",56)	
	say("可恶的西毒欧阳锋，教我碰*见一定好好教训他！",0)
	say("谁这么大口气！",60)
	instruct_14();   --  13(D):重新显示场景
	instruct_3(-2,6,0,0,0,0,0,8218,8218,8218,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_40(1)--面向
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	say("啊，克儿，你怎么了？克儿*！谁，是谁杀了克儿！是不*是你！",60)
	say("＜完了，没办法，事到如今*，豁出去了！＞就是我，怎*么样！",0)
	say("好小子，有骨气！拿命来吧*！",60)
	instruct_0()
	instruct_47(60,30) --[60欧阳锋]增加武功30
	    if instruct_6(172,1,0,1) == true then 
	if GetS(111,0,0,0) == 0 then 
	    say("糟糕！！蛤蟆功！！小子放下！",60) 
	    instruct_0();
			    if DrawStrBoxYesNo(-1, -1, "是否丢弃？", C_WHITE, 30) == false then 
	                 QZXS("获得蛤蟆功精要！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,95)
					 instruct_2(73)
				else
				     say("谁稀罕。",0) 
					 instruct_0()
				end	
	end
		end

	instruct_3(-2,7,0,0,0,0,0,6154,6154,6154,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	say("嘿嘿，臭蛤蟆，在练什么功*夫啊？",64) 
	say("周老爷子，别在一旁看热闹*，快来帮帮我",0) 
	say("放心，有我在，老毒物伤不*了你。",64) 
	instruct_0()
	instruct_47(60,30) --[60欧阳锋]增加武功30
	     instruct_6(173,1,0,1)

	instruct_3(-2,8,0,0,0,0,0,8238,8238,8238,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	say("蓉儿，是你吗？",57) 
	say("爹爹，快过来，老毒物欺负*你女儿！",56) 
	say("锋兄，为何动手啊？",57) 
	say("欧阳克要欺负我，正好小兄*弟赶到，杀了欧阳克，老毒*物要为他侄子报仇，爹爹，*你快帮帮这位小兄弟吧！",56) 
	say("锋兄，你那侄子也可算是作*恶多端死有余辜，你何必…*…",57) 
	say("废话少说，我今日定要为克*儿报仇！",60)
	instruct_0()
	instruct_47(60,30) --[60欧阳锋]增加武功30 
	    if instruct_6(174,4,0,0) == false then
		 instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
        end
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	say("好小子，算你命大，我就让*你再多活几天！克儿，你放*心，等叔叔练好了九阴真经*，一定为你报仇！",60)
	instruct_0()
	instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_0()
	say("多谢周老前辈、黄岛主的救命*之恩！",0) 
	say("你救了蓉儿，我救了你，咱*们两不相欠，不必言谢",57) 
	say("黄老邪，你这话就不对了。*就算你不来，我一样可以把*欧阳锋打跑。所以说你来根*本就是多余，小兄弟也不是*你救的。可是他救你女儿女*婿却是实实在在的，所以你*还是欠他的。",64) 
	say("我黄药师一生从不欠别人的*。这样吧，小友，我就把我*的生平绝学传授与你吧。",57) 
	say("岛主救我性命，我已然感激*不尽，若再接受岛主传艺，*实在惶恐。",0) 
	say("小友不必过谦。我一身武艺*，本想有个传人。怎奈我当*初一怒之下，把我所有的徒*弟都逐出门墙。如今得了个*女婿，又是如此……",57) 
	say("爹——",56)
	say("哼，说你的靖哥哥几句你就*不高兴！小友，我看你天资*聪颖，与我桃花岛又颇有缘*分，趁着靖儿养伤这几日，*我这弹指神通的功夫就传给*你吧。",57) 
	say("多谢岛主厚爱，恭敬不如从*命。",0) 
	say("黄老邪，你以为你了不起，*什么生平绝学弹指神通！我*周伯通别的功夫都想学，就*是不看你的古怪功夫。我去*也！",64) 
	if MPPD(0) == 10 then 
	say("我看小友学有我桃花岛的武功，也算半个徒弟，我就传你一些独门绝学吧。",57) 
	JoinMP(0,10,2)
				if GetS(111, 0, 0, 0) == 0 then
						say("让我来考校考校你。",57) 
	                    instruct_0();
				         SetS(106, 63, 1, 0, 0)
	                      SetS(106, 63, 2, 0, 57)
	                    JY.Person[57]["攻击力"] = JY.Person[57]["攻击力"] + 300
	                   JY.Person[57]["轻功"] = JY.Person[57]["轻功"] + 300
	                   JY.Person[57]["防御力"] = JY.Person[57]["防御力"] + 300
				       JY.Person[57]["武功5"] = 107
				         JY.Person[57]["武功等级5"] = 999
                        JY.Person[57]["内力最大值"] = 10000
	                    JY.Person[57]["内力"] = 10000				
                        setJX(57)
	            if WarMain(288) == false then
		           instruct_0();  	
				   say("你还需多用心才是。",57) 
	            else
				   say("不错不错，这碧海潮生功的精义你就拿去吧。",57) 
				   	if DrawStrBoxYesNo(-1, -1, "是否领悟碧海潮生功？", C_WHITE, 30) == true then 
	                 QZXS("领悟碧海潮生功奥妙！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,6)
				    else
				     say("谢师傅。",0) 
					 instruct_0()
				    end
                end
				end
	end
	instruct_0()
	instruct_14()
	instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,10,0,0,0,0,0,8002,8002,8002,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,11,0,0,0,0,0,8004,8004,8004,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,9,0,0,0,0,0,8238,8238,8238,-2,-2,-2);	 --修改事件定义:当前场景当前场景事件编号
	instruct_19(23,35)
	instruct_40(1)
	instruct_0()
	instruct_13();   --  13(D):重新显示场景
	say("靖儿的伤已经痊癒了，我这*弹指神通的功夫，小友也学*得差不多啦，咱们就此别过*",57) 
	     if instruct_16(63,0,190) == true then
		    say("还有徒儿，在小友有空时身*边好好练习我教给你的武功*，不得堕了桃花岛的名声。",57) 
			say("是，师傅。",63) 
			instruct_0()
			instruct_35(63,1,12,0)--[63程英]武功[1]为[12落英神剑掌]
			instruct_35(63,2,18,0)--[63程英]武功[2]为[18弹指神通]
			instruct_45(63,10) --[63程英]增加轻功10
			instruct_0()
			instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
			instruct_0()
			say("爹——*唉，这么快就走，一点也不*疼女儿！",56) 
			say("郭大哥，黄姑娘，你们有何*打算？",0) 
			say("我要继续寻访武穆遗书的下*落。",55) 
			say("小兄弟，咱们就此别过！",56) 
		    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);	 --修改事件定义:当前场景当前场景事件编号
	        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);	 --修改事件定义:当前场景当前场景事件编号
			instruct_3(48,3,0,0,0,0,469,0,0,0,-2,-2,-2);
			instruct_3(48,2,0,0,0,0,469,0,0,0,-2,-2,-2);
			instruct_3(48,20,0,0,0,0,0,8002,8002,8002,-2,-2,-2);
			instruct_3(48,21,0,0,0,0,0,8004,8004,8004,-2,-2,-2);
			instruct_3(48,22,0,0,0,0,0,7988,7988,7988,-2,-2,-2);
			instruct_3(48,26,0,0,0,0,0,6094,6094,6094,-2,-2,-2);
			instruct_3(48,25,0,0,0,0,0,6094,6094,6094,-2,-2,-2);
			instruct_0()
			instruct_2(95,1)--得到物品[95弹指神通]1个
			instruct_0()
			do return; end
         end
		 
	instruct_0()
	instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);--修改事件定义:当前场景当前场景事件编号
	instruct_0()
	say("爹——*唉，这么快就走，一点也不*疼女儿！",56) 
	say("郭大哥，黄姑娘，你们有何*打算？",0) 
	say("我要继续寻访武穆遗书的下*落。",55) 
	say("小兄弟，咱们就此别过！",56) 
	instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);	 --修改事件定义:当前场景当前场景事件编号
	instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);	 --修改事件定义:当前场景当前场景事件编号
	instruct_3(48,3,0,0,0,0,469,0,0,0,-2,-2,-2);
	instruct_3(48,2,0,0,0,0,469,0,0,0,-2,-2,-2);
	instruct_3(48,20,0,0,0,0,0,8002,8002,8002,-2,-2,-2);
	instruct_3(48,21,0,0,0,0,0,8004,8004,8004,-2,-2,-2);
	instruct_3(48,22,0,0,0,0,0,7988,7988,7988,-2,-2,-2);
	instruct_3(48,26,0,0,0,0,0,6094,6094,6094,-2,-2,-2);
	instruct_3(48,25,0,0,0,0,0,6094,6094,6094,-2,-2,-2);
	instruct_0()
	instruct_2(95,1)--得到物品[95弹指神通]1个
	instruct_0()	 
end

OEVENTLUA[408] = function()
    instruct_1(1552,7,0)--[7何太冲]:你看看这一条的注解：*”吴钩者，吴王阖庐之宝刀*也．”为什麽．． ．
	instruct_0()
	     if instruct_16(38,2,0) ==true or cxzj() == 38 then 

	instruct_1(1553,38,1)--[38石破天]:大哥，*我的”巨骨穴”好热．．．
	instruct_0()
	instruct_3(-2,-2,1,0,409,0,0,-2,-2,-2,-2,-2,-2);
	instruct_26(-2,4,0,0,1)
	instruct_26(-2,5,0,0,1)
	instruct_26(-2,6,0,0,1)
			 	do return; end
         end
end

OEVENTLUA[409] = function()
    instruct_1(1552,7,0)--[7何太冲]:你看看这一条的注解：*”吴钩者，吴王阖庐之宝刀*也．”为什麽．． ．
	instruct_0()
	     if instruct_16(38,2,0) == false then 
		 	do return; end
         end
	instruct_1(1553,38,1)--[38石破天]:大哥，*我的”巨骨穴”好热．．．
	instruct_0()
	instruct_0()
end

OEVENTLUA[410] = function()
    instruct_1(1554,21,0)--[21定闲]:我觉得这句”银鞍照白马”*和”飒沓如流星”连在一起*方为正解．．．
	instruct_0()
	     if instruct_16(38,2,0) == true or cxzj() == 38 then 
	instruct_1(1555,38,1)--[38石破天]:大哥，这马下的云气，好像*一团团云雾在不断的向前推*涌．．．
	instruct_0()
	instruct_3(-2,-2,1,0,411,0,0,-2,-2,-2,-2,-2,-2);
	instruct_26(-2,4,0,0,1)
	instruct_26(-2,5,0,0,1)
	instruct_26(-2,6,0,0,1)
			 	do return; end
         end
end

OEVENTLUA[411] = function()
    instruct_1(1554,21,0)--[21定闲]:我觉得这句”银鞍照白马”*和”飒沓如流星”连在一起*方为正解．．．
	instruct_0()
	     if instruct_16(38,2,0) == false then 
		 	do return; end
         end
	instruct_1(1555,38,1)--[38石破天]:大哥，这马下的云气，好像*一团团云雾在不断的向前推*涌．．．
	instruct_0()
    instruct_0()
end

OEVENTLUA[412] = function()
    instruct_1(1556,23,0)--[23天门]:银光灿烂，鞍自平稳．天马*行空，瞬息万里．．．原来*天马是手．并非真的是马．
	instruct_0()
	instruct_1(1557,23,0)--[23天门]:这壁上的注解说道：白居易*诗云”勿轻直折剑，犹胜曲*全勾”．*可见我这直折之剑，方合石*壁注文原意．
	instruct_0()
	instruct_1(1558,20,0)--[20莫大]:不对，”吴钩霜雪明”是*主，”犹胜曲全钩”是宾．*喧宾夺主，必非正道．
	instruct_0()
	     if instruct_16(38,2,0) == true or cxzj() == 38 then 
	instruct_1(1559,38,1)--[38石破天]:＜咦！这些字的笔划看起来*好像是一把把的长剑，有的*剑尖朝上，有的向下，有的*斜起欲飞，有的横掠欲堕．*”五里穴”好热．．．
	instruct_0()
	instruct_3(-2,11,1,0,413,0,0,-2,-2,-2,-2,-2,-2);
	instruct_3(-2,10,1,0,413,0,0,-2,-2,-2,-2,-2,-2);
	instruct_26(-2,4,0,0,1)
	instruct_26(-2,5,0,0,1)
	instruct_26(-2,6,0,0,1)
			 	do return; end
         end
end

OEVENTLUA[413] = function()
    instruct_1(1556,23,0)--[23天门]:银光灿烂，鞍自平稳．天马*行空，瞬息万里．．．原来*天马是手．并非真的是马．
	instruct_0()
	instruct_1(1557,23,0)--[23天门]:这壁上的注解说道：白居易*诗云”勿轻直折剑，犹胜曲*全勾”．*可见我这直折之剑，方合石*壁注文原意．
	instruct_0()
	instruct_1(1558,20,0)--[20莫大]:不对，”吴钩霜雪明”是*主，”犹胜曲全钩”是宾．*喧宾夺主，必非正道．
	instruct_0()
	     if instruct_16(38,2,0) == false then 
		 	do return; end
         end
	instruct_1(1559,38,1)--[38石破天]:＜咦！这些字的笔划看起来*好像是一把把的长剑，有的*剑尖朝上，有的向下，有的*斜起欲飞，有的横掠欲堕．*”五里穴”好热．．．
	instruct_0()
end

OEVENTLUA[414] = function()
    instruct_1(1560,8,0)--[8唐文亮]:这”侠客行”的古诗图解，*包含着古往今来最博大精深*的武学秘奥．．．*你瞧，这第一句”赵客缦胡*缨”，其中对这个”胡”字*的注解．．．
	instruct_0()
	     if instruct_16(38,2,0) == true or cxzj() == 38 then 
	instruct_0()
	instruct_3(-2,-2,1,0,415,0,0,-2,-2,-2,-2,-2,-2);
	instruct_26(-2,4,0,0,1)
	instruct_26(-2,5,0,0,1)
	instruct_26(-2,6,0,0,1)
			 	do return; end
         end
end

OEVENTLUA[415] = function()
    instruct_1(1560,8,0)--[8唐文亮]:这”侠客行”的古诗图解，*包含着古往今来最博大精深*的武学秘奥．．．*你瞧，这第一句”赵客缦胡*缨”，其中对这个”胡”字*的注解．．．
	instruct_0()
	     if instruct_16(38,2,0) == false then 
		 	do return; end
         end
	instruct_0()
end

OEVENTLUA[416] = function()
    if instruct_16(38,2,0) == true or cxzj() == 38 then

	instruct_26(61,19,1,0,0)
	instruct_26(61,18,1,0,0)
	instruct_1(1561,38,1)--[38石破天]:大哥，这没有什麽好看的，*我们走了好不好．．．
	instruct_0()
	instruct_1(1562,0,1)--[0资]:贤弟，小声一点，别吵到两*位岛主练功．．
	instruct_0()
	instruct_1(1563,38,1)--[38石破天]:＜这些字怎麽如此古怪，看*上一眼，便会头晕？＞**＜至阳穴好热，原来这些蝌*蚪看似乱钻乱游，其实还是*和内息有关＞
	instruct_0()
	instruct_1(1564,39,0)--[39龙岛主]:这位石兄弟双眼注目这”太*玄经”，原来是位精通蝌蚪*文的大方家．
	instruct_0()
	instruct_1(1565,38,1)--[38石破天]:小人一个字也不识，只是瞧*这些小蝌蚪十分好玩，便多*看了一会．
	instruct_0()
	instruct_1(1566,40,0)--[40木岛主]:这就是了，这部”太玄经”*以古蝌蚪文写成，我本来正*自奇怪，石兄弟年纪轻轻，*居然有此奇才，识得这种古*奥文字．
	instruct_0()
	instruct_1(1567,38,1)--[38石破天]:＜我还是别打扰二位岛主好*了．．．可是这蝌蚪还真好*玩．．．＞*＜咦！这些蝌蚪怎麽在我身*体各处跑了起来．．．．．*怎麽这样地舒畅．．．．＞
	instruct_0()
	instruct_1(1568,0,1)--[0资]:贤弟，你干什么？
			    SetS(106, 63, 1, 0, 0)
                SetS(106, 63, 2, 0, 38)
	            JY.Person[38]["攻击力"] = JY.Person[38]["攻击力"]+300
	            JY.Person[38]["轻功"] = JY.Person[38]["轻功"]+300
	            JY.Person[38]["防御力"] = JY.Person[38]["防御力"]+300
				JY.Person[38]["生命最大值"] = JY.Person[38]["生命最大值"]*4
	            JY.Person[38]["生命"] = JY.Person[38]["生命最大值"]
                JY.Person[38]["内力最大值"] = JY.Person[38]["内力最大值"]*3
	            JY.Person[38]["内力"] = JY.Person[38]["内力最大值"]
	            JY.Person[38]["声望"] = 102
				JY.Person[38]["武功等级1"] = 999
				JY.Person[38]["武功2"] = 102
				JY.Person[38]["武功等级2"] = 999
				if WarMain(288) == false then
				else
	instruct_0()
	instruct_2(80,1)--得到物品[80太玄经]1个
		if GetS(111, 0, 0, 0) == 0 then
	    say("原来如此，这太玄神功果然精妙。",0) 
	    instruct_0();
			    if DrawStrBoxYesNo(-1, -1, "是否领悟太玄经？", C_WHITE, 30) == true then 
	                 QZXS("领悟太玄经奥妙！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,102)
				else
				     say("不过却是不适合我，可惜了。",0) 
					 instruct_0()
				end	
		end	
				end
	            JY.Person[38]["攻击力"] = JY.Person[38]["攻击力"]-300
	            JY.Person[38]["轻功"] = JY.Person[38]["轻功"]-300
	            JY.Person[38]["防御力"] = JY.Person[38]["防御力"]-300
				JY.Person[38]["生命最大值"] = JY.Person[38]["生命最大值"]/4
	            JY.Person[38]["生命"] = JY.Person[38]["生命最大值"]
                JY.Person[38]["内力最大值"] = JY.Person[38]["内力最大值"]/3
	            JY.Person[38]["内力"] = JY.Person[38]["内力最大值"]
	            JY.Person[38]["声望"] = 102
	instruct_0()
	instruct_14()
	instruct_13()
	instruct_1(1569,38,1)--[38石破天]: 啊！好累．*我怎麽觉得好累．
	instruct_0()
	instruct_1(1570,0,1)--[0资]:贤弟，你总算清醒过来了．
	instruct_0()
	instruct_1(1571,38,1)--[38石破天]:怎麽，*难道我昏迷过去了吗？
	instruct_0()
	instruct_1(1572,0,1)--[0资]:是啊！原先我以为你又着魔*了，后来龙岛主说你正悟出*神功，我才没有去吵你，前*后算起来已有三天了．
	instruct_0()
	instruct_1(1573,38,1)--[38石破天]:是吗？已经三天了，*难怪我觉得好饿．
	instruct_0()
	instruct_1(1574,39,0)--[39龙岛主]:石兄弟，我兄弟俩闷在心中*数十年的大疑团，终於得以*解开，真是太感激你了．
	instruct_0()
	instruct_1(1575,38,1)--[38石破天]:我怎麽．．怎麽解破的?
	instruct_0()
	instruct_1(1576,39,0)--[39龙岛主]:石兄弟何必如此谦虚？你参*透了这首”侠客行”的石壁*图谱，不但是现今武林中的*第一人，除了当年在石壁上*雕写图谱的那位前辈之外，*只怕古往今来，也极少有人*及得上你．
	instruct_0()
	instruct_1(1577,38,1)--[38石破天]:小人不敢，小人不敢．
	instruct_0()
	instruct_1(1578,39,0)--[39龙岛主]:这石壁上的蝌蚪古文，在下*与木兄弟所识还不到一成，*不知石兄弟肯赐予指教麽？
	instruct_0()
	instruct_1(1579,38,1)--[38石破天]:我跟两位说了便是，我看这*条蝌蚪，”中注穴”中便有*跳动;*再看这条蝌蚪，”太赫穴”*便大跳一下．．．．
	instruct_0()
	instruct_1(1580,40,0)--[40木岛主]:原来．．原来．．石帮主看*的是一条条．．那个蝌蚪，*不是看一个个字．．．*那麽石帮主如何能通解全篇*”太玄经”？
	instruct_0()
	instruct_1(1581,38,1)--[38石破天]:小人自幼没读过书，当真一*字不识，惭愧的紧．
	instruct_0()
	instruct_1(1582,40,0)--[40木岛主]:你不识字？
	instruct_0()
	instruct_1(1583,38,1)--[38石破天]:不识字．我．．回去之后，*定要去学识字，否则人人都*识字，我却不识得，给人笑*话，多不好意思．
	instruct_0()
	instruct_1(1584,39,0)--[39龙岛主]:你既不识字，那麽这些壁上*许许多多的注释，却是谁解*给你听的？
	instruct_0()
	instruct_1(1585,38,1)--[38石破天]:没人解给我听．*我．．．只是瞧着图形，胡*思乱想，忽然之间，图上的*云头或小剑什麽的，就和身*体内的热气连在一起了．
	instruct_0()
	instruct_1(1586,40,0)--[40木岛主]:你不识字，却能解通图谱，*这．．．如何能够？
	instruct_0()
	instruct_1(1587,39,0)--[39龙岛主]:难道冥冥之中真有天意？*还是这位石兄弟真有天纵英*才．
	instruct_0()
	instruct_1(1588,40,0)--[40木岛主]:．．．．．*我懂了，我懂了．*大哥，原来如此．
	instruct_0()
	instruct_1(1589,39,0)--[39龙岛主]:啊！是了．是了．*石兄弟，幸亏你不识字，才*得解破这个大疑团．*唉！原来这许许多多注释文*字，每一句都在导人误入歧*途．可是参研图谱之人，又*有那个肯不去钻研注解．
	instruct_0()
	instruct_1(1590,39,0)--[39龙岛主]:原来这篇”太玄经”也不是*真的蝌蚪文，只不过．．．*只不过是一些经脉穴道的线*路方位而已．***唉，三十年的光阴，三十年*的光阴！
	instruct_0()
	instruct_1(1591,40,0)--[40木岛主]:白首太玄经！*兄弟，你的头发也真是雪白*了．
	instruct_0()
	instruct_1(1592,39,0)--[39龙岛主]:此岛名为侠客岛，是因为我*们兄弟二人在此间还发现了*另一部奇书，叫《侠客行》*。我二人发下誓愿，谁能解*得了这壁上图谱，便奖此书*曾与谁。如今图谱已解，这*本书就赠与石帮主吧。
	instruct_0()
	instruct_1(1593,38,1)--[38石破天]:我不识字，这本书要来也没*有用。这位大哥好像正在找*这本书吧，那我就把这本书*送给大哥好了。
	instruct_0()
	instruct_1(1594,0,1)--多谢石兄弟，多谢二位岛主*。
	instruct_0()
	instruct_1(1595,39,0)--[39龙岛主]:兄弟，你我心愿已了，我们*也该歇息了．这腊八粥之约*以后也不必了．*我们这就去告诉各位掌门不*用再钻研此图解了．**公子，你们也可赶紧离去。
	instruct_0()
	instruct_1(1596,0,1)--[0资]:前辈，告辞了。
	instruct_0()
	instruct_2(154,1)--得到物品[154侠客行]1个
	instruct_0()
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);
	instruct_3(-2,16,0,0,0,0,419,0,0,0,-2,-2,-2);
	instruct_3(-2,17,0,0,0,0,419,0,0,0,-2,-2,-2);
	instruct_3(-2,18,0,0,0,0,419,0,0,0,-2,-2,-2);
	instruct_3(-2,3,1,0,418,0,0,5136,5136,5136,-2,-2,-2);
	instruct_3(-2,2,1,0,417,0,0,5132,5132,5132,-2,-2,-2);
	instruct_0()
	instruct_13()
	if cxzj() == 38 then
	instruct_35(zj(),1,102,0)--[38石破天]学会[102太玄神功]
	instruct_46(zj(),100)--[38石破天]增加内力1000
	instruct_47(zj(),50)--[38石破天]增加武功50
	else
	instruct_35(38,1,102,0)--[38石破天]学会[102太玄神功]
	instruct_46(38,100)--[38石破天]增加内力1000
	instruct_47(38,50)--[38石破天]增加武功50
	end
	do return; end
    end
end

OEVENTLUA[392] = function()
    instruct_1(1527,38,0) -- [38石破天]:大哥，雪山派的白师父怎么*样了？
	instruct_0()
	instruct_1(1528,0,1)--[0资]:他很好啊，原本应该发给他*的铜牌现在已经发给我了*……
	instruct_0()
	instruct_1(1529,38,0)--[38石破天]:那我们一起去侠客岛吧
	instruct_0()
	     if instruct_9(0,95) == true then
		    instruct_37(1)
			instruct_1(1530,0,1)
			if cxzj() == 38 then
			    instruct_14()
				instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);
			    instruct_0()
	            instruct_13()
				for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do
			    JY.Person[zj()]["武功"..i] = JY.Person[38]["武功"..i]
				end
				do return; end
            else 
			    instruct_3(104,43,1,0,957,0,0,7074,7074,7074,-2,-2,-2);
			
			 if instruct_20(20,0) == false then
			    instruct_14()
				instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);
			    instruct_0()
	            instruct_13()
				instruct_10(38)
				 do return; end
             end 
			 
			    instruct_1(12,38,0)
				instruct_0()
	            instruct_14()
				instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);
				instruct_3(70,16,1,0,127,0,0,6410,6410,6410,-2,-2,-2);
				instruct_3(70,58,1,0,127,0,0,6412,6412,6412,-2,-2,-2);
	            instruct_0()
	            instruct_13()
			 do return; end
          end 
          end		  
	instruct_1(1531,0,1)--[0资]:我还有事，*你在这里等我吧。
	instruct_0()
	instruct_3(-2,-2,1,0,393,0,0,-2,-2,-2,-2,-2,-2);
end

OEVENTLUA[62] = function()
    instruct_1(272,225,0) -- 一呀摸，二呀摸，摸到姐姐*的头发边……唉，我韦小宝*什么时候能离开这里，一定*要发大财，取一堆漂亮老婆*，开个特大的妓院，哈哈…*…
	instruct_0()
	    if instruct_9(2,0) == false then -- 是否加入
		   instruct_0()
		    do return; end
        end     
		   instruct_26(1,10,1,0,0) 
		   instruct_26(1,7,1,0,0) 
		   instruct_1(273,225,0) --出去玩？＜这个家伙看着好*像挺能打的，跟着他不会吃*亏……我娘现在不在这……*哈哈，就这么定了……＞，*好啊，出去找漂亮老婆，好*爽好爽。
		   instruct_0()
    if instruct_20(21,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
		   instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2); 
		   instruct_0()
		   instruct_1(274,225,0)
		   instruct_10(664)
		   instruct_0()
		   instruct_3(71,20,0,0,0,0,63,0,0,0,-2,-2,-2); 
		   instruct_3(76,12,0,0,0,0,89,-2,-2,-2,-2,-2,-2); 
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end
	say("都没地方让我呆着，还是算了。",664)
end

OEVENTLUA[89] = function()
    if instruct_16(664) then
	instruct_0();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
	       instruct_3(76,0,1,0,0,0,0,6292,6292,6292,-2,-2,-2); 
		   instruct_3(76,1,1,0,0,0,0,5956,5956,5956,-2,-2,-2); 
		   instruct_3(76,2,1,0,0,0,0,6306,6306,6306,-2,-2,-2); 
		   instruct_3(76,11,1,0,0,0,0,7030,7030,7030,-2,-2,-2);	
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);
        instruct_25(29,43,29,32) --主角移动
		instruct_1(150,86,0) -- 阿珂 。。。。。。
		instruct_0()
		instruct_1(334,225,1)
		instruct_0()
		instruct_1(335,0,1)
		instruct_0()
		instruct_1(336,229,0)
		instruct_0()
		instruct_1(337,150,0)
		instruct_0()
		instruct_1(338,139,0)
		instruct_0()
		instruct_1(339,229,0)
		instruct_0()
		instruct_1(340,150,0)
		instruct_0()
		instruct_1(341,229,0)
		instruct_0()
		instruct_1(342,139,0)
		instruct_0()
		instruct_1(343,229,0)
		instruct_0()
		instruct_1(344,139,0)
		instruct_0()
		instruct_1(345,0,1)
		instruct_0()
		instruct_1(346,150,0)
		instruct_0()
		instruct_1(347,229,0)
		instruct_0()
		instruct_1(348,225,1)
		instruct_0()
		
		if instruct_6(136,4,0,0) ==false then    --  6(6):战斗[146]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end

		instruct_19(27,33)
		instruct_40(1)
		instruct_17(-2,1,27,31,8256)
		instruct_0();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
		instruct_1(349,225,1)
		instruct_0()
		instruct_1(350,86,0) 
		instruct_0()
		instruct_1(351,225,1)
		instruct_0()
		instruct_1(352,86,0)  
		instruct_0()
		instruct_1(353,225,1) 
		instruct_0()
		instruct_1(354,86,0) 
		instruct_0()
		instruct_1(355,225,1) 
		instruct_0()
		instruct_1(356,139,0)
		instruct_0()
		instruct_1(357,86,0) 
		instruct_0()
		instruct_1(358,139,0)
		instruct_0()
		instruct_1(359,225,1) 
		instruct_0()
		instruct_1(360,86,0) 
		instruct_0()
		instruct_1(150,139,0)
		instruct_0()
		instruct_1(361,225,1) 
		instruct_0()
		instruct_1(362,86,0) 
		instruct_0()
		instruct_1(363,139,0)
		instruct_0()
		instruct_1(364,225,1) 
		instruct_0()
		instruct_14()
		instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
		instruct_0();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
		instruct_1(365,225,1) 
		instruct_0()
		instruct_1(366,229,0) 
		instruct_0()
		    if instruct_43(228,54,0) == false then
			   instruct_2(228,1)
			   instruct_0()
		       instruct_1(367,0,1)
		       instruct_0()
			   instruct_1(368,229,0) 
		       instruct_0()
			   instruct_1(369,225,1) 
		       instruct_0()
			   instruct_1(370,229,0) 
		       instruct_0()
			   instruct_1(371,0,1)
		       instruct_0()
			   instruct_14()
			   instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0)
			   instruct_17(-2,1,27,31,0)
			   instruct_0();   --  14(E):场景变黑
               instruct_13();   --  13(D):重新显示场景
			   instruct_0()
			 	do return; end
            end
		instruct_26(1,10,1,0,0)	
		instruct_26(1,7,1,0,0)
        instruct_1(372,225,1) 
		instruct_0()
		instruct_2(229,1)
		instruct_32(228,-1)
		instruct_1(367,0,1)
		       instruct_0()
			   instruct_1(368,229,0) 
		       instruct_0()
			   instruct_1(369,225,1) 
		       instruct_0()
			   instruct_1(370,229,0) 
		       instruct_0()
			   instruct_1(371,0,1)
		       instruct_0()
			   instruct_14()
			   instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0)
			   instruct_17(-2,1,27,31,0)
			   instruct_3(69,11,1,0,90,0,0,8256,8256,8256,-2,-2,-2)
			   instruct_3(69,10,1,0,91,0,0,7036,7036,7036,-2,-2,-2)
			   instruct_3(69,12,1,0,92,0,0,7030,7030,7030,-2,-2,-2)
			   instruct_0();   --  14(E):场景变黑
               instruct_13();   --  13(D):重新显示场景
			   instruct_1(388,225,1)
			   instruct_0()
			   instruct_0()
			   instruct_21(664)
			   setteam(664, 0)
		    do return; end
        end
end

OEVENTLUA[214] = function()
    instruct_1(479,0,1);  --这上面似乎记载着使用这柄*重剑的法门，不知是谁刻的*？
	instruct_0()
	if instruct_16(35,0,263) == true then --判断令狐冲是否在队
	    instruct_1(4100,35,0);   
        instruct_0(); 
	
		if instruct_16(58,0,130) == true then --判断杨过是否在队
		instruct_1(4101,58,0);
        instruct_0();		
		instruct_1(4102,35,0);   
        instruct_0();
		instruct_1(4103,58,0);
		instruct_0();
		instruct_1(4104,0,0);
		instruct_0();
		instruct_14()
	    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    	instruct_0();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
	    instruct_0();   --  0(0)::空语句(清屏)
	    instruct_1(4105,35,0);
	    instruct_0();   --  0(0)::空语句(清屏)
	    instruct_1(4106,58,0);
        instruct_0();
	    instruct_47(35,50);
	    instruct_35(35,1,45,0);
	    instruct_45(58,50);
	    instruct_35(58,1,47,0);
	    instruct_0();   --  0(0)::空语句(清屏)
	    instruct_2(116,1); 
	    instruct_0();   --  0(0)::空语句(清屏)
	    instruct_1(4107,0,0); 
	    instruct_0();   --  0(0)::空语句(清屏)
        do return; end
		end
	instruct_1(4108,0,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4109,35,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4110,0,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4111,35,0);
	instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4112,0,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(116,1);   --  
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4116,35,0);	
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4113,0,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4114,35,0);	
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(4115,35,0);
    instruct_35(35,1,45,0);	
	instruct_0();   --  0(0)::空语句(清屏)
            do return; end
		end
	instruct_1(4117,0,0);
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(116,1);   --  
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[255] = function() 
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(720,165,0);   --  1(1):[???]说: 他应该已经睡了吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(721,81,0);   --  1(1):[???]说: 肯定睡下了，这小鬼每天这*个时候都会睡的很香。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(717,165,0);   --  1(1):[???]说: 真儿，我们这场戏一定要做*的真，不能让他起丝毫的疑*心。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(718,81,0);   --  1(1):[???]说: 爹，你就放心吧。你看我这*些天伺候那小鬼，他已对我*神魂颠倒，一点都不怀疑，*呵呵呵……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(719,165,0);   --  1(1):[???]说: 恩，明天咱们就出发，前往*冰火岛。武林中人梦寐以求*的屠龙宝刀就要成为我朱长*龄的了，哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(722,0,1);   --  1(1):[AAA]说: ＜原来他们父女诱骗张无忌*，是为了屠龙刀啊，我是不*是该通知张无忌呢？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(0,22) ==true then    --  11(B):是否住宿否则跳转到:Label0
        instruct_37(1);   --  37(25):增加道德1
        instruct_1(723,0,1);   --  1(1):[AAA]说: 我去找找无忌吧
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,3,-2,0,256,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        do return; end
    end    --:Label0

    instruct_37(-2);   --  37(25):增加道德-2
    instruct_1(724,0,1);   --  1(1):[AAA]说: ＜都说这屠龙宝刀是武林至*尊，说不定和天书有关，我*不妨看看这场戏，说不定能*得到什么好处……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(725,165,0);   --  1(1):[???]说: 什么人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,22,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(726,165,0);   --  1(1):[???]说: 你是何人？要坏我的好事么*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(727,0,1);   --  1(1):[AAA]说: 没有没有。误会误会，我是*想和你们一起干。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(728,165,0);   --  1(1):[???]说: 哼！宝刀只有一个，你还想*分一半么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(729,0,1);   --  1(1):[AAA]说: 我不是要宝刀……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(730,9,0);   --  1(1):[张无忌]说: 啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(731,81,0);   --  1(1):[???]说: 不好，是无忌，他好像听到*了我们谈话，往山那边跑了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(732,165,0);   --  1(1):[???]说: 快追！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,5,0,0,0,0,0,5752,5752,5752,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,7,0,0,0,0,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_19(44,19);   --  19(13):主角移动至2C-13
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_25(44,17,44,17);   --  25(19):场景移动44-17--44-17
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(733,9,0);   --  1(1):[张无忌]说: 你们，你们居然骗我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(734,81,0);   --  1(1):[???]说: 好弟弟，快过来，姐姐疼你
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(735,9,0);   --  1(1):[张无忌]说: 不要，你们不要过来，你们*……啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(736,0,1);   --  1(1):[AAA]说: 小心悬崖！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(737,165,0);   --  1(1):[???]说: 我的宝刀，你不能死，我…*…啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(738,81,0);   --  1(1):[???]说: 爹——！ 
	   say("糟糕，屠龙刀必定和天书有关，我不能就这么放弃！")
	if yesno("要跳下去吗？") then
	   say("啊～！")
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(68,3,1,0,5011,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
    instruct_3(68,13,1,0,5011,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
	instruct_3(68,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [7]
    instruct_3(11,106,0,0,0,0,5014,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(11,107,0,0,0,0,5014,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
	instruct_3(4,4,1,0,5012,0,0,2715*2,2715*2,2715*2,-2,26,14);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	instruct_3(4,5,1,0,5012,0,0,2720*2,2720*2,2720*2,-2,24,14);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(4,1,1,0,5013,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [1]
	JY.Scene[4]["进入条件"] = 0
    My_Enter_SubScene(4,20,15,2)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	instruct_27(-1,3013*2,3018*2)
	   do return; end
    end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,23,0,0,0,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_19(45,18);   --  19(13):主角移动至2D-12
    instruct_40(1);   --  40(28):改变主角站立方向1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(739,81,0);   --  1(1):[???]说: 爹爹……为了抓那个小鬼，*自己也坠入山崖……爹爹…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(740,244,1);   --  1(1):[???]说: 朱姑娘，不要难过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(741,81,0);   --  1(1):[???]说: 又不是你没了父亲，你当然*不难过了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(742,0,1);   --  1(1):[AAA]说: 我们去找找他们吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(743,81,0);   --  1(1):[???]说: 我从今后就孤苦伶仃一个人*了……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(744,244,1);   --  1(1):[???]说: 朱姑娘，跟我一起走吧，去*这附近的山谷找一找，说不*定令尊吉人天相……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(745,81,0);   --  1(1):[???]说: 呜呜……*好吧……*这悬崖下面应该是昆仑山谷*，说不定昆仑派会有人见到*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(746,0,1);   --  1(1):[AAA]说: ＜没找到天书，得到了美女*，也不错啊……＞
    instruct_3(68,3,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
    instruct_3(68,13,1,0,257,0,0,5412,5412,5412,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
    instruct_3(11,106,0,0,0,0,290,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(11,107,0,0,0,0,290,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(33,23,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [23]
    instruct_3(33,24,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [24]
    instruct_3(33,25,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [25]
    instruct_3(33,27,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [27]
    instruct_3(33,26,0,0,0,0,309,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [26]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,62,1,0,982,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [62]
	if GetS(106, 5, 1, 1) ~= -1 then
		SetS(106, 5, 1, 1, 2)
		SetS(28, 16, 12, 3, 99)
		instruct_3(28,99,1,0,31030,0,0,5374,5374,5374,-2,-2,-2); 		
	else
		SetS(106, 5, 1, 1, 1)
	end
    if instruct_20(21,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_10(81);   --  10(A):加入人物[朱九真]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_1(12,81,0);   --  1(1):[???]说: 你的队伍已满，我就直接去*小村吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(70,46,1,0,177,0,0,7026,7026,7026,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [46]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end

OEVENTLUA[285] = function()
    instruct_26(40,9,4,0,0);   --  
	instruct_26(40,10,4,0,0);   --  
	instruct_26(40,12,4,0,0);   --  
	instruct_1(954,0,1);--:谢前辈，*这是成崑的项上人头。*成崑作恶多端已遭天谴。
	instruct_0();
	instruct_1(955,13,0);--是吗？哈！哈！*成崑啊，成崑！*你作恶多端终遭天谴，*但，可惜啊，可惜！*我不能亲手杀了你。
	instruct_0();
	instruct_1(956,0,1);
	instruct_0();
	instruct_1(957,13,0);
	instruct_0();
	instruct_2(155,1);
	instruct_0();
	if PersonKF(zj(),92) and GetS(111, 0, 0, 0) == 0 then
	   say("谢某无以为报，只有一门狮吼功可传与少侠，少侠可愿意？",13) 
	   instruct_0();
	   	if instruct_11(0,188) == true then
	       QZXS("领悟狮子王吼！")
	       instruct_0();
	       say("多谢谢法王",0) 
	       SetS(111, 0, 0, 0,92)
		else
			say("法王客气了，小子受之有愧",0) 
		end
	instruct_3(-2,-2,1,0,287,0,0,-2,-2,-2,-2,-2,-2); 	
    do return; end
    end
    instruct_3(-2,-2,1,0,287,0,0,-2,-2,-2,-2,-2,-2);
end

OEVENTLUA[268] = function() 
    instruct_14();   --  14(E):场景变黑
    instruct_37(5);   --  37(25):增加道德5
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_39(72);   --  39(27):打开场景冰火岛
    instruct_3(33,2,1,0,1062,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [2]
    instruct_3(34,0,1,0,1066,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[崆峒派]:场景事件编号 [0]
    instruct_13();   --  13(D):重新显示场景
    instruct_25(29,47,29,36);   --  25(19):场景移动29-47--29-36
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(794,8,0);   --  1(1):[唐文亮]说: 魔教已然一败涂地，再不投*降，还待怎的？空闻大师，*咱们这便去毁了魔教三十三*代教主的牌位吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(795,7,0);   --  1(1):[何太冲]说: 什麽投不投降？*魔教之众，*今日不能留下任何活口。*除恶务尽，*否则他日死灰复燃，*又将为害江湖。*魔崽子们！*识时务的快快自我了断，*省得大爷们动手。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(796,169,0);   --  1(1):[???]说: 华山派和崆峒派各位，*请将顶上的魔教余孽一概诛*灭了。*武当派从西往东搜索，峨嵋*派从东往西搜索，别让魔教*有一人漏网。*崑仑派预备火种，焚烧魔教*巢穴。**少林弟子各取法器，诵念往*生经文，替六派殉难英雄，*魔教教众超渡，化除冤孽。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(29,48,29,38);   --  30(1E):主角走动29-48--29-38
    instruct_1(797,0,1);   --  1(1):[AAA]说: 哇！这里这麽多人，干什麽*这麽热闹，可少不了小侠我*。我说名门正派又怎麽样，*还不是一样赶尽杀绝，跟魔*教又有什麽两样，只不过藉*口好听一点罢了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(798,169,0);   --  1(1):[???]说: 少侠非魔教人士，*还请速速离去，*以免受池鱼之殃。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(799,0,1);   --  1(1):[AAA]说: 那好，大家都别打了，因为*这中间着实有许多误会，*让我好好说给你们听。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(800,6,0);   --  1(1):[灭绝]说: 现在年轻人都这麽狂妄吗？*你自以为是武林盟主吗！*要我们听你说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(801,8,0);   --  1(1):[唐文亮]说: 你这小贼，跟魔教勾结，*想要拖延时间，好施什麽诡*计麽？先杀了你再说。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(802,0,1);   --  1(1):[AAA]说: 我就知道要你们安安静静听*我说是不太可能，那只有想*办法让你们服气了。*哪一派先来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(803,7,0);   --  1(1):[何太冲]说: 好狂妄的口气，我昆仑派就*来领教阁下高招！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_20(1511,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label0
        instruct_1(858,9,0);   --  1(1):[张无忌]说: 我来帮你！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(146,3,0,0) ==false then    --  6(6):战斗[146]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label1

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(804,109,0);   --  1(1):[???]说: 看我华山派的。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(147,3,0,0) ==false then    --  6(6):战斗[147]是则跳转到:Label2
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(805,8,0);   --  1(1):[唐文亮]说: 让你尝尝我崆峒七伤拳的厉*害
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(148,3,0,0) ==false then    --  6(6):战斗[148]是则跳转到:Label3
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label3

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
		
		if MPPD(0) == 5 then
			Cls()
			say("师侄，你也要和我过招么？",170,0,"空见") 	
			Cls()
			say("弟子不敢，只恳请师叔带众师兄弟离开此处。弟子日后一定会给师叔一个交待的。") 
			Cls()
			say("唉，罢了。",170,0,"空见") 
			say("师侄，这是师叔的毕生绝学，现传授与你",170,0,"空见") 
			say("你好自为之，切莫与奸邪同流合污",170,0,"空见") 
			instruct_2(92,1);   --  2(2):得到物品[龙爪手][1]
			say("弟子谨记师叔教诲。")
			say("阿弥陀佛",170,0,"空见") 
			dark()
			light()				
		else
			instruct_1(806,170,0);   --  1(1):[???]说: 少侠武功盖世，老衲前来领*教一二。
			instruct_0();   --  0(0)::空语句(清屏)

			if instruct_6(149,3,0,0) ==false then    --  6(6):战斗[149]是则跳转到:Label4
				instruct_15(0);   --  15(F):战斗失败，死亡
				do return; end
			end    --:Label4

			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			instruct_2(92,1);   --  2(2):得到物品[龙爪手][1]
		end
		
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(807,6,0);   --  1(1):[灭绝]说: 小子，你以为你是武林盟主*吗？就算你有屠龙刀在手，*还要问问我手上的倚天剑答*不答应！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(150,3,0,0) ==false then    --  6(6):战斗[150]是则跳转到:Label5
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
        end    --:Label5

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(808,6,0);   --  1(1):[灭绝]说: 现在就看武当派的了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(809,171,0);   --  1(1):[???]说: 这个……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(810,9,0);   --  1(1):[张无忌]说: 大师伯，你们别打了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(811,171,0);   --  1(1):[???]说: 你，你，你是无忌！你是我*五弟的儿子张无忌！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(812,9,0);   --  1(1):[张无忌]说: 大师伯，是我，太师父他老*人家还好吧？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(813,171,0);   --  1(1):[???]说: 好，好，孩子，你身上的寒*毒好了吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(814,9,0);   --  1(1):[张无忌]说: 谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(815,171,0);   --  1(1):[???]说: 什么误会？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(816,9,0);   --  1(1):[张无忌]说: 就让这位少侠来说吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(817,0,1);   --  1(1):[AAA]说: 事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(818,8,0);   --  1(1):[唐文亮]说: 话都是你在说的，*是不是真的，*我们怎麽知道。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(819,6,0);   --  1(1):[灭绝]说: 武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(820,169,0);   --  1(1):[???]说: 阿弥陀佛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(821,7,0);   --  1(1):[何太冲]说: 哼！技不如人，*说这麽多做什麽，*走吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(822,171,0);   --  1(1):[???]说: 无忌，还有这位少侠，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*我们走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
        instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
        instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
        instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
        instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
        instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
        instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
        instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
        instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
        instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,79,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
        instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
        instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
        instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
        instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
        instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
        instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
        instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
        instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,84,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
        instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
        instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
        instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
        instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
        instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
        instruct_3(-2,99,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [99]
        instruct_3(-2,98,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [98]
        instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [108]
        instruct_3(-2,104,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
        instruct_3(-2,110,1,0,272,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [110]
        instruct_3(-2,109,1,0,270,280,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [109]
        instruct_19(28,17);   --  19(13):主角移动至1C-11
        instruct_25(28,15,28,15);   --  25(19):场景移动28-15--28-15
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(823,14,0);   --  1(1):[韦一笑]说: 你们两个小子，还不赖嘛！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(824,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼。明教全教*下上，叩谢少侠和张公子护*教救命的大恩！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(825,0,1);   --  1(1):[AAA]说: 快别这麽说，仗义行侠，本*就是我辈中人应当做的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(826,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了。这样*吧，大家听我一言，我说呢*，这位少侠武功盖世义薄云*天，於本教有存亡续绝的大*恩。咱们拥立他为本教第三*十四任教主。由他来做教主*，总比你来做教主好吧，杨*左使，你说对不对啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(827,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(828,14,0);   --  1(1):[韦一笑]说: 你。。。。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(829,12,0);   --  1(1):[殷天正]说: 你们两个别在那里吵了，丢*人现眼的。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(830,247,1);   --  1(1):[???]说: 不，不，我仍有要事在身，*这个教主是无论如何不能当*的。*＜南贤老头说我有什么天命*在身，听起来比这个教主可*威风多了。＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(831,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，到时又会被*其他门派围攻，导致灭亡了*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(832,0,1);   --  1(1):[AAA]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(833,10,0);   --  1(1):[范遥]说: 可是谢法王至今杳无音信，*明教却不可一日无主啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(834,9,0);   --  1(1):[张无忌]说: 我义父应该在冰火岛，咱们*去找他吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(835,0,1);   --  1(1):[AAA]说: 我倒有个主意。这位张公子*，今日也可算是明教的恩人*。他是鹰王的外孙，可算是*明教自己人。他还是狮王的*义子，就算狮王做了教主，*子继父业也是理所当然。而*且张公子似乎另有奇遇，武*功卓绝，这个明教教主，再*合适不过了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(836,14,0);   --  1(1):[韦一笑]说: 少侠此言有理，我韦一笑第*一个赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(837,9,0);   --  1(1):[张无忌]说: 我，我，我不行的……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(838,11,0);   --  1(1):[杨逍]说: 我赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(839,10,0);   --  1(1):[范遥]说: 我也赞成！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(840,12,0);   --  1(1):[殷天正]说: 无忌，你就不要推辞了，难*道你连外公的话都不听吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(841,9,0);   --  1(1):[张无忌]说: 我……好吧……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(842,11,0);   --  1(1):[杨逍]说: 明教光明左使杨逍
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(843,10,0);   --  1(1):[范遥]说: 光明右使范遥
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(844,12,0);   --  1(1):[殷天正]说: 白眉鹰王殷天正
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(845,14,0);   --  1(1):[韦一笑]说: 青翼蝠王韦一笑
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(846,0,2);   --  1(1):[AAA]说: 明教众人：*        参见教主！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(847,9,0);   --  1(1):[张无忌]说: 使不得，使不得，你们快起*来……
		JoinMP(9,13,5)
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(848,0,1);   --  1(1):[AAA]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*《倚天屠龙记》的书？*是否能借我一下。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(849,11,0);   --  1(1):[杨逍]说: 有的。这是我明教镇教之宝*，历来由专人掌管。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(850,247,1);   --  1(1):[???]说: 是吗？真的有。皇天不负苦*心人，打了这麽多场仗，终*於让我找到了。不知是哪位*掌管此书？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(851,10,0);   --  1(1):[范遥]说: 金毛狮王谢逊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(852,0,1);   --  1(1):[AAA]说: 张公子，你知道你义父所在*吧，咱们去找他吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(853,9,0);   --  1(1):[张无忌]说: 好啊，我一直想把义父接回*来。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(854,11,0);   --  1(1):[杨逍]说: 可是，现在明教大敌刚去，*有许多事情需要教主安排，*教主你不能轻离光明顶啊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(855,9,0);   --  1(1):[张无忌]说: 杨左使此言有理。那就拜托*少侠去找寻我义父吧，他就*在极北的冰火岛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(856,0,1);   --  1(1):[AAA]说: 好，那我这就去寻找谢法王*。各位，告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(857,9,0);   --  1(1):[张无忌]说: 少侠慢走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,274,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        do return; end
    end    --:Label0


    if instruct_6(9,3,0,0) ==false then    --  6(6):战斗[9]是则跳转到:Label6
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label6

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(804,109,0);   --  1(1):[???]说: 看我华山派的。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(11,3,0,0) ==false then    --  6(6):战斗[11]是则跳转到:Label7
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label7

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(805,8,0);   --  1(1):[唐文亮]说: 让你尝尝我崆峒七伤拳的厉*害
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(12,3,0,0) ==false then    --  6(6):战斗[12]是则跳转到:Label8
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label8

	if MPPD(0) == 5 then
		Cls()
		say("师侄，你也要和我过招么？",170,0,"空见") 	
		Cls()
		say("弟子不敢，只恳请师叔带众师兄弟离开此处。弟子日后一定会给师叔一个交待的。") 
		Cls()
		say("唉，罢了。",170,0,"空见") 
		dark()
		light()
	else
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		instruct_1(806,170,0);   --  1(1):[???]说: 少侠武功盖世，老衲前来领*教一二。
		instruct_0();   --  0(0)::空语句(清屏)

		if instruct_6(149,3,0,0) ==false then    --  6(6):战斗[149]是则跳转到:Label9
			instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
		end    --:Label9

		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		instruct_2(92,1);   --  2(2):得到物品[龙爪手][1]
	end
	
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(807,6,0);   --  1(1):[灭绝]说: 小子，你以为你是武林盟主*吗？就算你有屠龙刀在手，*还要问问我手上的倚天剑答*不答应！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(150,3,0,0) ==false then    --  6(6):战斗[150]是则跳转到:Label10
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label10

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(808,6,0);   --  1(1):[灭绝]说: 现在就看武当派的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(809,171,0);   --  1(1):[???]说: 这个……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(810,9,0);   --  1(1):[张无忌]说: 大师伯，你们别打了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(811,171,0);   --  1(1):[???]说: 你，你，你是无忌！你是我*五弟的儿子张无忌！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(812,9,0);   --  1(1):[张无忌]说: 大师伯，是我，太师父他老*人家还好吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(813,171,0);   --  1(1):[???]说: 好，好，孩子，你身上的寒*毒好了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(814,9,0);   --  1(1):[张无忌]说: 谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(815,171,0);   --  1(1):[???]说: 什么误会？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(816,9,0);   --  1(1):[张无忌]说: 就让这位少侠来说吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(817,0,1);   --  1(1):[AAA]说: 事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(818,8,0);   --  1(1):[唐文亮]说: 话都是你在说的，*是不是真的，*我们怎麽知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(819,6,0);   --  1(1):[灭绝]说: 武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(820,169,0);   --  1(1):[???]说: 阿弥陀佛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(821,7,0);   --  1(1):[何太冲]说: 哼！技不如人，*说这麽多做什麽，*走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(822,171,0);   --  1(1):[???]说: 无忌，还有这位少侠，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*我们走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,79,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [79]
    instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,84,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,83,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,82,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [82]
    instruct_3(-2,81,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [81]
    instruct_3(-2,80,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [80]
    instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
    instruct_3(-2,99,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [99]
    instruct_3(-2,98,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [98]
    instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [108]
    instruct_3(-2,104,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [104]
    instruct_3(-2,110,1,0,272,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [110]
    instruct_3(-2,109,1,0,270,280,0,5284,5284,5284,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [109]
    instruct_19(28,17);   --  19(13):主角移动至1C-11
    instruct_25(28,15,28,15);   --  25(19):场景移动28-15--28-15
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(823,14,0);   --  1(1):[韦一笑]说: 你们两个小子，还不赖嘛！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(824,10,0);   --  1(1):[范遥]说: 蝠王，不可无礼。明教全教*下上，叩谢少侠和张公子护*教救命的大恩！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(825,0,1);   --  1(1):[AAA]说: 快别这麽说，仗义行侠，本*就是我辈中人应当做的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(826,14,0);   --  1(1):[韦一笑]说: 你们也别这麽客套了。这样*吧，大家听我一言，我说呢*，这位少侠武功盖世义薄云*天，於本教有存亡续绝的大*恩。咱们拥立他为本教第三*十四任教主。由他来做教主*，总比你来做教主好吧，杨*左使，你说对不对啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(827,11,0);   --  1(1):[杨逍]说: 是啊！*这位少侠来做我们教主，*也比你韦一笑来做好的多。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(828,14,0);   --  1(1):[韦一笑]说: 你。。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(829,12,0);   --  1(1):[殷天正]说: 你们两个别在那里吵了，丢*人现眼的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(830,247,1);   --  1(1):[???]说: 不，不，我仍有要事在身，*这个教主是无论如何不能当*的。*＜南贤老头说我有什么天命*在身，听起来比这个教主可*威风多了。＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(831,10,0);   --  1(1):[范遥]说: 少侠如果一直推却不肯，我*们明教恐怕又要为此争闹不*休，四分五裂，到时又会被*其他门派围攻，导致灭亡了*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(832,0,1);   --  1(1):[AAA]说: 我这里有封阳教主的遗书，*上面提到要谢逊谢法王暂代*教主之职。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(833,10,0);   --  1(1):[范遥]说: 可是谢法王至今杳无音信，*明教却不可一日无主啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(834,9,0);   --  1(1):[张无忌]说: 我义父应该在冰火岛，咱们*去找他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(835,0,1);   --  1(1):[AAA]说: 我倒有个主意。这位张公子*，今日也可算是明教的恩人*。他是鹰王的外孙，可算是*明教自己人。他还是狮王的*义子，就算狮王做了教主，*子继父业也是理所当然。而*且张公子似乎另有奇遇，武*功卓绝，这个明教教主，再*合适不过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(836,14,0);   --  1(1):[韦一笑]说: 少侠此言有理，我韦一笑第*一个赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(837,9,0);   --  1(1):[张无忌]说: 我，我，我不行的……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(838,11,0);   --  1(1):[杨逍]说: 我赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(839,10,0);   --  1(1):[范遥]说: 我也赞成！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(840,12,0);   --  1(1):[殷天正]说: 无忌，你就不要推辞了，难*道你连外公的话都不听吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(841,9,0);   --  1(1):[张无忌]说: 我……好吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(842,11,0);   --  1(1):[杨逍]说: 明教光明左使杨逍
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(843,10,0);   --  1(1):[范遥]说: 光明右使范遥
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(844,12,0);   --  1(1):[殷天正]说: 白眉鹰王殷天正
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(845,14,0);   --  1(1):[韦一笑]说: 青翼蝠王韦一笑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(846,0,2);   --  1(1):[AAA]说: 明教众人：*        参见教主！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(847,9,0);   --  1(1):[张无忌]说: 使不得，使不得，你们快起*来……
	JoinMP(9,13,5)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(848,0,1);   --  1(1):[AAA]说: 另外还有一件事拜托你们，*你们明教中是否有一本叫*《倚天屠龙记》的书？*是否能借我一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(849,11,0);   --  1(1):[杨逍]说: 有的。这是我明教镇教之宝*，历来由专人掌管。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(850,247,1);   --  1(1):[???]说: 是吗？真的有。皇天不负苦*心人，打了这麽多场仗，终*於让我找到了。不知是哪位*掌管此书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(851,10,0);   --  1(1):[范遥]说: 金毛狮王谢逊！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(852,0,1);   --  1(1):[AAA]说: 张公子，你知道你义父所在*吧，咱们去找他吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(853,9,0);   --  1(1):[张无忌]说: 好啊，我一直想把义父接回*来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(854,11,0);   --  1(1):[杨逍]说: 可是，现在明教大敌刚去，*有许多事情需要教主安排，*教主你不能轻离光明顶啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(855,9,0);   --  1(1):[张无忌]说: 杨左使此言有理。那就拜托*少侠去找寻我义父吧，他就*在极北的冰火岛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(856,0,1);   --  1(1):[AAA]说: 好，那我这就去寻找谢法王*。各位，告辞了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(857,9,0);   --  1(1):[张无忌]说: 少侠慢走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,0,0,274,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
end

OEVENTLUA[571] = function() --解决挡门乞丐bug
    instruct_1(2418,207,0);   --  1(1):[???]说: 本帮新任帮主庄聚贤，神功*盖世，即将赶赴少林，与玄*慈方丈争夺武林盟主之位！
    instruct_0();   --  0(0)::空语句(清屏)
	if MPPD(0) == 2 and hasthing(147) then
		Cls()
		say("原来是师弟来了，鲁长老已经等候多时，快请进。",207,0,"丐帮弟子")	
		dark()
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0)	
		light()
	end
end

OEVENTLUA[585] = function() --天龙邪线
    instruct_14();   --  14(E):场景变黑
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_3(40,16,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [16]
    instruct_3(40,15,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [15]
    instruct_3(40,14,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [14]
    instruct_3(40,13,1,0,655,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[洛阳城]:场景事件编号 [13]
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,26,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,31,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,557,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,32,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,37,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,557,0,0,6268,6268,6268,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,38,0,0,0,0,0,6152,6152,6152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,39,0,0,0,0,0,5132,5132,5132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,40,0,0,0,0,0,7130,7130,7130,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,41,0,0,0,0,0,5136,5136,5136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,42,0,0,0,0,0,7990,7990,7990,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,43,0,0,0,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,12,1,0,591,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,1,0,591,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	SetS(51, 16, 31, 3, 99)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(39,30,16,29);   --  30(1E):主角走动39-30--16-29
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_32(216,-1);   --  32(20):物品[带头大哥书信]+[-1]
    instruct_1(2530,51,0);   --  1(1):[AAA]说: 乔峰，你看这是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2531,50,0);   --  1(1):[乔峰]说: 是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2532,51,0);   --  1(1):[AAA]说: 你看了便知道。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2533,50,0);   --  1(1):[乔峰]说: 这……这是真的吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2534,51,0);   --  1(1):[AAA]说: 少林方丈亲笔写的，会是假*的吗！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2535,51,0);   --  1(1):[慕容复]说: 我今日请来了智光大师、谭*公、谭婆、赵钱孙等人，他*们都可以作证。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2536,50,0);   --  1(1):[乔峰]说: 我……我……*我不是汉人…………*我是契丹人…………
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2537,51,0);   --  1(1):[AAA]说: 乔峰，你是契丹人，非我族*类，其心必异，怎可担任这*丐帮帮主一职，保管《天龙*八部》一书呢！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2538,50,0);   --  1(1):[乔峰]说: 你要我怎麽做！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2539,51,0);   --  1(1):[AAA]说: 辞去丐帮帮主之位，*交出《天龙八部》一书。
	instruct_0();	
	say("好，乔某今天就辞去这丐帮帮主之位。但是《天龙八部》乃是乔某恩师的遗物，不管谁要拿书，就凭武力来抢吧！",50,0,"乔峰") 	
 	instruct_0();	
	say("（乔峰武力过人，不一定打得过啊。罢了，为了天书，拼了！）好！在下来领教乔兄高招！")
 	instruct_0();	
	say("（好机会，收揽人心，以为己助）乔兄，你是契丹英雄，视我中原豪杰有如无物，区区姑苏慕容复今日也想领教阁下高招。在下死在乔兄掌下，也算是为中原豪杰尽了一分微力，虽死犹荣。",51,0,"慕容复") 	
	instruct_0();	
	say("嘿，你们一起上来吧！",50,0,"乔峰") 	
    if DrawStrBoxYesNo(-1, -1, "我应该和慕容复联手吗？", C_WHITE, 30) == true then		
		JY.Person[53]["攻击力"] = JY.Person[53]["攻击力"]+100
		JY.Person[53]["防御力"] = JY.Person[53]["防御力"]+100
		JY.Person[53]["轻功"] = JY.Person[53]["轻功"]+100
		JY.Person[53]["武功等级1"] = 999
		JY.Person[53]["武功等级2"] = 999	
		JY.Person[50]["声望"] = 0
		
		JY.Person[51]["攻击力"] = JY.Person[51]["攻击力"]+300
		JY.Person[51]["防御力"] = JY.Person[51]["防御力"]+400
		JY.Person[51]["轻功"] = JY.Person[51]["轻功"]+300
		JY.Person[51]["生命最大值"] = JY.Person[51]["生命最大值"] + 3000	
		JY.Person[51]["内力最大值"] = JY.Person[51]["内力最大值"] + 5000		
		JY.Person[51]["生命"] = JY.Person[51]["生命最大值"]	
		JY.Person[51]["内力"] = JY.Person[51]["内力最大值"]	
		JY.Person[51]["武功等级1"] = 999		
		JY.Person[51]["声望"] = 98	
		for i = 1, 4 do
			JY.Person[50]["携带物品数量" .. i] = 0
		end
		instruct_0();	
		say("（多一个人多一份胜算）慕容兄，我们一起上！") 		
		instruct_0();	
		instruct_14()
		instruct_3(-2,99,0,0,0,0,0,6312,6312,6312,-2,-2,-2)
		instruct_13()		
		say("等等，慕容公子，你既然与乔兄齐名就应该一对一才是。乘人之危非君子所为。乔兄，我来助你！",53,0,"段誉") 	
		instruct_0();	
		say("好！没想到一位素昧平生的小兄弟愿与我共患难。从此你就是我兄弟了！兄弟，就让你我二人联手抗敌！",50,0,"乔峰") 			
		if instruct_6(260,4,0,0) ==false then 
			instruct_15(0);  
			do return; end
			instruct_0(); 
		end   		
		JY.Person[51]["攻击力"] = JY.Person[51]["攻击力"]-300
		JY.Person[51]["防御力"] = JY.Person[51]["防御力"]-400
		JY.Person[51]["轻功"] = JY.Person[51]["轻功"]-300
		JY.Person[51]["生命最大值"] = JY.Person[51]["生命最大值"] - 3000	
		JY.Person[51]["内力最大值"] = JY.Person[51]["内力最大值"] - 5000		
		JY.Person[51]["生命"] = JY.Person[51]["生命最大值"]	
		JY.Person[51]["内力"] = JY.Person[51]["内力最大值"]			
		JY.Person[51]["武功等级1"] = 500		
		JY.Person[51]["声望"] = 0	
		JY.Person[50]["声望"] = 108
		JY.Person[53]["攻击力"] = JY.Person[53]["攻击力"]-100
		JY.Person[53]["防御力"] = JY.Person[53]["防御力"]-100
		JY.Person[53]["轻功"] = JY.Person[53]["轻功"]-100		
		for i = 1, 4 do
			JY.Person[50]["携带物品数量" .. i] = 1
		end		
		instruct_0();	
		say("好！既然你们赢了乔某也无话可说，这本书你拿去吧！兄弟，我们走！",50,0,"乔峰") 			
	else
		JY.Person[0]["品德"] = JY.Person[0]["品德"] + 2
		if JY.Person[0]["品德"] > 100 then JY.Person[0]["品德"] = 100 end
		instruct_0();
		if T12YMZ(0) then
			say("乔帮主，你豪迈英武，小妹佩服，但形格势禁，也只好得罪了。") 
			instruct_0();
			say("好，那便请杨女侠赐教。",50,0,"乔峰") 
			instruct_0();
			say("（这乔峰当真豪杰，可惜我胜之不武）请了！") 
		else
			say("乔峰，你虽非汉人，但我敬你侠义，此战就由我俩痛快打一场吧！！") 
			instruct_0();	
			say("好汉子！请！",50,0,"乔峰") 
		end
		if instruct_6(259,4,0,0) ==false then 
			instruct_15(0);  
			do return; end
			instruct_0(); 
		end   
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景	
		addHZ(31)
		if JY.Person[0]["品德"] >= 80 then
			instruct_0();	
			say("好！小兄弟，你我虽立场不同，但我知你为人仁厚，这丐帮绝学降龙二十八掌经我删削重复为了降龙十八掌。萧某不忍心让它失传，就交给你吧。",50,0,"乔峰") 			
			instruct_0();	
			say("乔兄慷慨高义，在下敬服。") 
			instruct_0();
			instruct_2(86,1)	
			addHZ(68)
		end
		instruct_0();	
		say("哈哈哈，长江后浪推前浪！各位英雄，乔峰从此退出江湖不问世事，请了！",50,0,"乔峰") 		
	end	
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,99,0,0,0,0,0,0,0,0,-2,-2,-2)
    instruct_3(-2,14,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(147,1);   --  2(2):得到物品[天龙八部][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2542,207,0);   --  1(1):[???]说: 阁下来此，揭发乔峰的真实*身份，让我丐帮不致误奉一*契丹人为帮主，很是感激。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2544,207,0);   --  1(1):[???]说: 但是，拜你所赐，我丐帮也*将因此事贻笑武林。你拿的*《天龙八部》是丐帮镇帮之*宝，还请阁下留下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2545,0,1);   --  1(1):[AAA]说: 怎麽可以，我好不容易才拿*到手的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2546,207,0);   --  1(1):[???]说: 那只好得罪了。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(84,4,0,0) ==false then    --  6(6):战斗[84]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2547,207,0);   --  1(1):[???]说: 阁下对丐帮的"大恩大德"全*武林的叫化子都会记得的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2548,51,0);   --  1(1):[慕容复]说: 哈哈哈，恭喜少侠如愿以偿*得到天书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2549,247,1);   --  1(1):[???]说: 哪里哪里，多亏慕容公子鼎*力相助
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2550,51,0);   --  1(1):[慕容复]说: 我这就回燕子坞，兄弟如果*有需要我帮忙的地方，尽可*去燕子坞找我
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	SetS(106, 2, 2, 0, 1)
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(52,1,1,0,586,0,0,6302,6302,6302,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [1]
    instruct_3(52,2,1,0,587,0,0,6298,6298,6298,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [2]
	instruct_3(42,0,1,0,9999,0,0,-2,-2,-2,-2,-2,-2); --设置9999 邪线拿北冥
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end


OEVENTLUA[9999] = function() --天龙八部邪线拿北冥
	if instruct_16(51) and instruct_16(76) then
		say("表哥你看！",76,0,"王语嫣")
		instruct_0();   --  0(0)::空语句(清屏)
		say("这座雕像长得跟你好像。。不知道是谁放在这里的。。",51,0,"慕容复")
		instruct_14()
		JY.Person[53]["攻击力"] = JY.Person[53]["攻击力"]+150
		JY.Person[53]["防御力"] = JY.Person[53]["防御力"]+150
		JY.Person[53]["轻功"] = JY.Person[53]["轻功"]+150
		JY.Person[53]["武功等级1"] = 999
		JY.Person[53]["武功等级2"] = 999			
		instruct_3(42,6,1,0,0,0,0,6312,6312,6312,-2,-2,-2)
		instruct_13()
		instruct_0();   --  0(0)::空语句(清屏)
		say("神仙姐姐！是神仙姐姐！",53,0,"段誉")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("原来是你这个家伙！竟然在这里做这种东西对语嫣不敬！",51,0,"慕容复")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("慕容复，休要对我进行污蔑！",53,0,"段誉")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("污蔑你又咋的？枉你是个读书人，竟然满肚子龌蹉思想！",51,0,"慕容复")
		instruct_0();   --  0(0)::空语句(清屏)	
		say("看来你和你那个自命风流的淫棍爹爹也差不多啊！",51,0,"慕容复")
		instruct_0();   --  0(0)::空语句(清屏)			
		say("啊，可恶！既然你如此诽谤我，那么，就让你看看我们段氏龙族的力量吧",53,0,"段誉")
		instruct_0();   --  0(0)::空语句(清屏)			
		say("记忆的封印打开了，力量不断涌现出来",53,0,"段誉")
		instruct_0();   --  0(0)::空语句(清屏)			
		say("我乃是，八，部，龙，王",53,0,"段誉")
		setJX(53,1)
		instruct_0();   --  0(0)::空语句(清屏)
		QZXS("段誉领悟八部战意技【龙王·龙形剑气】！")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("难道只有你才有这种力量吗？也是时候让你看看慕容家的愤怒了",51,0,"慕容复")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("化身为血海地狱的修罗，也要振兴慕容家的霸业",51,0,"慕容复")	
		setJX(51,1)
		instruct_0();   --  0(0)::空语句(清屏)
		QZXS("慕容复领悟八部战意技【修罗·无间斗转】！")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("来吧，你这只长着角的泥鳅",51,0,"慕容复")			
		instruct_0();   --  0(0)::空语句(清屏)	
		if instruct_6(254) ==false then     --慕容单挑段誉
			instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
			instruct_0();   --  0(0)::空语句(清屏)
		end    --:Label1	
		JY.Person[53]["攻击力"] = JY.Person[53]["攻击力"]-150
		JY.Person[53]["防御力"] = JY.Person[53]["防御力"]-150
		JY.Person[53]["轻功"] = JY.Person[53]["轻功"]-150		
		instruct_13();   --  13(D):重新显示场景
		instruct_0();   --  0(0)::空语句(清屏)	
		instruct_2(64,1); 	--得到北冥
		TalkEx("慕容公子，这位段兄只是因为倾慕王姑娘而行为失常，罪不至死啊。",0,1)
		instruct_0();   --  0(0)::空语句(清屏)
		say("（杀了这家伙恐怕会导致大理的报复，对我复国不利。）也罢，给我滚的远远的！再也别让我见到你！",51,0,"慕容复")
		instruct_0();   --  0(0)::空语句(清屏)		
		say("神仙姐姐。。。",53,0,"段誉")
		instruct_0();   --  0(0)::空语句(清屏)	
		instruct_14()
		instruct_3(42,6,1,0,0,0,0,0,0,0,-2,-2,-2)
		instruct_13()		
		instruct_3(42,0,1,0,0,0,0,-2,-2,-2,-2,-2,-2)	
	end
end

OEVENTLUA[708] = function() 
    instruct_1(2880,210,0);   --  1(1):[???]说: 少林木人巷，每个人只有一*次挑战机会，你想挑战吗？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2881,210,0);   --  1(1):[???]说: 好，施主里边请！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_19(35,15);   --  19(13):主角移动至23-F
    instruct_0();   --  0(0)::空语句(清屏)
--[[
    if instruct_6(212,0,23,1) ==true then    --  6(6):战斗[212]否则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景

        if instruct_6(213,0,15,1) ==true then    --  6(6):战斗[213]否则跳转到:Label2
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景]]

            if instruct_6(214,0,7,1) ==true then    --  6(6):战斗[214]否则跳转到:Label3
                instruct_19(34,10);   --  19(13):主角移动至22-A
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
                instruct_0();   --  0(0)::空语句(清屏)
                do return; end
            end    --:Label3
--[[
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label2

        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1]]

    instruct_19(35,17);   --  19(13):主角移动至23-11
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,-2,1,0,709,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
end

OEVENTLUA[303] = function() --倚天邪

    if instruct_4(219,2,0) ==false then    --  4(4):是否使用物品[一颗头颅]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_32(219,-1);   --  32(20):物品[一颗头颅]+[-1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1058,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，这恶贼成昆终于*伏法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1059,0,1);   --  1(1):[AAA]说: 范右使和谢法王呢？我是来*换书的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1060,70,0);   --  1(1):[玄慈]说: 范遥已退隐江湖，不问世事*。谢逊已在少林出家，不见*外人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1061,0,1);   --  1(1):[AAA]说: 那我的书怎么办啊？
    instruct_0();   --  0(0)::空语句(清屏)
	say("他们托我转告少侠，你想要的东西在光明顶。",70,0,"玄慈")
    --instruct_2(155,1);   --  2(2):得到物品[倚天屠龙记][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1063,70,0);   --  1(1):[玄慈]说: 望少侠今后少生杀戮，多行*善事，阿弥陀佛，善哉善哉*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,-2,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	instruct_3(11,93,1,0,10000,0,0,2606,2606,2606,-2,-2,-2) --光明顶
end

OEVENTLUA[10000] = function() --倚天邪拿书
	instruct_3(11,93,1,0,0,0,0,2608,2608,2608,-2,-2,-2)	
	TalkEx("（五彩云烟起）这是......幻象？",0,1)
	if instruct_6(255) ==false then    --光明圣火阵
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
		instruct_0();   --  0(0)::空语句(清屏)
	end    --:Label1	
	instruct_13();   --  13(D):重新显示场景
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(155,1);   --  2(2):得到物品[倚天屠龙记][1]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(43,1);   
	instruct_0();   --  0(0)::空语句(清屏)
    TalkEx("还有留言？",0,1);
    say("恭喜少侠闯过本教圣阵，请问少侠是否愿意重振明教，代行光明？",11,0,"杨逍")
    if DrawStrBoxYesNo(-1, -1, "要作为明教代行使者么？", C_WHITE, 30) == true then 
	JoinMP(0, 13, 5)
	TalkEx("明教的灭亡，我也有责任，引领正道，我也该担当一下",0,1)
	say("多谢少侠，这是本教秘传心法，【焚影圣诀】和【明尊琉璃】,请少侠多加研习",11,0,"杨逍")
	say("为善除恶，唯光明故。喜乐悲愁，皆归尘土。怜我世人，忧患实多！",11,0,"杨逍")
	end 	
end

OEVENTLUA[610] = function() 
    if instruct_4(200,2,0) ==false then    --  4(4):是否使用物品[七宝指环]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(2655,245,1);   --  1(1):[???]说: 丁春秋，你认得这七宝指环*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2656,46,0);   --  1(1):[丁春秋]说: 你是谁，怎麽会有这东西．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2657,245,1);   --  1(1):[???]说: 见到掌门还不跪下．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2658,46,0);   --  1(1):[丁春秋]说: 这逍遥派掌门的信物是那偷*来的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2659,245,1);   --  1(1):[???]说: 是你师父给的，他还要我们*来替他清理门户，除去你这*武林败类．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2660,46,0);   --  1(1):[丁春秋]说: 那老贼被我打落山崖，居然*还没死，竟然还将这七宝指*环给了你．*也好，你亲自来送死，也免*得我去找这七宝指环了．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2661,206,0);   --  1(1):[???]说: 师父功力，震烁古今，你竟*敢和我们作对，这叫萤火虫*与日月争光！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2662,206,0);   --  1(1):[???]说: 螳臂挡车，自不量力，可笑*啊！可笑！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2663,206,0);   --  1(1):[???]说: 我师父谈笑之间，便可将你*们这一干妖魔小丑置之死地*．．．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2664,245,1);   --  1(1):[???]说: 你们烦不烦，要打就快打，*别在那大吹法螺．
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(86,4,0,0) ==false then    --  6(6):战斗[86]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,0,1,0,0,0,0,6600,6600,6600,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,4,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,14,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,10,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,1,0,611,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(53,0,1,0,612,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[擂鼓山]:场景事件编号 [0]
    SetS(60,34,30,3,99); --阿紫出现龙门客栈
	instruct_3(60,99,1,0,10001,0,0,6376,6376,6376,-2,-2,-2); --阿紫加入事件
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2665,0,1);   --  1(1):[AAA]说: 好不容易解决了这老怪．
			if GetS(111, 0, 0, 0) == 0 then
		        say("这是丁春秋的化功大法！？虽说歹毒，不过也要看谁用。",0); 
				if instruct_11(0,188) == true then
				     say("不学白不学！",0) 
					 instruct_0();
	                 QZXS("领悟化功大法！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,87)
				else
				     say("如此歹毒的武功还是不学了！",0) 
					 instruct_0()
				end	
			end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2666,206,0);   --  1(1):[???]说: 少侠英雄无敌，小人忠诚归*附，死心塌地，愿为主人效*犬马之劳．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2667,206,0);   --  1(1):[???]说: 这天下盟主一席，非少侠莫*属．只须主人下令动手，小*人赴汤蹈火，万死不辞．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2668,206,0);   --  1(1):[???]说: 丁春秋这灯烛之火，居然也*敢和日月争光．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2669,206,0);   --  1(1):[???]说: 少侠德配天地，威震当世，*古今无比．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2670,247,1);   --  1(1):[???]说: 这些家伙转的真快，不愧是*星宿派的弟子．不过听了虽*有点肉麻，但也蛮舒服的．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(5);   --  37(25):增加道德5
    instruct_0();   --  0(0)::空语句(清屏)
	if instruct_16(2) then
		say("原来这就是化功大法，果然了得。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)	
		TalkEx("怎么，程姑娘对此这功夫也有兴趣？",0,1)
		instruct_0();   --  0(0)::空语句(清屏)
		say("我确实想看看，嗯？给我看？好吧。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)	
		say("原来如此，这套功夫必须要配合这个神木王鼎才能大成，在练的过程中还不能中止，否则就会反噬。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)	
		TalkEx("啊？这么邪门？那我还是不要了...",0,1)
		instruct_0();   --  0(0)::空语句(清屏)
		say("少侠不要害怕，只要将里面的毒物这样这样......今后的危害就小得多。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)			
		TalkEx("是吗？不过程姑娘，你能确定？",0,1)
		instruct_0();   --  0(0)::空语句(清屏)
		say("嗯，你是怀疑我的专业水平？哼，我就练给你看。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)		
		TalkEx("啊？不要啊。",0,1)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_14();   --  14(E):场景变黑
		instruct_13();   --  13(D):重新显示场景	
		say("看吧，没事吧。",2,0,"程灵素")
		instruct_0();   --  0(0)::空语句(清屏)	
		instruct_35(2,1,87,0)	
		AddPersonAttrib(2, "轻功", 10);
		QZXS("程灵素学会化功大法。轻功增加10。");
		say("哦？这毒素居然和七星海棠合二为一了？妙哉，妙哉",2,0,"程灵素")
		say("看来我离师父的境界越来越近了",2,0,"程灵素")
		setJX(2,1)
		QZXS("程灵素觉醒了七星神木毒髓");
		instruct_0();   --  0(0)::空语句(清屏)	
		instruct_35(2,1,87,0)
		instruct_0();   --  0(0)::空语句(清屏)
	end	
end

OEVENTLUA[10001] = function() --阿紫加入
	say("我听说你大闹星宿海，还把星宿老仙给杀了？",47,0,"阿紫") 
	instruct_0();
	TalkEx("姑娘客气了，为民除害乃是我们侠客的本分。",0,1)
	instruct_0();
	say("谁管你做了什么。你拿到了那本化功大法？我加入你们，你把那本书给我看看好不好？",47,0,"阿紫") 
	instruct_0();	
	if instruct_9() == true then
		if not instruct_20() then		
			say("哈哈，我终于把化功大法弄到手了！",47,0,"阿紫") 
			instruct_0();			
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2);
			instruct_3(104,66,1,0,960,0,0,6374,6374,6374,-2,-2,-2); --钓鱼岛
			if GetS(3, 0, 0, 0) == 1 then
				SetS(3,18,28,3,99); --铁头出现有间客栈
				instruct_3(3,99,1,0,10005,0,0,6380,6380,6380,-2,-2,-2); --铁头加入事件	
			else
				SetS(3, 0, 0, 0, 1)
			end
			instruct_13();   --  13(D):重新显示场景
			instruct_10(47);
		else
			say("笨蛋，你们太多人了！",47,0,"阿紫") 
			instruct_0();
		end
	else
		say("不要就算了！吃饭喝水的时候小心点！",47,0,"阿紫") 
		instruct_0();
	end
end


OEVENTLUA[547] = function() --铁头邪线出现
    if instruct_4(197,2,0) ==false then    --  4(4):是否使用物品[大燕皇帝世袭图表]？是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_32(197,-1);   --  32(20):物品[大燕皇帝世袭图表]+[-1]
    instruct_1(2311,51,0);   --  1(1):[慕容复]说: 哈哈，有了大燕皇帝世系谱*表及传国玉玺，我就可号召*大燕後代，实行复国计划。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2312,0,1);   --  1(1):[AAA]说: 慕容公子此次不会再失信了*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2313,51,0);   --  1(1):[慕容复]说: 我慕容复何时曾失信过人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2314,246,1);   --  1(1):[???]说: ＜贵人多忘事＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2315,51,0);   --  1(1):[慕容复]说: 《天龙八部》一书在乔峰的*手里。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2316,0,1);   --  1(1):[AAA]说: 你该不会是随便说说的吧。*人家称你们为“南慕容，北*乔峰”，你就说书在他那。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2317,76,0);   --  1(1):[???]说: 我表哥没有说谎，此书的确*是流落在他的手中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2318,247,1);   --  1(1):[???]说: 王姑娘说的话就可以信了。*好，我就上丐帮要书去了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2319,51,0);   --  1(1):[慕容复]说: 非也，非也～
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2320,0,1);   --  1(1):[AAA]说: 此话怎讲？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2321,51,0);   --  1(1):[慕容复]说: 你想想看，你打得过那乔峰*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2322,0,1);   --  1(1):[AAA]说: 打不过也得打，*不然怎麽办？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2323,51,0);   --  1(1):[慕容复]说: 我有办法让乔峰乖乖的将书*交出来。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2324,0,1);   --  1(1):[AAA]说: 他为什麽会乖乖交出来？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2325,51,0);   --  1(1):[慕容复]说: 因为我知道他一个极大的秘*密，一个足以让他身败名裂*的秘密。总之，你若和我合*作，我可以让你轻易获得该*书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2326,0,1);   --  1(1):[AAA]说: 你为什麽要帮我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2327,51,0);   --  1(1):[慕容复]说: 没什麽，鱼帮水，水帮鱼。*我慕容氏人丁单薄，势力微*弱，想要重建邦国，谈何容*易？唯一的机会便是天下大*乱，武林动荡不安。而你也*可从中得到你要的东西。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2328,76,0);   --  1(1):[???]说: 表哥，你不要想复国想到疯*了，弄得天下大乱。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2329,51,0);   --  1(1):[慕容复]说: 住嘴！你以为我这慕容复的*"复"字是为何取的，我慕容*家族世世代代奔波一生，所*为何事？怎样，你要不要和*我合作？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(119,0) ==false or cxzj() == 49 then    --  11(B):是否住宿是则跳转到:Label1
        instruct_37(2);   --  37(25):增加道德2
        instruct_3(104,91,1,0,1084,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [91]
        instruct_1(2330,0,1);   --  1(1):[AAA]说: 慕容公子的好意，在下心领*了。但我不愿用卑鄙的方法*去得到那本《天龙八部》。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2331,51,0);   --  1(1):[慕容复]说: 哼，此事我势在必行，即使*没有你的合作，我也要去丐*帮。到时你得不到《天龙八*部》，那可是你咎由自取。*我们走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2332,53,0);   --  1(1):[段誉]说: 王姑娘，等等我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(51,25,0,0,0,0,556,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label1

    instruct_37(-8);   --  37(25):增加道德-8
    instruct_3(104,91,1,0,1085,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [91]
    instruct_1(2333,51,0);   --  1(1):[慕容复]说: 好，少侠果然明事理。这封*书信就是揭发乔峰的证据，*你拿好，咱们丐帮见。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(216,1);   --  2(2):得到物品[带头大哥书信][1]
	instruct_2(118,1);
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2334,53,0);   --  1(1):[段誉]说: 唉，王姑娘走了，……*我也回大理吧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	if GetS(3, 0, 0, 0) == 1 then
		SetS(3,18,28,3,99); --铁头出现有间客栈
		instruct_3(3,99,1,0,10005,0,0,6380,6380,6380,-2,-2,-2); --铁头加入事件	
	else
		SetS(3, 0, 0, 0, 1)
	end	
    instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,3,1,0,548,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,5,1,0,549,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(51,25,0,0,0,0,585,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[丐帮]:场景事件编号 [25]
    instruct_3(77,0,1,0,1061,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[万鳄岛]:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end



OEVENTLUA[10005] = function() --铁头加入
	if instruct_16(47) then
		say("阿紫姑娘！阿紫姑娘！",48,0,"游坦之") 
		instruct_0();
		say("你这个铁头，原来还活着啊。",47,0,"阿紫") 
		instruct_0();		
		say("为什么，为什么要离开我！",48,0,"游坦之") 
		instruct_0();	
		say("你这个人这么无趣，又没有用，这位少侠比你好玩多了。",47,0,"阿紫") 
		instruct_0();	
		say("原来是你这个家伙！",48,0,"游坦之") 
		instruct_0();		
		TalkEx("我，我什么都没做啊。。。",0,1)
		instruct_0();
		  --JY.Person[48]["攻击力"] = 100
		  --JY.Person[48]["防御力"] = 80
		 -- JY.Person[48]["轻功"] = 70		
		if instruct_6(88) ==false then     --单挑铁头
			instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
			instruct_0();   --  0(0)::空语句(清屏)
		end    --:Label1		
		instruct_13();   --  13(D):重新显示场景
		instruct_0();   --  0(0)::空语句(清屏)	
		TalkEx("这位大哥，你先息怒。如果你想跟着阿紫姑娘的话，不如加入我们吧。阿紫姑娘你就可怜一下这位大哥吧。",0,1)
		instruct_0();	
		say("好吧，看在你这么忠诚的份上，就让你跟着我们了。",47,0,"阿紫") 
		instruct_0();	
		say("谢谢，谢谢阿紫姑娘！谢谢这位少侠！我这就去小村帮你们收拾好屋子。",48,0,"游坦之") 
		instruct_0();					
		instruct_14();   --  14(E):场景变黑

		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2);
		instruct_3(104,74,1,0,961,0,0,6378,6378,6378,-2,-2,-2); --钓鱼岛
		instruct_3(70,24,1,0,135,0,0,6380,6380,6380,-2,-2,-2); 			
		instruct_13();   --  13(D):重新显示场景			
	else
		say("你是谁？别烦老子！",48,0,"游坦之") 
		instruct_0();		
	end	
end


OEVENTLUA[10002] = function() --欧阳克加入
	TalkEx("欧阳克！你怎么在这里！",0,1)
	instruct_0();
	say("你认识我吗？我什么都不记得了。。。我到底是谁？为什么我醒来后就到了这里的河边？",61,0,"欧阳克") 
	instruct_0();	
	TalkEx("（这家伙竟然还没死，他不会被我打得失去记忆了吧。。这样的话我是不是应该乘机引他走上正道呢？）",0,1)
	instruct_0();
	if instruct_9() == true then
		if not instruct_20() then		
			TalkEx("你是我以前的小弟，后来你被人追杀，我到处找你，原来你在这里。",0,1)
			instruct_0();
			say("你是我的大哥？大哥。。。！",61,0,"欧阳克") 
			JY.Person[61]["武功等级2"]=400
			instruct_0();			
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,-2,-2);
			instruct_13();   --  13(D):重新显示场景
			instruct_10(61);	
			instruct_2(73,1) --得到蛤蟆功
			instruct_2(241,1) --得到瞬息千里
			--instruct_2(246,1) --得到扇子
			if MPPD(0) == 0 then
				say("看他这个样子，不知道他那些“弟子”们该怎么办？")
				if DrawStrBoxYesNo(-1, -1, "要去白驼山庄解决问题么？", C_WHITE, 30) == true then
					say("打傻了他终究是我的过失，总不能让那些女子失了依靠。")
					JoinMP(0, 8, 1)
				end
			end
		else
			say("你们，你们这么多人想干什么。。",61,0,"欧阳克") 
			instruct_0();
		end
	else
		say("我到底是谁啊。。。",61,0,"欧阳克") 
		instruct_0();
	end
end

OEVENTLUA[10003] = function()	--欧阳克离队事件
    Talk("小弟，你先回小村，有需要时，我再去找你帮忙。",0);
    instruct_21(61);   --  21(15):离队
	SetS(70,19,41,3,99); 
    instruct_3(70,99,1,0,10004,0,0,7972,7972,7972,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [47]
end

OEVENTLUA[10004] = function()	--欧阳克小村
		MyTalk("有需要我帮忙的地方吗？", 61);
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,29) ==true then    --  9(9):是否要求加入?否则跳转到:Label1

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_10(61);   
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label2

				MyTalk("你的队伍已满，我无法加入。", 61);
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
end

OEVENTLUA[883] = function() --笑傲邪线
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_35(19,0,48,999);   --  35(23):设置岳不群武功1:辟邪剑法攻击力999
    instruct_47(19,50);   --  47(2F):岳不群增加攻击力50
   --[[ instruct_35(36,0,48,999);   --  35(23):设置林平之武功0:辟邪剑法攻击力999
    instruct_47(36,100);   --  47(2F):林平之增加攻击力100
    instruct_45(36,200);   --  45(2D):林平之增加轻功200

    instruct_46(36,800);   --  46(2E):林平之增加内力1000
    instruct_48(36,300);   --  48(30):林平之增加生命500]]
	  JY.Person[36]["生命"] = 750
	  JY.Person[36]["生命最大值"] = 750
	  JY.Person[36]["内力"] = 3000
	  JY.Person[36]["内力最大值"] = 3000
	  JY.Person[36]["攻击力"] = 240
	  JY.Person[36]["防御力"] = 150
	  JY.Person[36]["轻功"] = 350
	  JY.Person[36]["等级"] = 20
	  JY.Person[36]["受伤程度"] = 0
	  JY.Person[36]["中毒程度"] = 0
	  JY.Person[36]["武功等级1"] = 999	
	  JY.Person[36]["御剑能力"] = JY.Person[36]["御剑能力"] + 30
    instruct_35(22,0,48,999);   --  35(23):设置左冷禅武功1:辟邪剑法攻击力999
    instruct_47(22,50);   --  47(2F):左冷禅增加攻击力50
    instruct_35(79,0,34,900);   --  35(23):设置岳灵珊武功0:太岳三青峰攻击力900
    instruct_35(79,1,31,900);   --  35(23):设置岳灵珊武功1:泰山十八盘攻击力900
    instruct_35(79,2,32,900);   --  35(23):设置岳灵珊武功2:云雾十三式攻击力900
    instruct_47(79,100);   --  47(2F):岳灵珊增加攻击力100
    instruct_46(79,1000);   --  46(2E):岳灵珊增加内力1000
    instruct_48(79,400);   --  48(30):岳灵珊增加生命400
    instruct_13();   --  13(D):重新显示场景
    instruct_25(18,27,13,20);   --  25(19):场景移动18-27--13-20
    instruct_1(3476,19,0);   --  1(1):[岳不群]说: 你终于醒了，你怎么会昏倒*在林家的向阳老宅？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3478,35,0);   --  1(1):[令狐冲]说: 师父，徒儿得知任我行重出*江湖，就想向师父通禀此事*，当我到了福建的时候看到*有人夺了去林师弟的辟邪剑*谱，我杀了那人，抢了回来*。可我也受了重伤，迷迷糊*糊的昏了过去。师父，我怎*么到了这里？是您救我回来*的么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3479,19,0);   --  1(1):[岳不群]说: 今儿早晨到平之的向阳巷老*宅去，在门外见你晕在地下*。冲儿，辟邪剑谱你放在了*什么地方？这是平之的物事*，该当由他收管。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3480,35,0);   --  1(1):[令狐冲]说: 我受伤晕倒，蒙师父所救。*此后这剑谱，便不在我身上*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3481,36,0);   --  1(1):[林平之]说: 令狐冲！依你说来，倒是师*父私吞了剑谱？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3482,35,0);   --  1(1):[令狐冲]说: 弟子不敢。不过弟子昏迷后*真的不知道剑谱的下落了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3483,36,0);   --  1(1):[林平之]说: 哼！师父，定是令狐冲贪恋*我家祖传的剑谱，私藏在秘*密的地方，却跟咱们做戏。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(13,20,18,27);   --  25(19):场景移动13-20--18-27
    instruct_1(3485,0,1);   --  1(1):[AAA]说: ＜按说令狐冲应该不会偷拿*林家的剑谱，但是人心隔肚*皮，谁又知道呢？我该相信*令狐冲吗？＞
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_11(0,218) ==true then    --  11(B):是否住宿否则跳转到:Label0
        instruct_1(3486,0,1);   --  1(1):[AAA]说: ＜令狐大哥绝不是那种人！*我要帮他！＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_30(18,27,15,27);   --  30(1E):主角走动18-27--15-27
        instruct_30(15,27,15,22);   --  30(1E):主角走动15-27--15-22
        instruct_1(3487,0,1);   --  1(1):[AAA]说: 林兄弟，你的祖传之物得而*复失，这种心情我们可以理*解，但是从我和令狐兄弟的*交往过程中，我可以担保拿*走剑谱的绝对另有其人，咱*们慢慢调查，不能妄下结论*，以免伤了同门之谊。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3488,19,0);   --  1(1):[岳不群]说: 同门之谊？哼。他的剑法已*经远高于我了，早已不将我*当作他的师父了，他不仅不*听师训，结交奸邪，还和魔*教长老杀害我正派弟子，还*会念什么同门之谊？从今日*起，我把你逐出师门，以后*不要再说你是我华山门下了*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3489,0,1);   --  1(1):[AAA]说: ……*岳掌门，令狐兄弟的确做错*了不少事，您可以按门规处*罚，但是逐出门墙的责罚，*是不是有些太重了？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3490,19,0);   --  1(1):[岳不群]说: 魔教任教主的小姐对他照顾*有加，他早已跟他们勾结在*一起，还要我这师父干甚么*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3491,35,0);   --  1(1):[令狐冲]说: 魔教任教主的小姐？师父这*话不知从何说起？虽然听说*那任我行有个女儿，可是弟*子从来没见过。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3492,19,0);   --  1(1):[岳不群]说: 孽徒，到了此刻，你又何必*再说谎？那位任小姐召集平*一指给你医病，还送你上少*林，这你还能抵赖的掉么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3493,35,0);   --  1(1):[令狐冲]说: 她……她……盈盈是任教主*之女？这……这真是从何说*起？弟子当真不知呀。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3494,19,0);   --  1(1):[岳不群]说: 你聪明伶俐，何等机警，怎*会猜想不到她便是任我行之*女？令狐冲，今天念在你重*伤在身，我不为难你，我已*经搜过你的身上了，剑谱现*在不在你的身上，限你3日*之内把剑谱乖乖交出来，否*则自古正邪不两立，下次再*见面的时候不是我杀了你，*就是你杀了我。你好自为之*吧。姗儿，平之，我们走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3495,36,0);   --  1(1):[林平之]说: 哼。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3496,79,0);   --  1(1):[???]说: 令狐冲，你以后就不再是我*的大师兄了。你要是真拿了*小林子的剑谱，最好趁早交*出来！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3497,35,0);   --  1(1):[令狐冲]说: 师父、小师妹……。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
        instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
        instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
        instruct_19(13,21);   --  19(13):主角移动至D-15
        instruct_40(0);   --  40(28):改变主角站立方向0
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3498,0,1);   --  1(1):[AAA]说: 哎，事已至此，令狐大哥不*必难过。不知令狐大哥的伤*势如何了？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3499,35,0);   --  1(1):[令狐冲]说: 自从修习了任教主的吸星大*法，已经好多了。唉……如*今师父也不要我了，我真的*做错了吗？。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3500,0,1);   --  1(1):[AAA]说: 尊师只是一时误会，我们一*起去找剑谱，洗刷你的冤屈*。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3501,35,0);   --  1(1):[令狐冲]说: 也只好如此了。好兄弟，陪*我到附近的酒馆喝两杯怎么*样？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3502,0,1);   --  1(1):[AAA]说: 好啊，咱们这就走。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(1,15,0,0,0,0,884,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[河洛客栈]:场景事件编号 [15]
        instruct_45(35,40);   --  45(2D):令狐冲增加轻功40

        if instruct_20(18,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
            instruct_10(35);   --  10(A):加入人物[令狐冲]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

        instruct_1(12,35,0);   --  1(1):[令狐冲]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(70,15,1,0,121,0,0,5722,5748,5722,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [15]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(3665,0,1);   --  1(1):[AAA]说: ＜算了，还是不要多管闲事*了，况且我也不知道是不是*令狐冲拿的。不知道这辟邪*剑谱到底是什么东西，既然*大家都在抢，一定是个好东*西。我就在旁边看看热闹，*说不定就能捡个便宜。＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3666,35,0);   --  1(1):[令狐冲]说: 师父，我是您从小看着长大*的，难道您还信不过徒儿的*为人吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3667,19,0);   --  1(1):[岳不群]说: 哼！就因为从小看着你长大*，我才会如此痛心。令狐冲*啊令狐冲，你怎么就不明正*邪之分呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3668,35,0);   --  1(1):[令狐冲]说: 师父，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3670,19,0);   --  1(1):[岳不群]说: 不要再叫我师父。你的剑法*早已超过我，我哪里还有资*格做你的师父！魔教任教主*的小姐对你照顾有加，你早*已跟他们勾结在一起，还要*我这师父干甚么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3491,35,0);   --  1(1):[令狐冲]说: 魔教任教主的小姐？师父这*话不知从何说起？虽然听说*那任我行有个女儿，可是弟*子从来没见过。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3492,19,0);   --  1(1):[岳不群]说: 孽徒，到了此刻，你又何必*再说谎？那位任小姐召集平*一指给你医病，还送你上少*林，这你还能抵赖的掉么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3493,35,0);   --  1(1):[令狐冲]说: 她……她……盈盈是任教主*之女？这……这真是从何说*起？弟子当真不知呀。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3494,19,0);   --  1(1):[岳不群]说: 你聪明伶俐，何等机警，怎*会猜想不到她便是任我行之*女？令狐冲，今天念在你重*伤在身，我不为难你，我已*经搜过你的身上了，剑谱现*在不在你的身上，限你3日*之内把剑谱乖乖交出来，否*则自古正邪不两立，下次再*见面的时候不是我杀了你，*就是你杀了我。你好自为之*吧。姗儿，平之，我们走。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3495,36,0);   --  1(1):[林平之]说: 哼。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3496,79,0);   --  1(1):[???]说: 令狐冲，你以后就不再是我*的大师兄了。你要是真拿了*小林子的剑谱，最好趁早交*出来！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3497,35,0);   --  1(1):[令狐冲]说: 师父、小师妹……。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(18,27,15,27);   --  30(1E):主角走动18-27--15-27
    instruct_30(15,27,15,22);   --  30(1E):主角走动15-27--15-22
    instruct_1(3671,0,1);   --  1(1):[AAA]说: 令狐大哥，你的内伤好些了*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3672,35,0);   --  1(1):[令狐冲]说: 小兄弟，是你啊。自从修习*了任教主的吸星大法，已经*好多了。唉……如今师父也*不要我了，我真的做错了吗*？。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3673,0,1);   --  1(1):[AAA]说: 令狐大哥，我不知道你是不*是真的拿了那什么辟邪剑谱*。如果你真的拿了，又不想*让别人知道，小弟一定替你*保密，你放心好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3674,35,0);   --  1(1):[令狐冲]说: 你……连你也不信我？师父*、师妹、师弟都不相信我，*小兄弟你也不相信我，难道*这世上便没有人相信我令狐*冲了吗？………………不，*不，还有盈盈，我要去找她*，我要去找盈盈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(93,2,0,0,0,0,912,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[少室山下]:场景事件编号 [2]
    instruct_3(81,0,0,0,0,0,919,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[思过崖]:场景事件编号 [0]
	--设置曲非烟龙门客栈事件
	SetS(60,51,29,3,36); --
	SetS(60,51,28,3,37); --
	SetS(60,51,27,3,38); --
	
	instruct_3(60,36,0,0,0,0,10008,0,0,0,-2,-2,-2); 
	instruct_3(60,37,0,0,0,0,10008,0,0,0,-2,-2,-2); 
	instruct_3(60,38,0,0,0,0,10008,0,0,0,-2,-2,-2); 
	
	--设置曲非烟龙门客栈贴图
	SetS(60,56,33,3,39); --
	SetS(60,54,33,3,40); --
	SetS(60,54,31,3,41); --	
	SetS(60,56,31,3,42); --	
	
	instruct_3(60,39,1,0,0,0,0,5238,5238,5238,-2,-2,-2); 
	instruct_3(60,40,1,0,0,0,0,7002,7002,7002,-2,-2,-2); 
	instruct_3(60,41,1,0,0,0,0,9288,9288,9288,-2,-2,-2); 
	instruct_3(60,42,1,0,0,0,0,9288,9288,9288,-2,-2,-2); 
	
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end



OEVENTLUA[10006] = function()	--曲非烟离队事件
	Talk("曲姑娘，你先回小村，有需要时，我再去找你帮忙。",0);
    instruct_21(581);   --  21(15):离队
	instruct_3(70,35,1,0,10007,0,0,7002,7002,7002,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [35]
end

OEVENTLUA[10007] = function()	--曲非烟小村
		MyTalk("有需要我帮忙的地方吗？", 581);
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,29) ==true then    --  9(9):是否要求加入?否则跳转到:Label1

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_10(581);   
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label2

				MyTalk("你的队伍已满，我无法加入。", 581);
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
end

OEVENTLUA[10008] = function()	--曲非烟加入事件
	TalkEx("咦，前面有打斗声。",0,1)
	instruct_0();
	say("爷爷，爷爷你怎么了！",581) 
	instruct_0();
	say("嘿嘿，魔教曲洋已经伏诛，小丫头，这次轮到你了！",198,0,"嵩山弟子") 
	instruct_0();
	TalkEx("住手！",0,1)
	instruct_0();
	say("怎么，你这小子也是魔教妖孽？",198,0,"嵩山弟子") 
	instruct_0();
	TalkEx("你管我是谁，竟然对一个小姑娘下手，嵩山派果然都是无耻之徒！",0,1)
	instruct_0();
	say("臭小子！找死！",198,0,"嵩山弟子") 
	instruct_0();
	say("....",20,0,"？？？") 
	instruct_0();
	TalkEx("你是....？",0,1)
	instruct_0();
	say("....",20,0,"？？？") 
	instruct_0();
	
	if instruct_6(256) ==false then     --救非烟
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
		instruct_0();   --  0(0)::空语句(清屏)
	end    --:Label1
	addHZ(39)
	instruct_3(60,41,1,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(60,42,1,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_13();   --  13(D):重新显示场景
	instruct_0();   --  0(0)::空语句(清屏)		
	
	TalkEx("好快的剑....",0,1)	
	instruct_0();
	say("....",20,0,"？？？") 
	instruct_0();
	TalkEx("那位前辈怎么走得这么快。",0,1)	
	instruct_0();
	say("爷爷....呜呜呜....",581) 	
	instruct_0();
	TalkEx("小妹妹，人死不能复生....我们先把你爷爷葬了吧....",0,1)	
	instruct_0();
	say("呜呜呜....",581) 
	instruct_0();
	
	instruct_14();   --  14(E):场景变黑
	instruct_3(60,39,1,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_13();   --  13(D):重新显示场景
	
	instruct_0();
	TalkEx("小妹妹，你叫什么名字？",0,1)	
	instruct_0();
	say("曲非烟....",581) 	
	instruct_0();
	TalkEx("你....如果没有地方去的话，跟我们一起走吧？我叫人把你先送回小村，那里有很多很多朋友，我们都会照顾你的。",0,1)	
	instruct_0();
	say("大哥哥，谢谢....",581) 

	instruct_14();   --  14(E):场景变黑
	instruct_3(60,39,1,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(60,36,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(60,37,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(60,38,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(60,40,1,0,0,0,0,0,0,0,-2,-2,-2); 	
	instruct_13();   --  13(D):重新显示场景	
	instruct_3(70,35,1,0,10007,0,0,7002,7002,7002,-2,-2,-2);   --曲非烟加入
end


OEVENTLUA[10007] = function()	--曲非烟小村
		MyTalk("有需要我帮忙的地方吗？", 581);
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,29) ==true then    --  9(9):是否要求加入?否则跳转到:Label1

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_10(581);   
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label2

				MyTalk("你的队伍已满，我无法加入。", 581);
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
end

OEVENTLUA[301] = function() --天龙正+倚天邪，加入鸠摩智场景和少林入门
    if instruct_60(-2,38,2286,0,46) ==true then    --  60(3C):判断场景-2事件位置38是否有贴图2286否则跳转到:Label0

        if instruct_16(49,0,42) ==true then    --  16(10):队伍是否有[虚竹]否则跳转到:Label1
            instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
            instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
            instruct_14();   --  14(E):场景变黑
            instruct_13();   --  13(D):重新显示场景
            instruct_1(2599,49,0);   --  1(1):[虚竹]说: 谢谢施主送我回少林，我这*就去了。佛祖曾经对我说，*如果有人送我回少林，那这*个人就是个好人，因为他放*弃了小无相功、天山六阳掌*、天山折梅手、八荒六合功*等武功，因此佛祖要给这个*人加上十点道德。施主，你*真是个好人，再会。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_21(49);   --  21(15):[虚竹]离队
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_37(10);   --  37(25):增加道德10
			dark()
			addevent(-2, 85, 0, 0, 0, 5374)
			light()			
			say("阿弥陀佛。施主把虚竹师侄送回寺内，这一路辛苦了。种因就得果，施主舍弃了一些东西，老衲就回赠给施主其他的东西吧。",169,0,"空见")	
			addthing(288)
			addthing(280)
			say("谢谢大师！")
	       if GetS(111, 0, 0, 0) == 0 then
	          say("阿弥陀佛，这是贫僧的一点心得，施主也且收下。",169,0,"空见") 
	          instruct_0();
			      if instruct_11(0,188) == true then
	                 QZXS("领悟金刚不坏神功奥妙！")
	                 instruct_0();
	                 say("多谢大师",0) 
	                 SetS(111, 0, 0, 0,151)
				  else
				     say("在下岂能如此贪心，大师的好意在下心领了。",0) 
				  end
           end
			dark()
			null(-2, 85)
			light()
			if GetS(106, 5, 1, 1) ~= -1 then
				SetS(106, 5, 1, 1, 2)
				SetS(28, 16, 12, 3, 99)
				instruct_3(28,99,1,0,31030,0,0,5374,5374,5374,-2,-2,-2); 		
			else
				SetS(106, 5, 1, 1, 1)
			end			
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label1

    end    --:Label0


    if instruct_60(-2,36,2286,0,935) ==true then    --  60(3C):判断场景-2事件位置36是否有贴图2286否则跳转到:Label2
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,36,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,50,19);   --  30(1E):主角走动53-19--50-19
        instruct_30(50,19,50,40);   --  30(1E):主角走动50-19--50-40
        instruct_30(50,40,46,40);   --  30(1E):主角走动50-40--46-40
        instruct_1(1024,0,1);   --  1(1):[AAA]说: 咦？今天少林寺怎么这么大*阵势？难道是专门迎接我的*吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1025,70,0);   --  1(1):[玄慈]说: 施主远道而来，不知有何见*教？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1026,0,1);   --  1(1):[AAA]说: 我……随便看看……*＜嘿嘿*，老和尚想不到吧，我是来*替明教报仇的，想把少林寺*夷为平地……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1027,70,0);   --  1(1):[玄慈]说: 据老衲所知，施主此来是要*为明教报仇，想把少林寺夷*为平地。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1028,0,1);   --  1(1):[AAA]说: 你——！*＜谢法王和范右使怎么还没*到，要坏……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1029,70,0);   --  1(1):[玄慈]说: 明教已然覆灭，阁下何必再*添杀戮。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1030,0,1);   --  1(1):[AAA]说: 谁说明教覆灭了，金毛狮王*谢逊和光明右使范遥还都在*呢。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1031,70,0);   --  1(1):[玄慈]说: 他二人已然皈依我佛。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1032,245,1);   --  1(1):[???]说: 什么？不可能！老和尚，我*要见他二人！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(80,1,0,1) ==false then    --  6(6):战斗[80]是则跳转到:Label3
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label3

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1033,70,0);   --  1(1):[玄慈]说: 少林寺乃佛门圣地，施主不*要再打了，阿弥陀佛，我这*就带施主去见他二人
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,41,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,40,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,45,0,0,0,0,0,8232,8232,8232,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,6388,6388,6388,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,46,0,0,0,0,0,5334,5334,5334,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,43,0,0,0,0,0,5294,5294,5294,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_19(33,50);   --  19(13):主角移动至21-32
        instruct_25(33,50,33,50);   --  25(19):场景移动33-50--33-50
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(1034,13,0);   --  1(1):[谢逊]说: 无我相、无人相、无众生相*、无寿者相……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1035,0,1);   --  1(1):[AAA]说: 谢法王，真的是你？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1036,13,0);   --  1(1):[谢逊]说: 弟子罪孽深重，盼方丈收留*，赐予剃度。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1037,0,1);   --  1(1):[AAA]说: 啊？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1038,114,0);   --  1(1):[???]说: 老僧收你为徒。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1039,13,0);   --  1(1):[谢逊]说: 弟子不敢望此福缘。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1040,114,0);   --  1(1):[???]说: 空固是空，圆亦是空，我相*人相，好不懵懂！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1041,13,0);   --  1(1):[谢逊]说: 师父是空，弟子是空，无罪*无业，无德无功！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1042,114,0);   --  1(1):[???]说: 善哉，善哉！你归我门下，*仍是叫作谢逊，你懂了么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1043,13,0);   --  1(1):[谢逊]说: 弟子懂得。牛屎谢逊，皆是*虚影，身既无物，何况于名*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1044,0,1);   --  1(1):[AAA]说: ＜糟糕糟糕，看来成昆老贼*的计划要泡汤，我得赶紧另*想出路……＞**谢法王，这，那，我要的*《倚天屠龙记》一书怎么办*啊？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1045,10,0);   --  1(1):[范遥]说: 小兄弟，我们俩受少林高僧*点化，已知我明教真正的仇*人其实是成昆，只要你帮我*们除掉成昆，这本倚天屠龙*记就送给你。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1046,13,0);   --  1(1):[谢逊]说: 师父恕罪，弟子也有此念。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1047,70,0);   --  1(1):[玄慈]说: 杀恶人即使善念，那成昆为*祸武林……阿弥陀佛……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1048,0,1);   --  1(1):[AAA]说: 好，一言为定，我这就去找*成昆。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,169,0);   --  1(1):[???]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1049,170,0);   --  1(1):[???]说: 阿弥陀佛，善哉善哉。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
        instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
        instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
        instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
        instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
        instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
        instruct_3(-2,12,-2,0,-2,303,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
        instruct_3(9,0,0,0,0,0,302,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [0]
        instruct_3(9,1,0,0,0,0,0,5296,5296,5296,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [1]
        instruct_3(9,2,0,0,0,0,0,6092,6092,6092,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [2]
        instruct_3(9,3,0,0,0,0,0,6788,6788,6788,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [3]
        instruct_3(9,4,0,0,0,0,0,5892,5892,5892,-2,-2,-2);   --  3(3):修改事件定义:场景[成崑居]:场景事件编号 [4]
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2


    if instruct_60(-2,37,2286,0,1815) ==true then    --  60(3C):判断场景-2事件位置37是否有贴图2286否则跳转到:Label4
        instruct_37(3);   --  37(25):增加道德3
        instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,37,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,48,0,0,0,0,0,6380,6380,6380,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,58,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,59,0,0,0,0,0,6304,6304,6304,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,61,1,0,572,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
        instruct_3(-2,60,1,0,572,0,0,7136,7136,7136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
        instruct_3(-2,62,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,63,0,0,0,0,0,5330,5330,5330,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,64,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,65,0,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,66,0,0,0,0,0,7126,7126,7126,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,70,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,52,19);   --  30(1E):主角走动53-19--52-19
        instruct_30(52,19,52,37);   --  30(1E):主角走动52-19--52-37
        instruct_40(2);   --  40(28):改变主角站立方向2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_25(52,37,43,37);   --  25(19):场景移动52-37--43-37
        instruct_25(43,37,43,44);   --  25(19):场景移动43-37--43-44
        instruct_25(43,44,52,44);   --  25(19):场景移动43-44--52-44
        instruct_25(52,44,52,37);   --  25(19):场景移动52-44--52-37
        instruct_25(52,37,48,36);   --  25(19):场景移动52-37--48-36
        instruct_1(2419,48,0);   --  1(1):[游坦之]说: 少林寺玄慈方丈，少林派是*武林中各门派之首，丐帮是*江湖第一大帮，向来并峙中*原，不相统属。今日咱们却*要分个高下，胜者为武林盟*主，败者服从武林盟主号令*，不得有违。天下各位英雄*好汉，今日都聚集在此，有*哪一位不服，尽可向武林盟*主挑战。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2420,70,0);   --  1(1):[玄慈]说: 阿弥陀佛。丐帮数百年来，*乃中原武林的侠义正道，天*下英雄，无不瞻仰。庄帮主*新任帮主，敝派得讯迟了，*未及遣使道贺，不免有简慢*之罪，谨此谢过。却不知庄*帮主今日何以忽兴问罪之师*，还盼见告。天下英雄，俱*在此间，是非曲直，自由公*论。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2421,48,0);   --  1(1):[游坦之]说: 我大宋南有辽国，西有西夏*、吐蕃，北有大理，四夷虎*视眈眈，这个……这个……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2422,245,1);   --  1(1):[???]说: 什么"南有辽国，北有大理"*，好大一个丐帮，竟由你这*种不学无术之人出任帮主，*岂不让天下英雄笑话！你要*争武林盟主是吗？不用玄慈*方丈动手，我先来领教领教*丐帮得降龙十八掌和打狗棒*法！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2423,48,0);   --  1(1):[游坦之]说: 降龙十八掌？……这个……*这个……
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(197,4,0,0) ==false then    --  6(6):战斗[197]是则跳转到:Label5
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label5

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2424,245,1);   --  1(1):[???]说: 你这是什么毒功！！身为丐*帮帮主，为什么不用降龙十*八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2425,48,0);   --  1(1):[游坦之]说: 这个……这是……因为……*这个武功比降龙十八掌厉害*……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2426,50,0);   --  1(1):[乔峰]说: 谁说这邪门毒功胜过了降龙*十八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,69,0,0,0,0,0,8240,8240,8240,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,68,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(52,37,52,43);   --  30(1E):主角走动52-37--52-43
        instruct_30(52,43,45,43);   --  30(1E):主角走动52-43--45-43
        instruct_40(3);   --  40(28):改变主角站立方向3
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2427,247,1);   --  1(1):[???]说: 乔大哥、阿朱姑娘！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2428,50,0);   --  1(1):[乔峰]说: 小兄弟好。今后不要再叫我*乔大哥了。我是契丹人，萧*峰！
        instruct_0();   --  0(0)::空语句(清屏)
		JY.Person[50]["姓名"] = "萧峰"
        instruct_1(2429,247,1);   --  1(1):[???]说: 乔也罢，萧也罢，汉人也好*，契丹也好，你始终是我的*好大哥！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2430,50,0);   --  1(1):[乔峰]说: 哈哈哈，好兄弟！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2431,0,2);   --  1(1):[AAA]说: 众人：*姓乔的，你杀了我的兄长，*血仇未曾得报，今日和你拼*了！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2432,0,2);   --  1(1):[AAA]说: 众人：*这乔峰乃契丹胡虏，人人得*而诛之，今日可再也不能容*他或者走下少室山！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2433,51,0);   --  1(1):[慕容复]说: ＜这乔峰如今已被逐出丐帮*，成为中原武林的公敌，我*正好趁此机会，收揽人心，*以为己助。＞  萧兄，你是*契丹英雄，视我中原豪杰有*如无物，区区姑苏慕容复今*日想领教阁下高招。在下死*在萧兄掌下，也算是为中原*豪杰尽了一分微力，虽死犹*荣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2434,245,1);   --  1(1):[???]说: 住口！你与萧大哥素无恩怨*，为何一再苦苦相逼！你处*心积虑，收买人心，就为了*你那虚无缥缈的皇帝梦！要*碰我大哥，先过我这一关！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(198,4,0,0) ==false then    --  6(6):战斗[198]是则跳转到:Label6
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label6

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2435,48,0);   --  1(1):[游坦之]说: 杀父之仇，不共戴天，姓萧*的，今日便来做个了断！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2436,50,0);   --  1(1):[乔峰]说: 尽管来吧，萧某何惧！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(199,4,0,0) ==false then    --  6(6):战斗[199]是则跳转到:Label7
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label7

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2437,103,0);   --  1(1):[???]说: 久闻降龙十八掌天下无双，*贫僧也要领教一二。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(200,4,0,0) ==false then    --  6(6):战斗[200]是则跳转到:Label8
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label8

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2438,98,0);   --  1(1):[???]说: ＜这萧峰武功卓绝，而且似*乎与段正淳他们交情不错，*不如今日借着人多势众，将*之除去……＞**我们也上！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2439,207,0);   --  1(1):[???]说: 这萧峰乃是契丹胡虏，武林*公敌，更是我们丐帮的叛徒*，丐帮兄弟们，一起上啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2440,245,1);   --  1(1):[???]说: 想仗着人多欺负人吗？来吧*！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(81,4,0,0) ==false then    --  6(6):战斗[81]是则跳转到:Label9
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label9

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2441,76,0);   --  1(1):[???]说: 啊……表哥小心！……公子*手下留情啊！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2442,245,1);   --  1(1):[???]说: 哼，看在王姑娘的面子上，*今日姑且留你一命！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2443,51,0);   --  1(1):[慕容复]说: ＜我……我今日数次惨败，*居然还要女人求情来保住性*命，我还有何颜面活在这世*上，不如干脆……＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2444,113,0);   --  1(1):[???]说: 住手！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,67,0,0,0,0,0,7132,7132,7132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2445,113,0);   --  1(1):[???]说: 你有儿子没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2446,51,0);   --  1(1):[慕容复]说: 我尚未婚配，何来子嗣？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2447,113,0);   --  1(1):[???]说: 你有祖宗没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2448,51,0);   --  1(1):[慕容复]说: 自然有！我自愿就死，与你*何干？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2449,113,0);   --  1(1):[???]说: 你高祖有儿子，你曾祖、祖*父、父亲都有儿子，便是你*没儿子！嘿嘿，大燕国当年*慕容恪、慕容垂何等英雄，*却不料都变成了断种绝代的*无后之人！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2450,51,0);   --  1(1):[慕容复]说: 这……慕容复见识短绌，得*蒙高人指点迷津，大恩大德*，没齿难忘。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2451,113,0);   --  1(1):[???]说: 萧大侠武功卓绝，果然名不*虚传，老夫想领教几招！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2452,50,0);   --  1(1):[乔峰]说: 不敢！请！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2453,112,0);   --  1(1):[???]说: 哈哈哈……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,71,0,0,0,0,0,7134,7134,7134,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2454,113,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2454,112,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2455,113,0);   --  1(1):[???]说: 你在少林寺中一躲数十年，*所为何事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2456,112,0);   --  1(1):[???]说: 我也正要问你，你在少林寺*中一躲数十年，又所为何事*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2457,113,0);   --  1(1):[???]说: 我藏身少林，是为了寻找一*些东西。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2458,112,0);   --  1(1):[???]说: 我也是为了寻找一些东西，*我想找得东西已经找到，我*想你要找的东西也已经找到*了，否则我们三次较量，该*当分出了高下。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2459,113,0);   --  1(1):[???]说: 不错，尊驾武功了得，你我*互相钦服，不用再较量了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2460,112,0);   --  1(1):[???]说: 甚好！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2461,50,0);   --  1(1):[乔峰]说: ＜这个声音……不正是那日*救我出聚贤庄的黑衣人吗？*……＞ **恩公，请受萧峰一拜！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2462,112,0);   --  1(1):[???]说: 恩公？哈哈哈，你再仔细看*看我！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2463,50,0);   --  1(1):[乔峰]说: 你……你是我爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2464,112,0);   --  1(1):[???]说: 好孩儿，好孩儿，我正是你*爹爹。咱爷俩一般的身形相*貌。不用记认，谁都知道我*是你的老子。那日雁门关外*，中原豪杰不问情由，便杀*了你不会武功的妈妈。孩儿*，你说此仇该不该报？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2465,50,0);   --  1(1):[乔峰]说: 杀母之仇，不共戴天，焉可*不报？智光大师、谭公、谭*婆、赵钱孙等人皆已死于非*命，可是孩儿至今不知那位*带头大哥是谁。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2466,112,0);   --  1(1):[???]说: 那些人都是我杀的！*那个带头大哥就在少室山！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2467,50,0);   --  1(1):[乔峰]说: 是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2468,70,0);   --  1(1):[玄慈]说: 萧老施主，雁门关外一役，*老衲铸成大错。众家兄弟为*老衲包涵此事，又一一送命*。老衲今日再死，实在已经*晚了。**慕容博慕容老施主，*当日你假传音讯，说道契丹*武士要大举来少林寺夺取武*学典籍，以致酿成种种大错*，你可也曾有丝毫内疚于心*吗？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2469,113,0);   --  1(1):[???]说: 方丈大师，你眼光好生厉害*，居然将我认了出来
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2470,51,0);   --  1(1):[慕容复]说: 爹爹，你……你没有……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2471,70,0);   --  1(1):[玄慈]说: 慕容老施主，老衲今日听你*对令郎的劝导言语，才知你*姑苏慕容氏竟是帝王之裔，*所谋者大。那么你假传音讯*的用意，也就明白不过了。*只是你所图谋的大事，却也*终究难成，那不是枉自害死*了这许多无辜的性命么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2472,113,0);   --  1(1):[???]说: 谋事在人，成事在天！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2473,112,0);   --  1(1):[???]说: 慕容老贼，原来你才是罪魁*祸首，上来领死吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2474,113,0);   --  1(1):[???]说: 哈哈哈，恕不奉陪！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2475,112,0);   --  1(1):[???]说: 想跑？追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2476,50,0);   --  1(1):[乔峰]说: 追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,59,0,0,0,0,0,-2,-2,-2,0,17,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,71,0,0,0,0,0,-2,-2,-2,-2,16,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,16,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,67,0,0,0,0,0,-2,-2,-2,-2,17,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2478,0,1);   --  1(1):[AAA]说: 恩……他们竟然跑向了少林*的藏经阁，我得过去看看
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_19(26,52);   --  19(13):主角移动至1A-34
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_25(26,52,15,54);   --  25(19):场景移动26-52--15-54
        instruct_1(2479,0,1);   --  1(1):[AAA]说: ＜这老和尚是何方神圣？竟*然能降服萧远山和慕容博两*位老英雄？＞
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2480,114,0);   --  1(1):[???]说: 你二人由生到死、由死到生*地走了一遍，心中还有什么*放不下？倘若适才就此死了*，还有什么兴复大燕、报复*妻仇的念头？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2481,112,0);   --  1(1):[???]说: 弟子生平杀人，无虑百数，*倘若被我所杀之人的眷属皆*来向我复仇索命，弟子虽死*百次，亦自不足。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2482,114,0);   --  1(1):[???]说: 你呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2483,113,0);   --  1(1):[???]说: 庶民如尘土，帝王亦如尘土*。大燕不复国是空，复国亦*是空。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2484,114,0);   --  1(1):[???]说: 大彻大悟，善哉善哉，你二*人这就随我去吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,50,0);   --  1(1):[乔峰]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,68,0,0,0,0,0,-2,-2,-2,-2,25,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,26,53);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,71,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_19(26,52);   --  19(13):主角移动至1A-34
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2485,50,0);   --  1(1):[乔峰]说: 好兄弟，你是个顶天立地的*好男儿，我知道你在寻找《*天龙八部》一书，此书我今*日就赠送与你。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(147,1);   --  2(2):得到物品[天龙八部][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2486,0,0);   --  1(1):[AAA]说: 多谢大哥。不知大哥今后有*何打算？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2508,50,0);   --  1(1):[乔峰]说: 我会与阿朱去塞外。塞外牛*羊，绝不是空许约！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2488,104,0);   --  1(1):[???]说: 大哥，你待我真好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2489,50,0);   --  1(1):[乔峰]说: 这降龙十八掌乃天下至刚的*掌法，我不想此掌法从此失*传，今日也一并传给你吧。*希望你将此掌法用于正途，*发扬光大。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(86,1);   --  2(2):得到物品[降龙十八掌][1]
        instruct_0();   --  0(0)::空语句(清屏)
		addHZ(68)
        instruct_1(2490,0,1);   --  1(1):[AAA]说: 多谢大哥。大哥教诲，小弟*紧记在心。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2491,50,0);   --  1(1):[乔峰]说: 阿朱，我们走吧。兄弟，日*后有缘，也许还有相见之日*。告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(77,0,1,0,1061,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[万鳄岛]:场景事件编号 [0]

		SetS(63,26,8,3,21); --鸠摩智位置
		SetS(63,28,9,3,22); --鸠摩智事件触发
		SetS(63,28,8,3,23); --鸠摩智事件触发
		SetS(63,28,7,3,24); --鸠摩智事件触发
	
		instruct_3(63,22,0,0,0,0,10009,0,0,0,-2,-2,-2); --鸠摩智事件触发
		instruct_3(63,23,0,0,0,0,10009,0,0,0,-2,-2,-2); --鸠摩智事件触发
		instruct_3(63,24,0,0,0,0,10009,0,0,0,-2,-2,-2); --鸠摩智事件触发
		
		instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label4

    instruct_0();   --  0(0)::空语句(清屏)
end



OEVENTLUA[10009] = function()	--鸠摩智加入事件
	instruct_14();   --  14(E):场景变黑
	instruct_3(63,21,0,0,0,0,0,8824,8824,8824,-2,-2,-2); --鸠摩智贴图
	instruct_3(63,22,0,0,0,0,0,0,0,0,-2,-2,-2); --事件取消
	instruct_3(63,23,0,0,0,0,0,0,0,0,-2,-2,-2); --事件取消
	instruct_3(63,24,0,0,0,0,0,0,0,0,-2,-2,-2); --事件取消
	instruct_13();   --  13(D):重新显示场景	
	
	say("咦，前面那个人是......") 
	instruct_0();
	say("那老贼秃说我以小无相功为底子，强练少林七十二绝技，戾气所中，种下了祸胎，本末倒置，大难便在旦夕之间。莫非，莫非这老贼秃的鬼话，当真应验了？",103,0,"鸠摩智") 
	instruct_0();
	say("现在我丹田热焰上腾，有如火焚，四肢百骸不由自主地颤抖不已，这可如何是好？",103,0,"鸠摩智") 
	instruct_0();
	say("＜鸠摩智惊惶之极，伸右手在左肩、左腿、右腿三处各戳一指，刺出三洞，要导引内息从三个洞孔中泄出，三个洞孔中血流如注，内息却没法宣泄。＞",103,0,"鸠摩智") 
	instruct_0();
	say("啊啊啊啊！！！！！！！",103,0,"鸠摩智") 
	instruct_0();
	say("大师！大师你怎么了！？") 	
	instruct_0();	
	say("啊啊啊啊啊啊啊啊啊！！！！！！！！！！！！",103,0,"鸠摩智") 
	instruct_0();
	say("糟糕，他走火入魔了，必须让他镇静下来！") 
	instruct_0();
	SetS(86,20,20,5,9) --设置战斗
	JY.Person[103]["内力最大值"] = JY.Person[103]["内力最大值"] + 1000
	JY.Person[103]["内力"] = JY.Person[103]["内力最大值"]
	
	if instruct_6(88) ==false then     --单挑鸠摩智
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
		instruct_0(); 
	end   	
	SetS(86,20,20,5,0)
	say("还是不行，他武功太高，此时状如疯魔更加难以压制。可是现在如果一走了之他肯定凶多吉少。怎么办？") 
	instruct_0();
	if DrawStrBoxYesNo(-1, -1, "要继续帮助鸠摩智吗?", C_WHITE, 30) == true then
		AddPersonAttrib(0, "品德", 2)
		say("不行，不能前功尽弃，再来一次！") 
		instruct_0(); 
		JY.Person[103]["攻击力"] = JY.Person[103]["攻击力"] + 100
		JY.Person[103]["轻功"] = JY.Person[103]["轻功"] + 100
		JY.Person[103]["防御力"] = JY.Person[103]["防御力"] + 100
		SetS(86,20,20,5,9) --设置战斗
		if instruct_6(88) ==false then     --单挑鸠摩智
			instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
			instruct_0(); 
		end  		
		JY.Person[103]["攻击力"] = JY.Person[103]["攻击力"] - 100
		JY.Person[103]["轻功"] = JY.Person[103]["轻功"] - 100
		JY.Person[103]["防御力"] = JY.Person[103]["防御力"] - 100
		JY.Person[103]["内力最大值"] = JY.Person[103]["内力最大值"] - 1000
		JY.Person[103]["内力"] = JY.Person[103]["内力最大值"]
		SetS(86,20,20,5,0)
		say("成功了！他冷静下来了！") 
		instruct_0(); 
		instruct_14();   --  14(E):场景变黑
		instruct_3(63,21,0,0,0,0,0,8818,8818,8818,-2,-2,-2); 
		instruct_13();   --  13(D):重新显示场景			
		instruct_0(); 
		say("大师，你觉得怎么样？") 
		instruct_0(); 
		say("唉，老衲错学少林七十二绝技，走火入魔，凶险万状。幸得少侠出手相助，如今我武功虽失，性命犹在，须得拜谢你的救命之恩才是。",103,0,"鸠摩智") 
		instruct_0();
		say("大师客气了，救人一命胜造七级浮屠，这乃是我辈的分内之事。只是不知大师以后有何打算？") 	
		instruct_0(); 
		say("老衲此番再世为人，思往日种种罪过，心自难安。只盼以后能与人向善，随遇而安。心安乐处，便是身安乐处。",103,0,"鸠摩智") 
		instruct_0();
		if JY.Person[zj()]["品德"] >= 85 and JY.Person[zj()]["内力最大值"] >= 5000 then
			instruct_0();
			say("大师一身武功如此失去，岂不是暴殄天物？不如让在下助大师你打通经脉，或许可以使武功恢复个几成。以后大师若是能把一身功夫用在正道上，也是无量功德。") 
			instruct_0(); 
			say("那就麻烦少侠辛苦了。",103,0,"鸠摩智") 
			instruct_14();   --  14(E):场景变黑
			instruct_13();   --  13(D):重新显示场景				
			JY.Person[zj()]["内力最大值"] = math.modf(JY.Person[zj()]["内力最大值"] * 0.5)
			JY.Person[zj()]["内力"] = 0
			instruct_0();
			say("大师淤塞的经脉已经被我打通，不如来小村住上一段时期安心休养？") 			
			instruct_0(); 
			say("如此也好，那老衲就叨扰了。",103,0,"鸠摩智")
			instruct_14();   --  14(E):场景变黑
			instruct_3(70,71,1,0,1094,0,0,8818,8818,8818,-2,-2,-2); --鸠摩智小村贴图
			instruct_3(63,21,0,0,0,0,0,0,0,0,-2,-2,-2); 
			instruct_13();   --  13(D):重新显示场景			
			return
		else
			instruct_0(); 
			say("这些身外物，老衲已无用处，就送给少侠吧。",103,0,"鸠摩智") 	
			instruct_0();
			say("多谢大师，祝大师此行一路顺风。")
			instruct_14();   --  14(E):场景变黑
			instruct_3(63,21,0,0,0,0,0,0,0,0,-2,-2,-2); 
			instruct_13();   --  13(D):重新显示场景		
			instruct_0();			
			instruct_32(8, 3)
			QZXS("得到三颗天王保命丹")
			addHZ(11)
			return
		end
	end	
	AddPersonAttrib(0, "品德", -1)
	JY.Person[103]["内力最大值"] = JY.Person[103]["内力最大值"] - 1000
	JY.Person[103]["内力"] = JY.Person[103]["内力最大值"]
	instruct_0(); 
	say("大师，不是我不想救你，只是你武功太高在下实在爱莫能助啊。") 
	instruct_0();
	say("啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！！！！！！！！！！！",103,0,"鸠摩智") 
	instruct_0();
	lib.FillColor(0, 0, CC.ScreenW, CC.ScreenH, C_RED, 128) --流血
	instruct_3(63,21,0,0,0,0,0,0,0,0,-2,-2,-2); --鸠摩智贴图消失
	ShowScreen()
	lib.Delay(80)
	lib.ShowSlow(15, 1)
	Cls()
	lib.ShowSlow(100, 0)		

	instruct_0();
	say("唉，一代宗师，最后也要归于尘土......我还是把他好好埋葬了吧。") 
	
	instruct_14();   --  14(E):场景变黑
	instruct_3(63,21,1,0,0,0,0,2770,2770,2770,-2,-2,-2); --墓贴图
	instruct_13();   --  13(D):重新显示场景	
	instruct_0();
	say("他的这些遗物，我还是收起来吧。") 	
	instruct_32(8, 3)
	QZXS("得到三颗天王保命丹")	
	instruct_0();   --  0(0)::空语句(清屏)	
	return
end


OEVENTLUA[347] = function() --袁承志加入增加属性
    instruct_1(1308,247,1);   --  1(1):[???]说: 袁公子，真没想到在这遇见*你。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1309,54,0);   --  1(1):[袁承志]说: 原来是你啊，我正要去找你*呢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1310,0,1);   --  1(1):[AAA]说: 找我？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1311,54,0);   --  1(1):[袁承志]说: 是啊，我这些年到处游历，*无意中发现了一本奇书《碧*血剑》，我想可能就是你要*寻找的天书之一吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1312,0,1);   --  1(1):[AAA]说: 太好了，这正是我要找的书*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,75,999,0,103) ==true then    --  28(1C):判断AAA品德75-999否则跳转到:Label0
        instruct_37(1);   --  37(25):增加道德1
        instruct_1(1313,54,0);   --  1(1):[袁承志]说: 既然如此，这本书就送给你*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1314,247,1);   --  1(1):[???]说: 哈哈，太好了，多谢袁公子！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(156,1);   --  2(2):得到物品[碧血剑][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1315,54,0);   --  1(1):[袁承志]说: 看到你高兴的样子，我的心*也再度活跃起来。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(1316,0,1);   --  1(1):[AAA]说: 那袁公子何不与我一同闯荡*江湖？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(104,75,1,0,966,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [75]

        if instruct_20(24,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
            JY.Person[54]["攻击力"]=JY.Person[54]["攻击力"]+20
			JY.Person[54]["防御力"]=JY.Person[54]["防御力"]+10	
			instruct_1(1317,54,0);   --  1(1):[袁承志]说: 好，愿陪少侠走一遭！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_10(54);   --  10(A):加入人物[袁承志]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1
		JY.Person[54]["攻击力"]=JY.Person[54]["攻击力"]+20
		JY.Person[54]["防御力"]=JY.Person[54]["防御力"]+10	
        instruct_1(12,54,0);   --  1(1):[袁承志]说: 你的队伍已满，我就直接去*小村吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(70,18,1,0,145,0,0,6818,6818,6818,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [18]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(1318,54,0);   --  1(1):[袁承志]说: 不过少侠近来在江湖上似乎*做了不少不道德的事情啊…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,348,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
end


OEVENTLUA[217] = function() --拿君子剑
    if instruct_4(201,2,0) ==false then    --  4(4):是否使用物品[断肠草]？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_37(1);   --  37(25):增加道德1
    instruct_32(201,-1);   --  32(20):物品[断肠草]+[-1]
    instruct_1(503,0,1);   --  1(1):[AAA]说: 杨兄，你快将这服下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(504,58,1);   --  1(1):[杨过]说: 这是什麽？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(505,0,1);   --  1(1):[AAA]说: 这是生长在情花丛旁的断肠*草。**我曾听人说过，凡毒蛇出没*之处，七步之内必有解毒之*药，其他毒物，无不如此。*这是天地间万物相生相克的*至理。**这断肠草正好生长在情花树*旁，虽说此草具有剧毒，但*我反覆思量，此草以毒攻毒*正是情花的对头克星。***服这毒草自是冒极大险，但*反正已无药可救，咱们就死*马当活马医，试它一试。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(506,58,0);   --  1(1):[杨过]说: 好，我便服这断肠草试试***……啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(507,0,1);   --  1(1):[AAA]说: 杨兄，怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,1,0,0,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(508,58,0);   --  1(1):[杨过]说: 我杨某这条命是少侠你救回*来的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(509,0,1);   --  1(1):[AAA]说: 你身上的毒质当真都解了？*还好还好，我刚真捏了把冷*汗。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(510,58,0);   --  1(1):[杨过]说: 这次真谢谢少侠的帮忙，*让杨某从鬼门关回来。
    instruct_0();   --  0(0)::空语句(清屏)
	say("这把双剑请少侠收下。",58,0,"杨过") 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(38,1)
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(511,0,1);   --  1(1):[AAA]说: 不知杨兄今後有何打算？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(512,58,0);   --  1(1):[杨过]说: 我要去寻找我的姑姑，咱们*后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_26(19,24,0,0,1);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end




OEVENTLUA[594] = function() --拿打狗
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	
    instruct_30(39,30,17,30);   --  30(1E):主角走动39-30--17-30
	

	say("天下英雄，丐帮现在举行英雄大会，选出新的帮主！",207,0,"丐帮弟子") 
	instruct_0();		
	TalkEx("等等！你们看这是什么？",0,1)
	instruct_0();	
	say("这是。。打狗棒！怎么会在你的手上？",207,0,"丐帮弟子") 
	instruct_0();	
	TalkEx("这个你别管，总之打狗棒在我手上，我就是丐帮下一任帮主！",0,1)
	instruct_0();		
    instruct_1(2583,69,0);   --  1(1):[洪七公]说: 好大的口气，现问过我们再*说！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(83,4,0,0) ==false then    --  6(6):战斗[83]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,12,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,37,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,13,1,0,595,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2584,247,1);   --  1(1):[???]说: 哈哈，这回没人反对了吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2585,207,0);   --  1(1):[???]说: ……***这位少侠武功盖世，自*是丐帮下一代帮主，这是丐*帮历代相传的打狗棒法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2586,0,1);   --  1(1):[AAA]说: 嘿嘿，我就是为它而来的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(167,1);   --  2(2):得到物品[打狗棒法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-5);   --  37(25):增加道德-5
end

OEVENTLUA[300] = function() --崆峒三连中间恢复，取消掉了
    instruct_14();   --  14(E):场景变黑
    instruct_37(-9);   --  37(25):增加道德-9
    instruct_26(40,9,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,12,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_39(4);   --  39(27):打开场景崑仑仙境
    instruct_13();   --  13(D):重新显示场景
    instruct_30(46,28,39,28);   --  30(1E):主角走动46-28--39-28
    instruct_1(1018,8,0);   --  1(1):[唐文亮]说: 明教余孽，受死吧
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(152,3,0,0) ==false then    --  6(6):战斗[152]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0
	--instruct_12()
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(89,1);   --  2(2):得到物品[七伤拳谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,28,0,0,0,0,0,5962,5962,5962,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,29,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,39,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,40,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1019,109,0);   --  1(1):[???]说: 崆峒派莫要惊惶，华山派得*到信息，前来增援
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1020,13,0);   --  1(1):[谢逊]说: 来得好，省得我们到处跑了*！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(153,3,0,0) ==false then    --  6(6):战斗[153]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1
	--instruct_12()
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(142,1);   --  2(2):得到物品[反两仪刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,43,0,0,0,0,0,5358,5358,5358,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,41,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,51,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,42,0,0,0,0,0,5398,5398,5398,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(1021,6,0);   --  1(1):[灭绝]说: 魔教休得猖狂，峨嵋派前来*支援
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1022,10,0);   --  1(1):[范遥]说: 老贼尼，赶来送死，我们就*成全你！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(154,3,0,0) ==false then    --  6(6):战斗[154]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2
	
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(33,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [13]
    instruct_3(33,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [12]
    instruct_3(33,11,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [11]
    instruct_3(33,10,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [10]
    instruct_3(33,9,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [9]
    instruct_3(33,8,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [8]
    instruct_3(33,7,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [7]
    instruct_3(33,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [6]
    instruct_3(33,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [5]
    instruct_3(33,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [4]
    instruct_3(33,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [3]
    instruct_3(33,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [2]
    instruct_3(33,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [28]
    instruct_3(33,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [28]
    instruct_3(33,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [27]
    instruct_3(33,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [26]
    instruct_3(33,25,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [25]
    instruct_3(33,24,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [24]
    instruct_3(33,23,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [23]
    instruct_3(33,22,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [22]
    instruct_3(33,21,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [21]
    instruct_3(33,20,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[峨嵋派]:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(120,1);   --  2(2):得到物品[灭绝剑谱][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(37,1);   --  2(2):得到物品[倚天剑][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(1023,13,0);   --  1(1):[谢逊]说: 哈哈哈，如今四派已灭，就*剩下少林和武当了。先诛少*林，再灭武当，唯我明教，*武林称王！哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(28,36,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:场景[少林寺]:场景事件编号 [36]
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[231] = function()
    instruct_1(565,0,1);   --  1(1):[AAA]说: 杨兄，龙姑娘，一切可好，*龙姑娘伤势如何了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(566,59,0);   --  1(1):[小龙女]说: 已经不碍事事了，多谢少侠*关心
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(567,58,0);   --  1(1):[杨过]说: 我夫妇得少侠多次多次相救*，深感大恩，若少侠有需要*之处，我夫妇自当尽力帮忙*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(2,0) ==false then    --  9(9):是否要求加入?是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_1(568,247,1);   --  1(1):[???]说: 近日旅途有些不顺，如能得*杨兄和龙姑娘相助，真是再*好不过了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(569,58,0);   --  1(1):[杨过]说: 既然如此，我们就直接去小*村了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(104,68,1,0,969,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [68]
    instruct_3(104,76,1,0,970,0,0,7242,7242,7242,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [76]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(70,19,1,0,151,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [19]
    instruct_3(70,20,1,0,153,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [20]
    instruct_37(2);   --  37(25):增加道德2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end

--鹿鼎记邪线
OEVENTLUA[63] = function() --神龙岛加入事件
    if instruct_16(664) then
    instruct_30(30,21,30,13);   --  30(1E):主角走动30-21--30-13
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(277,87,0);   --  1(1):[???]说: 呵呵呵……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(275,225,1);   --  1(1):[???]说: 喂，你瞧，瞧……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(278,0,1);   --  1(1):[AAA]说: 什么啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(279,225,1);   --  1(1):[???]说: 大美女啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(280,246,1);   --  1(1):[???]说: 这个，小宝兄，那可是人家*的老婆啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(282,225,0);   --  1(1):[???]说: 想想办法，搞过来啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(276,71,0);   --  1(1):[洪教主]说: 什么人，胆敢擅闯神龙教！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(281,247,1);   --  1(1):[???]说: 啊？啊，我，就是来找找有*没有我要的书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(283,71,0);   --  1(1):[洪教主]说: 你要找什么书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(284,0,1);   --  1(1):[AAA]说: 就是《鹿鼎记》一书。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(285,71,0);   --  1(1):[洪教主]说: 哦，还好，我这没有。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(286,0,1);   --  1(1):[AAA]说: 那你这有什么书？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(287,71,0);   --  1(1):[洪教主]说: 没有……我哪有什么书？…*…什么也没有……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(288,246,1);   --  1(1):[???]说: ？？？你好像心里有鬼啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(289,71,0);   --  1(1):[洪教主]说: 我有什么鬼？没有就是没有*，你要是再不滚蛋，就休怪*我不客气了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(290,0,1);   --  1(1):[AAA]说: 哼，打就打，谁怕谁。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(291,225,1);   --  1(1):[???]说: 啊，这就开打啦，你们先上*，我掩护。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(292,225,1);   --  1(1):[???]说: 等一下，等一下，我还有件*重要的事……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(293,0,1);   --  1(1):[AAA]说: ？？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(294,225,1);   --  1(1):[???]说: 千万要注意，别伤到美女。*好，你们继续！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(95,4,0,0) ==false then    --  6(6):战斗[95]是则跳转到:Label0
        
		if instruct_43(228,0,143) == true and (instruct_16(2) or 
			instruct_16(25) or instruct_16(17) or instruct_16(83)) and JY.Person[0]["品德"] <= 30 then
			instruct_0();	
			say("呜......这老头子好强！") 
			instruct_0();	
			say("嘿嘿，臭小子，敬酒不吃吃罚酒，现在想滚蛋也晚了！咦......？",71,0,"洪安通") 		
			instruct_0();				
			say("＜啊，那半部四十二章经掉出来了！＞") 
			instruct_0();	
			say("小子，你怎么也有四十二章经？快点交出来，饶你不死！",71,0,"洪安通") 		
			instruct_0();
			say("＜罢了，君子忍一时之气，成万世之霸业。留得性命在，以后有的是机会报仇。＞") 		
			instruct_0();
			say("这是晚辈在某个岛上获得的，前辈如果想要，尽管拿去便是。") 				
			instruct_0();	
			say("嘿嘿，不错不错，算你小子识趣。让我看看......跟我手上的那半部刚好凑成一部。",71,0,"洪安通") 			
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_2(229,1);   --  2(2):得到物品[四十二章经][1]
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_32(228,-1);   --  32(20):物品[半部四十二章经]+[-1]			
			instruct_0();	
			say("咦，怎么看不懂，这里面藏的到底是什么秘密......",71,0,"洪安通") 			
			instruct_0();
			say("＜哈哈，看这老家伙迷茫的怂样，八成是看不懂。好机会！＞") 				
			instruct_0();
			say("前辈武功高强智慧超群，自然能解开这书里的秘密。只是在下听说这书里的宝藏关系甚大，其中地点只有南贤北丑二人知晓。刚好那两人是我的叔伯，前辈如果不嫌弃，不妨把经书暂时交给在下，等起出宝藏之后在下定会双手奉上。") 
			instruct_0();	
			say("＜看这臭小子一脸奸诈，能信才有鬼。不过江湖传闻他真的认识南贤北丑，不如将计就计利用他一番。＞",71,0,"洪安通") 
			instruct_0();	
			say("好！如果你能替本座找到宝藏，本座便封你为白龙使！",71,0,"洪安通") 			
			instruct_0();
			say("教主宽宏大量知人善用，小的感激不尽！＜我呸！＞") 
			instruct_0();	
			say("来人，给白龙使，服下这丹丸。这是我们神龙教入教的仪式。",71,0,"洪安通") 
			instruct_0();
			say("＜难道这就是豹胎易筋丸？反正只能使高人变矮，胖人变瘦，说不定还能帮我减肥，吃就吃吧！＞谢教主！") 			
			instruct_14();   --  14(E):场景变黑
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景		
			instruct_0();	
			say("我忘了说明，这是我新发明的百涎丸，采集一百种毒蛇毒虫的唾涎调制而成。实在是益处多多啊。",71,0,"洪安通") 
			instruct_0();
			say("＜我靠！你不早说！我吞都吞了！＞") 			
			instruct_0();	
			say("好了，你去帮我寻找宝藏吧。找到了有你好处，找不到的话，哼哼。",71,0,"洪安通") 
			instruct_0();
			say("＜老不死！＞属下必定鞠躬尽瘁死而后已！") 	
			instruct_0();
			say("有没有搞错！这么快就认怂了。这家伙果然靠不住，我还是趁机溜吧......",225,0,"韦小宝") 
			instruct_21(664)
		    setteam(664, 0)
			instruct_14();   --  14(E):场景变黑
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景	
			instruct_30(30,13,30,28);   	
			instruct_0();
			say("＜终于出来了＞谁快来救命啊！我不想中毒！") 	
			if instruct_16(2) then
				instruct_0();
				say("别怕，有我在，百涎丸只是雕虫小技。",2,0,"程灵素") 
				instruct_14();   --  14(E):场景变黑
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_13();   --  13(D):重新显示场景	
				instruct_0();
				say("谢谢程姑娘救命之恩，药王果然名不虚传。") 					
			elseif instruct_16(25) then
				instruct_0();
				say("怕什么，有我在，百涎丸只是雕虫小技。",25,0,"蓝凤凰") 		
				instruct_14();   --  14(E):场景变黑
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_13();   --  13(D):重新显示场景	
				instruct_0();
				say("谢谢蓝姑娘救命之恩。") 					
			elseif instruct_16(17) then
				instruct_0();
				say("别怕，有我在，百涎丸只是雕虫小技。",17,0,"王难姑") 
				instruct_14();   --  14(E):场景变黑
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_13();   --  13(D):重新显示场景	
				instruct_0();
				say("谢谢前辈救命之恩。") 				
			elseif instruct_16(83) then
				instruct_0();
				say("小师傅，你也有今天啊，哈哈。别怕别怕，百涎丸只是雕虫小技。看我的。",83,0,"何铁手") 
				instruct_14();   --  14(E):场景变黑
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_13();   --  13(D):重新显示场景	
				instruct_0();
				say("好徒弟啊，幸好带了你来。") 				
			end
			instruct_0();
			say("好了，现在神清气爽。向着宝藏，出发！") 		
			instruct_3(-2,3,1,0,67,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			instruct_3(-2,19,1,0,67,0,0,-2,-2,-2,-2,-2,-2)
			SetS(67,28,34,3,7)			
			do return; end
		else
			instruct_15(0);   --  15(F):战斗失败，死亡
			instruct_0();   --  0(0)::空语句(清屏)
			do return; end
		end
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(295,0,1);   --  1(1):[AAA]说: 这回不横了吧？还不把书拿*来。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_43(228,0,143) == true then    --  43(2B):是否有物品半部四十二章经否则跳转到:Label1
        instruct_26(1,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(1,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_1(305,0,1);   --  1(1):[AAA]说: 又是半部《四十二章经》？*这下我正好可以凑成一部了*……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(229,1);   --  2(2):得到物品[四十二章经][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_32(228,-1);   --  32(20):物品[半部四十二章经]+[-1]
        instruct_1(297,225,1);   --  1(1):[???]说: 这位美女，啊不，教主夫人*，仙福永享，寿与天齐，那*个，你若没什么事，跟我们*一起走吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(298,71,0);   --  1(1):[洪教主]说: 你说什么！休打我夫人的主*意。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(299,87,0);   --  1(1):[???]说: 我原本以为呢，你就是武功*天下第一了，没想到随便来*几个人，就把你打得落花流*水，唉……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(300,71,0);   --  1(1):[洪教主]说: 我，我……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(301,225,1);   --  1(1):[???]说: 你什么你，你都七老八十了*，还霸占着这么漂亮的美眉*，你够了你。夫人，咱们走*吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(302,87,0);   --  1(1):[???]说: 走？好啊。*不过我为什么要跟你走啊？*我不会自己走吗*？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,3,1,0,88,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
        instruct_3(69,11,1,0,90,0,0,8256,8256,8256,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [11]
        instruct_3(69,10,1,0,91,0,0,7036,7036,7036,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [10]
        instruct_3(69,12,1,0,92,0,0,7030,7030,7030,-2,-2,-2);   --  3(3):修改事件定义:场景[丽春院]:场景事件编号 [12]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(304,71,0);   --  1(1):[洪教主]说: 夫人，夫人……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(303,0,1);   --  1(1):[AAA]说: 人都走了，还傻看什么，小*宝，咱们也走吧，这没有要*找的书了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(388,225,1);   --  1(1):[???]说: 唉，遇见两个大美女，都被*你放跑了，看来跟着你你甭*想泡到妞了，我要自己去追*！！
        instruct_0();   --  0(0)::空语句(清屏)
		instruct_21(664)
		setteam(664, 0)
        do return; end
    end    --:Label1

    instruct_2(228,1);   --  2(2):得到物品[半部四十二章经][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(296,0,1);   --  1(1):[AAA]说: 这是什么书？看你的样子一*定有问题，我先替你保管着*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(297,225,1);   --  1(1):[???]说: 这位美女，啊不，教主夫人*，仙福永享，寿与天齐，那*个，你若没什么事，跟我们*一起走吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(298,71,0);   --  1(1):[洪教主]说: 你说什么！休打我夫人的主*意。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(299,87,0);   --  1(1):[???]说: 我原本以为呢，你就是武功*天下第一了，没想到随便来*几个人，就把你打得落花流*水，唉……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(300,71,0);   --  1(1):[洪教主]说: 我，我……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(301,225,1);   --  1(1):[???]说: 你什么你，你都七老八十了*，还霸占着这么漂亮的美眉*，你够了你。夫人，咱们走*吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(302,87,0);   --  1(1):[???]说: 走？好啊。*不过我为什么要跟你走啊？*我不会自己走吗*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,3,1,0,88,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(304,71,0);   --  1(1):[洪教主]说: 夫人，夫人……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(303,0,1);   --  1(1):[AAA]说: 人都走了，还傻看什么，小*宝，咱们也走吧，这没有要*找的书了。
    instruct_0();   --  0(0)::空语句(清屏)
	        do return; end
    end    
end

OEVENTLUA[703] = function()
    if instruct_29(0,900,999,20,0) ==false then
	    JY.Person[400]["姓名"] = "慧聪"
		JY.Person[400]["生命最大值"] = 2999
		JY.Person[400]["生命"] = 2999
		JY.Person[400]["内力最大值"] = 7000
		JY.Person[400]["内力"] = 7000
		JY.Person[400]["武功2"] = 96
		JY.Person[400]["武功等级2"] = 999
		JY.Person[400]["声望"] = 96
		JY.Person[400]["武功3"] = 143
		JY.Person[400]["武功等级3"] = 999
		JY.Person[400]["武功4"] = 65
		JY.Person[400]["武功等级4"] = 999
	    say("我刚刚开始学习罗汉拳，咱们一起练练吧。",210,0,"慧聪"); --我刚刚开始学习罗汉拳，咱*们一起练练吧。
		instruct_0();
		
		if instruct_5(2,0) == false then --是否选择战斗？是则跳转Label1
		   do return; end
        end 
		
	    if instruct_6(79,1,0,1) == true then
		   if PersonKF(zj(),96) and GetS(111, 0, 0, 0) == 0 then 
		      say("施主武艺已经如此高强，罗汉伏魔功却是未能精深，小僧可为施主指点一二。",210,0,"慧聪");
	       instruct_0(); 
			  if instruct_11(0,188) == true then
			  	  QZXS("领悟罗汉伏魔功精髓！")
	              instruct_0();
	              say("多谢小师傅",0) 
	              SetS(111, 0, 0, 0,96)
				  else
				  say("小僧冒犯了。",615) 
				  end
		        do return; end
	       end
        end 
		do return; end
	end
	say("施主武艺已经如此高强，小僧万万不是对手。",210,0,"慧聪"); --我刚刚开始学习罗汉拳，咱*们一起练练吧。
	instruct_0();
end
OEVENTLUA[94] = function() --开放鹿鼎山事件
    if instruct_4(229,6,0) ==false then    --  4(4):是否使用物品[四十二章经]？是则跳转到:Label0
        instruct_1(384,0,1);   --  1(1):[AAA]说: 这个，别烧了，还是留着吧
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0
	instruct_1(385,0,1);   --  1(1):[AAA]说: 燃烧吧，我的《四十二章经*》……咦，有字显示出来，*真神奇，*“鹿鼎山，（23，81）……”
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_32(229,-1);   --  32(20):物品[四十二章经]+[-1]
	instruct_39(67);   --  39(27):打开场景鹿鼎山
	do return; end
end

OEVENTLUA[95] = function() --鹿鼎山二战洪安通
    instruct_3(-2,-2,1,0,0,0,0,2608,2608,2608,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(150,1);   --  2(2):得到物品[鹿鼎记][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(1,10,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(1,7,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	if GetS(67,28,34,3) == 7 then
		instruct_0();
		say("宝藏终于到手了！嘿，鬼才会把这些东西给那个洪安通。") 			
		instruct_0();	
		say("臭小子！我就知道你会搞鬼！",71,0,"洪安通") 		
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,7,1,0,0,0,0,7986,7986,7986,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
		JY.Person[71]["攻击力"] = JY.Person[71]["攻击力"] + 100
		JY.Person[71]["轻功"] = JY.Person[71]["轻功"] + 50
		JY.Person[71]["防御力"] = JY.Person[71]["防御力"] + 100
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景	
		instruct_0();
		say("咦，你怎么也来了。") 			
		instruct_0();	
		say("哼，我就知道你不会乖乖听话，所以一路派人跟着。你小子难道不怕没有解药毒发身亡吗！",71,0,"洪安通") 			
		instruct_0();
		say("那种小药丸，早就被我解掉了！刚好你自己送上门来，看我报仇雪恨！") 			
		instruct_0();	
        if instruct_6(257,4,0,0) ==false then  
            instruct_15(0);  
            instruct_0();  
            do return; end
        end   		
		instruct_3(-2,7,1,0,0,0,0,6786,6786,6786,-2,-2,-2)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		instruct_0();
		say("嘿，那老家伙倒是逃得快。咦，怎么还有人留下来？") 			
		instruct_0();
		say("大哥，是我啊。",225,0,"韦小宝") 	
		instruct_0();
		say("韦兄弟？你怎么会混在神龙教当中？") 		
		instruct_0();
		say("嘿嘿，说来话长，不如不说。如今我已经找到了漂亮老婆，准备扬帆出海逍遥自在了。",225,0,"韦小宝") 	
		instruct_0();
		say("嘻嘻。",86,0,"阿珂") 	
		instruct_0();
		say("嘻嘻。",87,0,"苏荃") 	
		instruct_0();		
		say("＜靠！怎么一找就找到两个！＞韦兄弟还真是享尽齐人之福啊，恭喜恭喜。") 	
		instruct_0();
		say("这还是多亏了大哥把我带出那个破妓院。对了，你要不要回神龙教看看？说不定能赶上一处好戏呢。",225,0,"韦小宝") 	
		instruct_0();
		say("好戏？什么好戏？") 	
		instruct_0();
		say("说了就没意思了，大哥快点过去吧。我就先走了，后会有期。",225,0,"韦小宝") 	
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,7,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景			
		instruct_0();
		say("不知道他说的好戏是什么，去看看吧。") 	
		instruct_0();
		SetS(71,29,47,3,24)
		instruct_3(71,24,0,0,0,0,10010,0,0,0,-2,-2,-2);	
		SetS(71,26,37,3,25)
		instruct_3(71,25,0,0,0,0,0,7034,7034,7034,-2,-2,-2);
		SetS(71,26,36,3,26)
		instruct_3(71,26,0,0,0,0,0,7012,7012,7012,-2,-2,-2);
		SetS(71,28,37,3,27)
		instruct_3(71,27,0,0,0,0,0,8212,8212,8212,-2,-2,-2);
		instruct_3(71,5,0,0,0,0,0,0,0,0,-2,-2,-2)
		instruct_3(71,10,0,0,0,0,0,0,0,0,-2,-2,-2)
	end 
end

OEVENTLUA[10010] = function() --神龙岛收洪安通
	instruct_3(71,24,0,0,0,0,0,0,0,0,-2,-2,-2);	
	instruct_14()
	instruct_13()
	instruct_30(29,47,29,40)
	instruct_0();	
	say("这里怎么打的这么热闹。哎，那个不是洪安通吗？") 
	instruct_0();	
	say("嘿嘿，洪安通，看你跑到哪里去！你属下的五龙使都已经投降了，你还是乖乖认栽吧。",150,0,"冯锡范") 	
	instruct_0();	
	say("冯锡范！我和你向来井水不犯河水，为何领兵攻打我教！",71,0,"洪安通") 
	instruct_0();	
	say("那要怪你自己贪心不足，竟然妄想挖掘我大清的龙脉宝藏。幸亏鹿鼎公韦大人忍辱负重混入神龙教打听到了这个消息。否则不知道还要被你横行多久！",150,0,"冯锡范") 	
	instruct_0();	
	say("＜原来那小子竟然做到了鹿鼎公，不简单啊。光这一手翻云覆雨的厚黑学就够我学一本了。＞") 
	instruct_0();	
	say("你休得含血喷人！我什么宝藏都没动！",71,0,"洪安通") 	
	instruct_0();	
	say("哼，等你到天牢里再分辩吧！来人，给我上！",150,0,"冯锡范") 
	instruct_0();	
	say("＜好机会，我应该落井下石吗？＞") 
	if DrawStrBoxYesNo(-1, -1, "要帮助冯锡范攻打神龙教吗?", C_WHITE, 30) == true then	
		instruct_0();	
		say("君子报仇，德也。洪安通受死！") 
		JY.Person[71]["攻击力"] = JY.Person[71]["攻击力"] + 50
		JY.Person[71]["轻功"] = JY.Person[71]["轻功"] + 50
		JY.Person[71]["防御力"] = JY.Person[71]["防御力"] + 50				
        if instruct_6(257,4,0,0) == false then  
            instruct_15(0);  
            instruct_0();  
            do return; end
        end   	
		JY.Person[71]["攻击力"] = JY.Person[71]["攻击力"] - 150
		JY.Person[71]["轻功"] = JY.Person[71]["轻功"] - 100
		JY.Person[71]["防御力"] = JY.Person[71]["防御力"] - 150				
		instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景		
		instruct_0();	
		say("寇首洪安通已然伏诛，其他人等速速放下武器投降！",150,0,"冯锡范") 
		instruct_0();	
		say("多谢少侠出手相助，咱们以前虽然有些过节，但请看在鹿鼎公的面子上多多包涵。",150,0,"冯锡范") 
		instruct_0();	
		say("＜有官撑腰果然不同，舒服啊！＞冯先生客气了，为国为民于公于私在下都应该出手相助。") 
		instruct_0();	
		say("少侠果然仁义过人。在下这里有本书，是鹿鼎公再三吩咐要转交给少侠的。另外这些礼物为在下的一点心意，请勿推辞。",150,0,"冯锡范") 
		instruct_0();	
		say("冯先生盛情，那在下就却之不恭了。") 
		instruct_32(17, 2)
		instruct_32(174, 5000)
		instruct_32(240, 1)
		QZXS("得到天山雪莲2个，银子5000两，神行百变秘籍")
		instruct_0();
		say("来人，把这贼窝烧掉！",150,0,"冯锡范") 		
		instruct_0();	
		say("＜这么快就烧房子，八成是贪了一堆东西想毁灭证据吧。算了，反正我也赚了，回家去吧。＞") 	
		My_Enter_SubScene(70, 34 ,31 ,2)	
		JY.Scene[71]["进入条件"] = 1
		do return end
	else
		instruct_0();	
		say("＜嘿，虽然我跟那老家伙有仇，不过那帮忘恩负义的更加让我讨厌＞洪教主别怕，我来助你！") 		
		JY.Person[71]["内力"] = math.modf(JY.Person[71]["内力最大值"] * 0.5)
		--JY.Person[71]["生命"] = math.modf(JY.Person[71]["生命最大值"] * 0.5)
		--JY.Person[71]["受伤程度"] = 50
		JY.Person[71]["攻击力"] = JY.Person[71]["攻击力"] - 100
		JY.Person[71]["轻功"] = JY.Person[71]["轻功"] - 50
		JY.Person[71]["防御力"] = JY.Person[71]["防御力"] - 100				
        if instruct_6(258,4,0,0) ==false then  
            instruct_15(0);  
            instruct_0();  
            do return; end
        end   
		instruct_3(-2,25,0,0,0,0,0,0,0,0,-2,-2,-2)
		instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2)
		JY.Person[71]["内力"] = JY.Person[71]["内力最大值"] 
		JY.Person[71]["生命"] = JY.Person[71]["生命最大值"]
		JY.Person[71]["受伤程度"] = 0		
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景		
		instruct_0();	
		say("小子！你为什么要救我？",71,0,"洪安通") 	
		instruct_0();	
		say("第一，小爷我看他们不顺眼。第二，看着你现在狼狈落魄的样子更加让我觉得心旷神怡啊。") 
		instruct_0();	
		say("你！",71,0,"洪安通") 	
		instruct_0();	
		say("嘿，别急着动手。就你现在这样子，随便来个人都能把你灭了。怎么样，英雄落魄是常事，不如加入我手下说不定还可以东山再起。") 
		instruct_0();	
		say("＜可恶，不过这小子说得没错。罢了，就忍这一下，以后要他好看！＞好，我这就去小村！",71,0,"洪安通") 
		instruct_14()
		instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2)
		instruct_3(70,50,1,0,1097,0,0,6790,6790,6790,-2,-2,-2)	
		instruct_3(70,48,1,0,1097,0,0,6792,6792,6792,-2,-2,-2)	
		instruct_3(70,49,1,0,1097,0,0,6794,6794,6794,-2,-2,-2)	
		instruct_13()
		instruct_0();	
		say("还真是容易被忽悠。嘿，成了我手下以后要报仇就容易多了。")
		addHZ(133)
		instruct_0();	
		say("这地方到处起火，八成要塌了。安全起见，我还是快点回家吧。") 	
		My_Enter_SubScene(70, 34 ,31 ,2)	
		JY.Scene[71]["进入条件"] = 1
		do return end		
	end
end

OEVENTLUA[740] = function()
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_25(22,26,24,17);   --  25(19):场景移动22-26--24-17
    instruct_1(2917,200,0);   --  1(1):[???]说: 贾老二，你看旁边桌上那妞*，身材要得，脸蛋更是要得*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(24,17,18,16);   --  25(19):场景移动24-17--18-16
    instruct_1(2918,35,0);   --  1(1):[令狐冲]说: （这次青城派大举南来，有*些古怪，师父叫我们来探探*动静。小师妹，要沉住气，*假装没听见。）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2920,79,0);   --  1(1):[???]说: （好，大师哥，我听你的）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(18,16,24,17);   --  25(19):场景移动18-16--24-17
    instruct_1(2919,200,0);   --  1(1):[???]说: 余兄弟，你要是喜欢，咱就*想想办法，把这妞弄回去，*嘿嘿嘿……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,5862,5862,5862,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2921,36,0);   --  1(1):[林平之]说: 甚么东西，两个不带眼的狗*崽子，却到我们福州府来撒*野！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2922,200,0);   --  1(1):[???]说: 贾老二，你看这个小白脸眉*清目秀，要上台去唱花旦，*真勾引得人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2923,200,0);   --  1(1):[???]说: 这位兔儿爷，我越瞧你越不*像男人，准是个大姑娘乔装*改扮的。你这脸蛋儿又红又*白，给我香个面孔好不好？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2924,36,0);   --  1(1):[林平之]说: 我乃福威镖局的少镖头，你*天大胆子，到太岁头上动土*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2925,200,0);   --  1(1):[???]说: 福威镖局？从来没听见过！*那是干甚么的？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2926,36,0);   --  1(1):[林平之]说: 专打狗崽子的！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2927,245,1);   --  1(1):[???]说: 说的好，我来帮你！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(24,17,18,16);   --  25(19):场景移动24-17--18-16
    instruct_1(2928,35,0);   --  1(1):[令狐冲]说: 小师妹，你知不知道这青城*派最厉害的招数叫什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2929,79,0);   --  1(1):[???]说: 不知道，叫什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2930,35,0);   --  1(1):[令狐冲]说: 叫“屁股向后平沙落雁式”*我这就让他们演给你瞧瞧。
    instruct_0();   --  0(0)::空语句(清屏)
	
	JY.Person[35]["攻击力"] = JY.Person[35]["攻击力"] + 200
	JY.Person[35]["轻功"] = JY.Person[35]["轻功"] + 200
	JY.Person[35]["防御力"] = JY.Person[35]["防御力"] + 200		
	JY.Person[35]["生命最大值"] = JY.Person[35]["生命最大值"] + 1500	
	JY.Person[35]["内力最大值"] = JY.Person[35]["内力最大值"] + 2000		
	JY.Person[35]["生命"] = JY.Person[35]["生命最大值"]	
	JY.Person[35]["内力"] = JY.Person[35]["内力最大值"]	
	JY.Person[35]["武功等级1"] = 999
	JY.Person[35]["声望"] = 89
	
    if instruct_6(203,3,0,0) ==false then    --  6(6):战斗[203]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label0
	
	JY.Person[35]["攻击力"] = JY.Person[35]["攻击力"] - 200
	JY.Person[35]["轻功"] = JY.Person[35]["轻功"] - 200
	JY.Person[35]["防御力"] = JY.Person[35]["防御力"] - 200		
	JY.Person[35]["生命最大值"] = JY.Person[35]["生命最大值"] - 1500	
	JY.Person[35]["内力最大值"] = JY.Person[35]["内力最大值"] - 2000		
	JY.Person[35]["生命"] = JY.Person[35]["生命最大值"]	
	JY.Person[35]["内力"] = JY.Person[35]["内力最大值"]	
	JY.Person[35]["武功等级1"] = 500
	JY.Person[35]["声望"] = 0
	
    instruct_3(-2,26,0,0,0,0,0,7624,7624,7624,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,0,0,0,7142,7142,7142,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,24,0,0,0,0,0,7144,7144,7144,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,28,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,25,0,0,0,0,0,6772,6772,6772,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_19(21,20);   --  19(13):主角移动至15-14
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2931,200,0);   --  1(1):[???]说: 你，你这兔儿爷，你竟敢杀*了我家少爷，咱们这梁子算*结下了，你们等着瞧吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2932,0,1);   --  1(1):[AAA]说: 看来对方来头不善，林兄弟*还是小心为是。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2933,36,0);   --  1(1):[林平之]说: 我想以我家福威镖局名头并*无大事。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2934,35,0);   --  1(1):[令狐冲]说: 这几个人都是四川青城派的*，你杀了的似乎是青城派余*观主的儿子，恐怕福威镖局*会有麻烦啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2935,0,1);   --  1(1):[AAA]说: 刚才见二位剑法不凡，不知*是那一派门下，怎样称呼？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2936,35,0);   --  1(1):[令狐冲]说: 在下华山令狐冲。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2937,79,0);   --  1(1):[???]说: 在下华山岳灵珊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2938,0,1);   --  1(1):[AAA]说: 华山派是名门大派，今日一*见果然名不虚传。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2939,35,0);   --  1(1):[令狐冲]说: 过奖过奖。林兄弟，我看这*青城派绝不会善罢甘休，你*还是回福威镖局早做准备吧*。我和师妹也要回华山禀明*家师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2940,36,0);   --  1(1):[林平之]说: 也好，那咱们后会有期。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2941,79,0);   --  1(1):[???]说: 后会有期
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2941,0,1);   --  1(1):[AAA]说: 后会有期
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(56,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [3]
    instruct_3(56,0,1,0,744,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[福威镖局]:场景事件编号 [0]
    instruct_37(1);   --  37(25):增加道德1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end

OEVENTLUA[279] = function() --冰火岛战狮王
    instruct_1(870,0,1);   --  1(1):[AAA]说: 这里有一撮金毛，应该是金*毛狮王谢逊的吧，可是谢法*王怎么不见了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(211,1);   --  2(2):得到物品[一撮金毛][1]
    instruct_0();   --  0(0)::空语句(清屏)
	instruct_14()
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	SetS(33, 31, 49, 3, 100)
	SetS(33, 32, 49, 3, 101)
	instruct_3(33,101,0,0,0,0,10011,0,0,0,-2,-2,-2); 
	instruct_3(33,100,0,0,0,0,10011,0,0,0,-2,-2,-2); 	
	instruct_13()
	instruct_0();	
	say("谁？？！！！") 	
	JY.Person[13]["攻击力"] = JY.Person[13]["攻击力"] + 150
	JY.Person[13]["轻功"] = JY.Person[13]["轻功"] + 150
	JY.Person[13]["防御力"] = JY.Person[13]["防御力"] + 150		
	if instruct_6(261,4,0,0) == true then	
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景 		
		instruct_0();	
		addthing(69)
	else
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景 	
	end
	instruct_0();
	JY.Person[13]["攻击力"] = JY.Person[13]["攻击力"] - 150
	JY.Person[13]["轻功"] = JY.Person[13]["轻功"] - 150
	JY.Person[13]["防御力"] = JY.Person[13]["防御力"] - 150		
	instruct_0();	
	say("那人在黑暗中也身法敏捷，内力奇高，难道是......") 	
	instruct_0();		
end


OEVENTLUA[33] = function() --飞狐邪线洗刀剑
    if instruct_16(4,2,0) ==false then    --  16(10):队伍是否有[阎基]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0


    if instruct_16(72,2,0) ==false then    --  16(10):队伍是否有[田归农]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_14();   --  14(E):场景变黑
    instruct_37(-3);   --  37(25):增加道德-3
    instruct_3(3,9,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [9]
    instruct_3(3,12,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [12]
    instruct_3(3,11,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [11]
    instruct_3(3,10,1,0,640,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [10]
    instruct_3(-2,1,0,0,0,0,0,7994,7994,7994,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(171,72,1);   --  1(1):[田归农]说: 一切按计划行事
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(172,4,1);   --  1(1):[阎基]说: 您就放心吧，嘿嘿
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(41,31,35,31);   --  30(1E):主角走动41-31--35-31
    instruct_1(173,72,1);   --  1(1):[田归农]说: 苗兄，别来无恙？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(50,3,0);   --  1(1):[苗人凤]说: 姓田的，亏你还有脸来见我*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(51,72,1);   --  1(1):[田归农]说: 苗兄，何必这么大的火气，*伤了你我兄弟的和气。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(52,3,0);   --  1(1):[苗人凤]说: ……**她还好吗？……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(174,72,1);   --  1(1):[田归农]说: ＜这个死阎基怎么还不动手*……＞
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(175,4,1);   --  1(1):[阎基]说: 着——！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(176,3,0);   --  1(1):[苗人凤]说: 啊——
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,1,0,0,0,0,0,5212,5212,5212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(177,72,1);   --  1(1):[田归农]说: 哈哈，我看你是见不到她了*。这药是从毒手药王那弄来*的断肠草粉末，药效也真够*狠，现下你双眼已瞎，我看*"打遍天下无敌手"的金面佛*苗人凤，今日要上西天了，*小兄弟，咱们上！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(178,1,0);   --  1(1):[胡斐]说: 苗大侠莫慌，我来帮你。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(0,4,0,0) ==false then    --  6(6):战斗[0]是则跳转到:Label2
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label2

    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(49,1,0,0,0,0,0,0,0,0,0,0,0) --邪线无法触发药王庄事件
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(144,1);   --  2(2):得到物品[飞狐外传][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(117,1);   --  2(2):得到物品[苗家剑法][1]
    instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(225,1);   --  2(2):得到物品[闯王藏宝图][1]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_39(5);   --  39(27):打开场景山洞	
	if JY.Person[72]["武功1"] == 44 then
		instruct_0();	
		say("苗家剑法果然厉害。嘿嘿，苗人凤你辛劳半生完善这武功，却没想到最后为他人做了嫁衣吧，哈哈哈。",72,0,"田归农") 
		instruct_0();	
		say("田大侠终于手刃苗人凤，实在可喜可贺。",4,0,"阎基") 
		instruct_0();	
		say("田某能有今日之功，阎大夫功不可没啊。对了，我听说如果一个人同时钻研这胡家刀法和苗家剑法可以从中得到启发，领悟更精妙的武学。如今胡家已经绝后，世上会这胡家刀法的就只有阎大夫一人了，不如我们来研究一下这两种武学的奥妙吧。",72,0,"田归农") 
		instruct_0();	
		say("田大侠有此美意，阎某自当尽力配合。",4,0,"阎基") 
		instruct_14()
		instruct_13()
		instruct_2(136,1);
		JY.Person[72]["武功2"] = 67
		JY.Person[72]["武功等级2"] = 0
		JY.Person[4]["武功2"] = 44
		JY.Person[4]["武功等级2"] = 0		
		instruct_0();	
		say("哈哈哈，好！这刀剑归真的奥妙终于被我俩领悟了！从此世上还有何人是我们敌手？",72,0,"田归农") 
		instruct_0();	
		say("（我怎么一点好处也没捞到......）") 
		instruct_0();			
	end
end

OEVENTLUA[20000] = function()	--杨逍离队事件
    say("杨左使，你先回小村，有需要时，我再去找你帮忙。");
    instruct_21(11);   --  21(15):离队
    instruct_3(70,100,1,0,20001,0,0,7982,7982,7982,-2,-2,-2); 
end

OEVENTLUA[20001] = function()	--杨逍小村
		MyTalk("有需要我帮忙的地方吗？", 11);
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,29) ==true then    --  9(9):是否要求加入?否则跳转到:Label1

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_10(11);   
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label2

				MyTalk("你的队伍已满，我无法加入。", 11);
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
end

OEVENTLUA[20002] = function()	--纪晓芙事件
    instruct_0()
	say("纪姑娘，这里可还住得惯吧？");
	instruct_0()
	say("谢谢少侠关心，我们在这里住得很好。",154,0,"纪晓芙")	
end

OEVENTLUA[1062] = function() --杀灭绝后杨逍支线关闭
    instruct_1(3974,6,0);   --  1(1):[灭绝]说: 魔教妖邪，来我峨嵋山有何*贵事．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3975,0,1);   --  1(1):[AAA]说: 上回看你手中那把宝剑，*寒芒吞吐，电闪星飞，想必*就是传说中的”倚天剑”？*小侠我想向你借来用用．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3976,6,0);   --  1(1):[灭绝]说: 光明顶上被你侥幸获胜，*你现在还敢来我峨嵋撒野，*莫非真视我峨嵋无人．
    instruct_0();   --  0(0)::空语句(清屏)
    if instruct_5(11,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(3977,0,1);   --  1(1):[AAA]说: 那里，那里．我只不过是来*劝师太，与明教间的事能和*就和．*自古以来冤家宜解不宜结．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(3978,6,0);   --  1(1):[灭绝]说: 阁下未免管的太多了吧，*难道你真以为你是*”武林盟主”吗！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0
    if instruct_6(20,4,0,0) ==false then    --  6(6):战斗[20]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3979,0,1);   --  1(1):[AAA]说: 宝剑还是应该配英雄，*怎样？师太，这”倚天剑”*可以让给我了吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3980,6,0);   --  1(1):[灭绝]说: 魔教妖孽，想从我灭绝手中*拿走倚天剑，等下辈子吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_27(2,5468,5496);   --  27(1B):显示动画
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,-2,-2,1063,-1,-1,5238,5238,5238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3981,191,0);   --  1(1):[???]说: 师父，师父！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3982,0,1);   --  1(1):[AAA]说: 师太，师太！何苦如此呢？*若真不想给我，跟我说一声*就行了．唉！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3983,191,0);   --  1(1):[???]说: 师父，师父！*可恶的魔教妖邪，*替我师父嚐命来．
    instruct_0();   --  0(0)::空语句(清屏)
    if instruct_6(21,4,0,0) ==false then    --  6(6):战斗[21]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,4,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,10,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,3,1,0,1064,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
	addevent(-2, 100, 0, 0, 0, 0)
	addevent(-2, 101, 0, 0, 0, 0)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(-5);   --  37(25):增加道德-5
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[10011] = function()	--杨逍峨嵋事件	
	if instruct_16(9) and instruct_16(16) then
		instruct_14()
		SetS(33, 31, 42, 3, 99)
		instruct_3(33,99,0,0,0,0,0,7982,7982,7982,-2,-2,-2); 
		instruct_3(33,100,0,0,0,0,0,0,0,0,-2,-2,-2); 
		instruct_3(33,101,0,0,0,0,0,0,0,0,-2,-2,-2); 
		instruct_13()	
		instruct_0()
		say("咦？那个人是......杨左使？");
		instruct_0();	
		instruct_30(31,49,31,44)	
		instruct_0();	
		say("啊，属下参见教主和少侠！",11,0,"杨逍") 
		instruct_0();	
		say("杨左使不必多礼。为何你会在这里？",9,0,"张无忌") 
		instruct_0();	
		say("这......",11,0,"杨逍")
		instruct_0()
		say("杨左使似有难言之隐，无忌兄弟你也别追问了。");
		instruct_0();	
		say("不！教主既然问起，而少侠又对我明教有大恩，杨逍自当言无不尽。这事说来话长......其实我来这里，是想找一个人。",11,0,"杨逍")	
		instruct_0()
		say("峨嵋派的人？");
		instruct_0();	
		say("是的。在下曾与一位峨嵋派的姑娘私订了终身。可惜彼此之间始终有门派之别。我本来打算带她远走高飞，从此不问世事。但六大门派突然围攻光明顶，杨某深受阳教主大恩，不能不报，闻讯后日夜兼程赶回光明顶助拳。她见劝我不住，又恐彼此门派冤仇再也难解，郁郁之下远遁而去。",11,0,"杨逍")	
		instruct_0();	
		say("我见如今困局已解，便下山来寻访她的踪迹。可惜数个月来，我踏遍了所有她可能去的地方，都一无所获。失神之下，便来到了这峨嵋山，祈望能在这里打听出她的消息",11,0,"杨逍")	
		instruct_0()
		say("杨左使深情如此，令人动容。如不嫌弃，在下愿助杨左使一臂之力。不知那姑娘姓名特征？");	
		instruct_0();	
		say("她姓纪，名晓芙。",11,0,"杨逍")	
		instruct_0();	
		say("啊？这个名字......",16,0,"胡青牛")		
		instruct_0();	
		say("胡大夫是否有什么线索？",9,0,"张无忌") 	
		instruct_0();	
		say("属下不敢隐瞒。纪姑娘曾经来过我蝴蝶谷求医。本来我只救明教之人，但内子瞧她孤苦伶仃且身怀六甲，起了怜悯之心......",16,0,"胡青牛")		
		instruct_0();	
		say("身怀六甲？难道......难道！！！胡大夫可知她人现在在何处？",11,0,"杨逍")		
		instruct_0();	
		say("这个......她行动不便，应该走不了多远。我猜她应该住在蝴蝶谷附近吧。",16,0,"胡青牛")		
		instruct_0();	
		say("教主！少侠！杨逍告退！",11,0,"杨逍")		
		instruct_14()
		instruct_3(33,99,0,0,0,0,0,0,0,0,-2,-2,-2); 
		instruct_13()		
		instruct_0()
		say("杨左使！怎么走得这么快。罢了，无忌兄弟，我们也帮着找找吧。");
		instruct_0();	
		say("好！",9,0,"张无忌") 		
		SetS(40, 11, 36, 3, 61)
		SetS(40, 11, 35, 3, 62)
		instruct_3(40,62,0,0,0,0,0,5396,5396,5396,-2,-2,-2); 
		SetS(40, 12, 35, 3, 63)
		instruct_3(40,63,0,0,0,0,0,5362,5362,5362,-2,-2,-2); 
		SetS(40, 12, 40, 3, 64)
		instruct_3(40,64,0,0,0,0,10012,0,0,0,-2,-2,-2); 
		instruct_3(11,90,0,0,0,0,0,0,0,0,-2,-2,-2); 	
	end
end

OEVENTLUA[10012] = function()	--救纪晓芙事件	
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_0();	
	say("咦，里面有人在争执。")	
	instruct_0();	
	say("你还是不肯听师父的话吗！那杨逍与我峨嵋派有血海深仇，只要你肯假意接近，寻个机会把他杀了，峨嵋派的掌门之位就是你的了！",6,0,"灭绝")		
	instruct_0();	
	say("我....师父....我做不到....我....我肚子里已经有了他的骨肉....",154,0,"纪晓芙")		
	instruct_0();	
	say("什么！你，你个逆徒！！",6,0,"灭绝")		
	instruct_0();	
	say("住手！")	
	JY.Person[6]["攻击力"] = JY.Person[6]["攻击力"]+100
	JY.Person[6]["防御力"] = JY.Person[6]["防御力"]+100
	JY.Person[6]["轻功"] = JY.Person[6]["轻功"]+100	
    if instruct_6(262,4,0,0) ==false then   
        instruct_0();  
        instruct_15(0);  
        do return; end
    end    
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();   --  13(D):重新显示场景	
	instruct_0();	
	say("又是你！我自己管教徒弟关你何事！",6,0,"灭绝")		
	instruct_0();	
	say("人家两情相悦，师太何苦棒打鸳鸯。何况纪姑娘现在身怀六甲，这一剑刺下去一尸两命。师太既为出家人，理应持大慈悲戒，破除嗔恚障才是。")	
	instruct_0();	
	say("晓芙！晓芙！",11,0,"杨逍")		
	instruct_14()
	instruct_3(40,61,0,0,0,0,0,5340,5340,5340,-2,-2,-2); 
	instruct_13()
	instruct_0();	
	say("我终于找到你了，晓芙！",11,0,"杨逍")	
	instruct_0();	
	say("是你，真的是你....",154,0,"纪晓芙")		
	instruct_0();	
	say("呸，就是你！杨逍，拿命来！！",6,0,"灭绝")		
	JY.Person[11]["生命最大值"] = JY.Person[11]["生命最大值"] + 700	
	JY.Person[11]["内力最大值"] = JY.Person[11]["内力最大值"] + 1000		
	JY.Person[11]["生命"] = JY.Person[11]["生命最大值"]	
	JY.Person[11]["内力"] = JY.Person[11]["内力最大值"]	
    if instruct_6(263,4,0,0) ==false then   
        instruct_0();  
        instruct_15(0);  
        do return; end
    end  
	JY.Person[6]["攻击力"] = JY.Person[6]["攻击力"]-100
	JY.Person[6]["防御力"] = JY.Person[6]["防御力"]-100
	JY.Person[6]["轻功"] = JY.Person[6]["轻功"]-100	
	JY.Person[11]["生命最大值"] = JY.Person[11]["生命最大值"] - 700	
	JY.Person[11]["内力最大值"] = JY.Person[11]["内力最大值"] - 1000		
	JY.Person[11]["生命"] = JY.Person[11]["生命最大值"]	
	JY.Person[11]["内力"] = JY.Person[11]["内力最大值"]		
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();   --  13(D):重新显示场景	
	instruct_0();	
	say("灭绝！我今天看在晓芙面上不与你为难，你若是知趣就快快离开。",11,0,"杨逍")
	instruct_0();	
	say("师父....晓芙对不起你....",154,0,"纪晓芙")		
	instruct_0();	
	say("哼！我不是你师父！你以后也莫再自称是峨嵋弟子！",6,0,"灭绝")
	instruct_14()
	instruct_3(40,63,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_13()	
	instruct_0();	
	say("两位经过这一番风浪终于重逢，真是可喜可贺啊。")	
	instruct_0();	
	say("这都多亏了少侠为晓芙挡下那一剑。杨某亏欠少侠甚多，不知如何才能报答。",11,0,"杨逍")	
	instruct_0();	
	say("多谢少侠救命之恩。",154,0,"纪晓芙")	
	instruct_0();	
	say("两位客气了。我看纪姑娘身体多有不便，不如来我小村修养一阵，也好有个照应。")	
	instruct_0();	
	say("如今教内已稳定下来，光明顶又有几位护法和范兄弟坐镇，应该无碍。那我们就叨扰了。",11,0,"杨逍")	
	instruct_14()
	instruct_3(40,61,0,0,0,0,0,0,0,0,-2,-2,-2); 
	instruct_3(40,62,0,0,0,0,0,0,0,0,-2,-2,-2); 	
	SetS(70,19,23,3,100); 
	SetS(70,18,23,3,101); 
    instruct_3(70,100,1,0,20001,0,0,7982,7982,7982,-2,-2,-2); 	
	instruct_3(70,101,1,0,20002,0,0,5398,5398,5398,-2,-2,-2); 	
	instruct_13()	
	instruct_37(3)	
end

OEVENTLUA[573] = function()
    if cxzj() == 49 then
			   instruct_1(4366,49,0) --[49虚竹]:三弟，好久不见了
	           instruct_0();
			   instruct_1(4367,53,0); --[53段誉]:二哥！
			   instruct_0();
			   say("不知大哥和阿朱姑娘在塞外可好...", 53)
			   instruct_0();
			   instruct_1(4370,49,0) --[49虚竹]:应该不错吧，远离了这片江湖，远离了恩怨情仇，现在的大哥一定很幸福。
			   instruct_0();
			   say("不错，我还真向往乔大哥这种生活...", 53)
			   instruct_0();
			   say("呵呵，今天不谈其他，好好喝酒...", 49)
			   instruct_0();
			   instruct_14();
			   instruct_13();
		    if instruct_18(79,0,192) == true then
			   instruct_1(4381,53,0); --[53段誉]:对了，二哥，这套北冥神功我教给你吧...
			   instruct_35(zj(),1,85,999); --设置[49虚竹]武功[1]为[85北冥神功]经验为999
			   instruct_0();
			   instruct_1(4382,49,0) --[49虚竹]:那，三弟，王姑娘，这是灵鹫宫的特产，可以美容...
			   instruct_0();
			   instruct_1(4383,53,0); --[53段誉]:谢谢二哥，我们就不客气了。
	           instruct_0(); 
			   instruct_48(53,100); --[53段誉]增加生命100
			   instruct_48(76,200); --[76王语嫣]增加生命200
	           instruct_0();
		    end	   
			   say("...二哥，我们也去小村帮忙吧。", 53)
	           instruct_0();
			   say("啊，可是三弟，这，这岂不是打扰你们的神仙生活了？", 49)
	           instruct_0();
			   say("呵呵，我能和语嫣在一起可多愧二哥，少侠有事我们怎能不帮忙，对不对，王姑娘。", 53)
			   instruct_0();
			   say("对，我们这就去小村。", 76)
	           instruct_0();
	           instruct_14();
			   instruct_3(104,59,1,0,965,0,0,6308,6308,6308,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
			   instruct_3(104,51,1,0,977,0,0,6296,6296,6296,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
			   instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
			   instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
			   instruct_3(70,9,1,0,143,0,0,6310,6310,6310,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
			   instruct_3(70,27,1,0,167,0,0,6298,6298,6298,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
	           instruct_0();
	           instruct_13();  
		do return end
	end		
    instruct_37(2) --增加道德2
	instruct_1(2502,0,1); --段公子好，王姑娘好。恭喜*段公子终於虏获美人心。
	instruct_0();
	instruct_1(2503,53,0); --[53段誉]:呵呵，这都多亏了少侠的帮*忙啊。
	instruct_0();
	instruct_1(2504,0,1); --[0资]:哪里哪里，我不曾帮过任何*的忙，都是段公子精诚所至*，金石为开啊。但不知慕容*公子……
	instruct_0();
	instruct_1(2505,76,0); --[76王语嫣]:我表哥他……他心里只有那*个虚无飘渺的皇帝梦……我*现在才知道，真心待我的只*有段公子一个人。
	instruct_0();
	    if instruct_16(49,0,198) == true then
		    if instruct_18(79,0,192) == true then
			   instruct_1(4366,49,0) --[49虚竹]:三弟，好久不见了
	           instruct_0();
			   instruct_1(4367,53,0); --[53段誉]:二哥！
			   instruct_0();
			   instruct_1(4368,0,1); --[0资]:哦？对了，你们是结拜兄弟吧，大哥就是乔大哥。
			   instruct_0();
			   instruct_1(4369,53,0);--[53段誉]:是啊，不知大哥和阿朱姑娘在塞外可好...
			   instruct_0();
			   instruct_1(4370,49,0) --[49虚竹]:应该不错吧，远离了这片江湖，远离了恩怨情仇，现在的大哥一定很幸福。
			   instruct_0();
			   instruct_1(4371,0,1); --[0资]:不错，我还真向往乔大哥这种生活，可惜我还有事情没有做完...
			   instruct_0();
			   instruct_1(4372,49,0) --[49虚竹]:呵呵，小兄弟的事我们也会尽力帮忙的，今天不谈其他，好好喝酒...
			   instruct_0();
			   instruct_1(4373,0,1); --[0资]:哈哈，我们好好喝喝，不过别把王姑娘冷落了，否则段兄可要遭殃..
			   instruct_0();
			   instruct_1(4374,76,0); --[76王语嫣]:少侠别胡说<脸红>
			   instruct_0();
			   instruct_1(4375,0,1); --[0资]:嘿，不说了不说了，我们还是说说别的...
			   instruct_0();
			   instruct_14();
			   instruct_13();
			   instruct_1(4381,53,0); --[53段誉]:对了，二哥，这套北冥神功我教给你吧...
			   instruct_35(49,1,85,999); --设置[49虚竹]武功[1]为[85北冥神功]经验为999
			   instruct_0();
			   instruct_1(4382,49,0) --[49虚竹]:那，三弟，王姑娘，这是灵鹫宫的特产，可以美容...
			   instruct_0();
			   instruct_1(4383,53,0); --[53段誉]:谢谢二哥，我们就不客气了。
	           instruct_0(); 
			   instruct_48(53,100); --[53段誉]增加生命100
			   instruct_48(76,200); --[76王语嫣]增加生命200
	           instruct_0();
			   instruct_1(4376,0,1); --[0资]:今天真开心啊，哎，这样交流的机会可不多了。。。
	           instruct_0();
			   instruct_0();
			   instruct_1(4377,53,0);--[53段誉]:...少侠，我们也去小村帮忙吧。
	           instruct_0();
			   instruct_1(4378,0,1);  --[0资]:啊，可是段兄，这，这岂不是打扰你们的神仙生活了？
	           instruct_0();
			   instruct_1(4379,53,0); --[53段誉]:呵呵，我能和语嫣在一起可多愧少侠，少侠有事我们怎能不帮忙，对不对，王姑娘。
			   instruct_0();
			   instruct_1(4380,0,1); --[0资]:对，少侠，我们这就去小村。
	           instruct_0();
	           instruct_14();
			   instruct_3(104,59,1,0,965,0,0,6308,6308,6308,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
			   instruct_3(104,51,1,0,977,0,0,6296,6296,6296,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
			   instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
			   instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
			   instruct_3(70,9,1,0,143,0,0,6310,6310,6310,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
			   instruct_3(70,27,1,0,167,0,0,6298,6298,6298,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
	           instruct_0();
	           instruct_13();
			   end
			   do return end
	        end
	instruct_1(2506,53,0);--[53段誉]:语嫣……这位少侠帮了我们*这么多，我们也帮帮他吧。
	instruct_0();
	instruct_1(2507,76,0); --[76王语嫣]:好啊，那我们就去小村吧
	instruct_0();
	instruct_14();
	instruct_3(104,59,1,0,965,0,0,6308,6308,6308,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
	instruct_3(104,51,1,0,977,0,0,6296,6296,6296,-2,-2,-2);--修改事件定义:场景[104钓鱼岛]:场景事件编号[59]
	instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
	instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0); --修改事件定义:
	instruct_3(70,9,1,0,143,0,0,6310,6310,6310,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
	instruct_3(70,27,1,0,167,0,0,6298,6298,6298,-2,-2,-2); --修改事件定义:场景[70小村]:场景事件编号[27]
	instruct_0();
	instruct_13();
end
OEVENTLUA[631] = function()
    instruct_2(99,1);   --  2(2):得到物品[天山折梅手][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号

	if cxzj() == 49 then    --  16(10):队伍是否有[虚竹]否则跳转到:Label0
        instruct_33(zj(),14,0);   --  33(21):虚竹学会武功天山折梅手
		AddPersonAttrib(zj(), "拳掌功夫", 10)
		tb("虚竹拳掌加十点")
        instruct_0();   --  0(0)::空语句(清屏)
    end
    if instruct_16(49,0,5) ==true then    --  16(10):队伍是否有[虚竹]否则跳转到:Label0
        instruct_33(49,14,0);   --  33(21):虚竹学会武功天山折梅手
		AddPersonAttrib(49, "拳掌功夫", 10)
		tb("虚竹拳掌加十点")
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0
end

OEVENTLUA[634] = function() --主角成为逍遥掌门灵鹫宫剧情变化
    if instruct_18(200,2,0) ==false then    --  18(12):是否有物品[七宝指环]是则跳转到:Label0
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,2,1,0,0,0,0,5288,5288,5288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,1,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(45,45,39,45);   --  25(19):场景移动45-45--39-45
    instruct_1(2680,118,0);   --  1(1):[???]说: 哈哈哈，我的好师姐，我算*准了你返老还童的日子，你*躲不过去的，如今你的七经*八脉都已被我震断，你的死*期已到，哈哈哈……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2681,117,0);   --  1(1):[???]说: 你这个臭贱人……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2682,245,1);   --  1(1):[???]说: 那个老婆婆好像受伤了，赶*快救人。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(202,4,0,0) ==false then    --  6(6):战斗[202]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_19(41,45);   --  19(13):主角移动至29-2D
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2683,0,1);   --  1(1):[AAA]说: 老婆婆，你没事吧？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2684,117,0);   --  1(1):[???]说: 臭小子，什么没事，老婆子*就要死啦！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2685,0,1);   --  1(1):[AAA]说: 啊？这……这……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2686,117,0);   --  1(1):[???]说: 不过那个贱人总算死在了我*前头，老婆子还得谢谢你啊*……*咦？你手上拿的是什么？*你怎么会有我们逍遥派的*掌门指环？
    instruct_0();   --  0(0)::空语句(清屏)
	if MPPD(zj()) == 7 or cxzj() == 49 then
		say("这个是....我师父给我的，事情是这样的....")
	else
		instruct_1(2687,0,1);   --  1(1):[AAA]说: 这个是无崖子前辈给我兄弟*的，事情是这样的……
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2688,117,0);   --  1(1):[???]说: 师兄，师兄，你怎么在我之*前走了……
    instruct_0();   --  0(0)::空语句(清屏)
	if MPPD(zj()) == 7 or cxzj() == 49 then
		say("难道你就是童佬师叔？那刚才那个女人是....？")
	else
		instruct_1(2689,0,1);   --  1(1):[AAA]说: 前辈原来是无崖子前辈的师*妹啊，那刚才那个女人是…*…？
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2690,117,0);   --  1(1):[???]说: 那个贱人叫李秋水，是我师*妹，敢和我争师兄，哼，终*于死在我前头了。小子，帮*我个忙，把这个信号发到空*中。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,5,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,6,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,8,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2691,240,0);   --  1(1):[???]说: 姥姥，姥姥，你怎么了？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2692,117,0);   --  1(1):[???]说: 姥姥要死了，你们是不是很*开心啊？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2693,240,0);   --  1(1):[???]说: 属下不敢。姥姥，是谁把你*害成这样，我们去找他算帐*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2694,117,0);   --  1(1):[???]说: 哼，你们倒好心！不用啦，*这位少侠已经杀了那个贱人*。你们听着，这位少侠以后*就是灵鹫宫的新主人，快点*拜见！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2695,240,0);   --  1(1):[???]说: 参见新主人！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2696,248,1);   --  1(1):[???]说: 啊？啊。好，好，（好别扭*……）
    instruct_0();   --  0(0)::空语句(清屏)
	if MPPD(zj()) == 7 and cxzj() ~= 49 then
		say("小子，以后灵鹫宫就是你的了。你既然去找那姓丁的报仇，我就传你一些功夫。", 117)
		say("谢谢师叔！")
		instruct_33(zj(),101,0)
		say("师兄，我要去找你了....", 117)
	elseif cxzj() == 49 then 	
	    say("小和尚，以后灵鹫宫就是你的了。你既然去找那姓丁的报仇，我就传你一些功夫。", 117)
		say("谢谢师叔！")
		dark()
		light()
		instruct_33(zj(),176,0);
		AddPersonAttrib(0, "暗器技巧", 50)
		tb("虚竹暗器加五十点")			
		addthing(336)
		say("师兄，我要去找你了....", 117)
	else	
		if inteam(49) then			
			say("你这小和尚就是新的逍遥掌门吧。", 117)
			say("这个..小僧..", 49)
			say("哼，看你武功低微畏畏缩缩的样子，唉，我就传授这生死符给你，也算是对师兄有个交待。", 117)
			setJX(49)
			dark()
			light()
			instruct_33(49,176,0);
			AddPersonAttrib(49, "暗器技巧", 50)
			tb("虚竹暗器加五十点")	
            say("小僧..似乎感觉到记忆的某个封印打开了..", 49)
            QZXS("虚竹领悟八部战意技【夜叉·轮回生死符】！")			
			addthing(336)
		end
		instruct_1(2697,117,0);   --  1(1):[???]说: 小子，以后灵鹫宫就是你的*了。***师兄，我要去找你了……
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2698,240,0);   --  1(1):[???]说: 姥姥……
    instruct_0();   --  0(0)::空语句(清屏)
		for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do
	        if (JY.Person[zj()]["武功"..i] == 85 or T1LEQ(0)) and GetS(111, 0, 0, 0) == 0 then
	                    say("咦？这是刚李秋水掉落的东西？北冥神功注解！！好东西，要不要学？",0) 
	                    instruct_0();
			if instruct_11(0,188) == true then
	                    QZXS("领悟北冥神功精义！")
	                    instruct_0();
	                    SetS(111, 0, 0, 0,85)
			else
				        say("还是算了，不知道会不会练死人。",0) 
			end 
	instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
			do return; end
            end
		end	
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end

OEVENTLUA[911] = function() --修正笑傲邪线解决隐形岳不群bug
    instruct_14();   --  14(E):场景变黑
    instruct_26(40,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(40,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,83,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [83]
    instruct_3(-2,84,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [84]
    instruct_3(-2,85,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [85]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(28,28,15,28);   --  30(1E):主角走动28-28--15-28
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3534,0,1);   --  1(1):[AAA]说: 你就是东方不败？*＜怎麽看起来像个娘们？＞
    instruct_0();   --  0(0)::空语句(清屏)
	JY.Person[27]["半身像"] = 530
	JY.Person[27]["性别"] = 1
	if JY.Person[0]["性别"] == 1 then
	say("啊！你便是到梅庄救走任我行的那小丫头．本教主早想见你一见...",27)
	say("小丫头，要不要来我神教做事？本教主可以给你任何你想要的！",27)
	else
	say("啊！你便是到梅庄救走任我行的那小子．本教主早想见你一见...",27)
	say("小子，要不要来我神教做事？本教主可以给你任何你想要的！",27)
	end
	say("。。。。。（任何想要的？那不是可以让他给我天书？我到底要不要加入？）",0)
	if instruct_11(0,188) == true then
		if JY.Person[0]["性别"] == 1 then
	say("小丫头，你想倒戈？",26)
	say("姑娘，东方不败作恶多端乃是人人得而诛之的魔头，你可不能误入歧途啊！！",35)
	say("。。。。。。。",0)
	say("嘻嘻嘻……本教主是魔头，难道你身边的这位就不是了么？",27)
	say("任前辈早已回头是岸，岂能相提并论",35)
	say("本教主做事又何须在意他人说法！",27)
	say("小丫头...你想好了没有?",27)
	say("本教主可是第一次亲自邀人入我神教。",27)
	say("东方...教主..",0)
	say("嘻嘻嘻……本教主就知道你会同意的，本教主观察你好久了，总算没让本教主失望。",27)
	say("（那开始说什么早想。。。。）",0)
	say("哼！都是叛徒！",26)
	say("姑娘，你...！唉！",35)
	    else
	say("小子，你想倒戈？",26)
	say("小兄弟，东方不败作恶多端乃是人人得而诛之的魔头，你可不能误入歧途啊！！",35)
	say("。。。。。。。",0)
	say("嘻嘻嘻……本教主是魔头，难道你身边的这位就不是了么？",27)
	say("任前辈早已回头是岸，岂能相提并论",35)
	say("本教主做事又何须在意他人说法！",27)
	say("小子...你想好了没有?",27)
	say("本教主可是第一次亲自邀人入我神教。",27)
	say("东方...教主..",0)
	say("嘻嘻嘻……本教主就知道你会同意的，本教主观察你好久了，总算没让本教主失望。",27)
	say("（那开始说什么早想。。。。）",0)
	say("哼！都是叛徒！",26)
	say("小兄弟，你...！唉！",35)
	    end
	say("爹，冲哥，东方不败有了帮手，我们要小心！",73)
	say("令狐冲，待会保护好盈盈！",26)
	say("放心吧任前辈，我一定会保护好盈盈的！",35)
	say("我亲自送你们上路！",27)
	SetS(54,0,0,1, 2)
	JoinMP(27,12,5)
	JoinMP(26,12,5)
	    if WarMain(54) ==false then    --  6(6):战斗[54]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
        end
	say("啊！！",26)
	say("啊！！",234,0,"向问天")
	say("啊！！",35)
	say("啊！！",73)
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,0,1,0,5000,0,0,5720,5720,5720,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5000]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,95,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [95]
    instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [95]
    instruct_3(-2,2,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,3,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,4,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,5,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,6,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,7,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,8,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,9,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,10,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,11,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,17,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,18,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,19,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,20,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,21,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,22,1,0,888,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
		do return; end
    end
	SetS(54,0,0,1, 1)
    instruct_1(3692,0,1);   --  1(1):[AAA]说: 任教主、向大哥、令狐大哥*、任大小姐，你们怎么样？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3537,26,0);   --  1(1):[任我行]说: 还好，死不了。这东方不败*已经练成葵花宝典上的武功*，你们可千万小心。
    instruct_0();   --  0(0)::空语句(清屏)
	say("任教主，我看你是老糊涂了*。你的吸星大法，加上令狐*冲的独孤九剑，都不是我的*对手，你却让这个小娃娃来*送死，嘻嘻嘻……?",27)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3694,245,1);   --  1(1):[???]说: ＜她一笑起来好恶心……我*最讨厌断背山了！＞，你这*个不男不女的老妖怪，我来*会会你！
    instruct_0();   --  0(0)::空语句(清屏)
	if JY.Person[0]["性别"] == 1 then
	say("小丫头，本教主对你没有恶意，你也要杀我！？既如此，本教主也不会手下留情！",27)
	else
	say("小子，本教主对你没有恶意，你也要杀我！？既如此，本教主也不会手下留情！",27)
	end
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(54,4,0,0) ==false then    --  6(6):战斗[54]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_3(-2,0,1,0,895,0,0,5910,5910,5910,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,1,0,895,0,0,5908,5908,5908,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,94,1,0,896,0,0,7218,7218,7218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [94]
    instruct_3(-2,86,0,0,0,0,0,7966,7966,7966,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,95,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [95]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3547,26,0);   --  1(1):[任我行]说: 东方不败，今日终於．．．*终於教你落在我手里．
    instruct_0();   --  0(0)::空语句(清屏)
	say("任教主，终究是．．是．．*终究是．．是我输了．！",27)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3549,26,0);   --  1(1):[任我行]说: 哈！哈！*你这大号，可得改一改罢？
    instruct_0();   --  0(0)::空语句(清屏)
	say("倘若单打独斗，*你们是不能打败我的．",27)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3551,26,0);   --  1(1):[任我行]说: 不错，你武功比我高，*我很是佩服．
    instruct_0();   --  0(0)::空语句(清屏)
	if JY.Person[0]["性别"] == 1 then
	say("你能这麽说，*足见男子汉大丈夫气概．**唉，小丫头，我对你三番五次手下留情，不想你....望你好自为之。。。",27)
	else
	say("你能这麽说，*足见男子汉大丈夫气概．**唉，小子，我对你三番五次手下留情，不想你....望你好自为之。。。",27)
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3553,26,0);   --  1(1):[任我行]说: 我现在不想杀你了，*我也找个地方安养你好了．**来人啊，把他带下去．
    instruct_0();   --  0(0)::空语句(清屏)
    say("你休想！呜。。呃。。。",27)
	say("！！！",0)
	say("死了也好，便宜你了。",26)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,86,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [86]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_2(93,1);   --  2(2):得到物品[葵花宝典][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3555,33,0);   --  1(1):[黑白子]说: 恭喜教主，今日诛却大逆．*从此我教在教主庇荫之下，*扬威四海．*教主千秋万载，一统江湖．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3695,26,0);   --  1(1):[任我行]说:  胡说八道！什麽千秋万载*？哈！哈！哈！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3696,35,0);   --  1(1):[令狐冲]说: ＜坐在这位子上的，是任我*行还是东方不败，却有什么*分别？＞*（盈盈，我……想离开这里*……）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3697,73,0);   --  1(1):[任盈盈]说: （冲哥，我知道你的心思。*如今东方不败已死，我也没*有留在黑木崖上的必要，我*们一起走吧，离开这里，找*一个没有人的地方，只有你*和我……）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3698,35,0);   --  1(1):[令狐冲]说: （好盈盈，你果然是我的知*己，我们这就悄悄走吧。）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,96,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [96]
    instruct_3(-2,97,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [97]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	if JY.Person[0]["性别"] == 1 then
	say("小丫头，这一役诛奸复位，*你实占首功．不如加入我日*月神教，我可以给你个副教*主做做，待我百年之后，这*教主的位置就是你的，如何*？",26)
	else
	say("小兄弟，这一役诛奸复位，*你实占首功．不如加入我日*月神教，我可以给你个副教*主做做，待我百年之后，这*教主的位置就是你的，如何*？",26)
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3699,0,1);   --  1(1):[AAA]说: 在下还要继续寻找十四天书*，加入神教之事万难从命。*还望任教主话复前言，告诉*我《笑傲江湖》一书的所在*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3700,26,0);   --  1(1):[任我行]说: 哼！就算你得到了十四天书*，你也未必当的成武林盟主*。当武林盟主要靠实力的！**《笑傲江湖》一书，就在*岳不群手上。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3701,0,1);   --  1(1):[AAA]说: 哦？此话当真？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3702,26,0);   --  1(1):[任我行]说: 当然是真的！《笑傲江湖》*一书一直在华山派，当年我*日月神教曾经为了此书，血*洗华山，不幸中了五岳剑派*的诡计，十长老尽数困死在*华山思过崖。此后《笑傲江*湖》一书便不知所踪。不过*经过老夫的明查暗访，终于*得知此书根本没离开过华山*派，就在岳不群手上。所谓*“不知所终”，不过是这个*伪君子散布的谣言罢了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3703,0,1);   --  1(1):[AAA]说: 多谢了，我这就上华山！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,35,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,16,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,1,0,889,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(57,1,1,0,913,0,0,5696,5696,5696,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,0,1,0,0,0,0,5694,5694,5694,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
    instruct_3(57,32,1,0,900,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
end

OEVENTLUA[895] = function()
    if MPPD(0) == 0 then
		if JY.Person[0]["性别"] == 1 then
	       say("小丫头，回心转意了吗？要*不要加入我日月神教？",26)
	    else
	       say("小兄弟，回心转意了吗？要*不要加入我日月神教？",26);
	    end
	if instruct_11(0,188) == true then
		say("还望任教主收留！",0); 
	    say("哈哈哈！好，从今天开始，你便是我神教副教主！",26); 
	    JoinMP(0,12,4)
		if GetS(111, 0, 0, 0) == 0 then
		        say("本教主高兴，现在就传你吸星大法的秘诀！",26); 
				if instruct_11(0,188) == true then
				     say("多谢任教主！",0) 
					 instruct_0();
	                 QZXS("领悟吸星大法！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,88)
				else
				     say("在下不敢贪图教主神功！",0) 
					 say("哈哈哈哈！！！",26); 
					 instruct_0()
				end	
			end	
	else
	    say("我没有这个打算！",0); 
	    say("哼，你可要想清楚了！",26); 
	end
		do return end
	end
	say("我日月神教将一统江湖！",26); 
end

OEVENTLUA[10013] = function() --西毒vs北丐支线
	if instruct_18(148) == false then
		do return end
	end
	if inteam(620) or hasteam(620) then
		do return end
	end
	instruct_14()
	instruct_3(-2,20,0,0,0,0,0,0,0,0,-2,-2,-2)
	instruct_3(-2,21,0,0,0,0,0,0,0,0,-2,-2,-2)
	instruct_3(-2,22,0,0,0,0,0,0,0,0,-2,-2,-2)
	instruct_3(-2,23,0,0,0,0,0,0,0,0,-2,-2,-2)
	instruct_3(-2,24,0,0,0,0,0,0,0,0,-2,-2,-2)
	instruct_3(-2,25,-2,-2,-2,-2,-2,3114*2,3114*2,3114*2,-2,-2,-2)
	instruct_3(-2,26,-2,-2,-2,-2,-2,3552*2,3552*2,3552*2,-2,-2,-2)
	instruct_13()
	instruct_0();	
	say("咦？前面的两个人是......") 
	instruct_25(27, 48, 25, 39)	
	instruct_0();	
	say("是西毒和北丐！他们好像在比拼兵器。北丐使的难道就是传说中的打狗棒法？棒法精妙，果然已臻武学绝诣。西毒回击的招数也是攻守兼备、威力凌厉。不愧为当世高人！") 
	instruct_0();	
	say("啊，他们两个好像开始比拼内力了？我该怎么做？") 		
	local path = 0
	if instruct_16(58) then
		path = 3
	elseif JY.Person[0]["品德"] >= 99 and GetS(2, 0, 0, 0) ~= 1 then
		if DrawStrBoxYesNo(-1, -1, "要帮助北丐吗？", C_WHITE, 30) == true then		
			path = 1
		else
			path = 3
		end
	elseif JY.Person[0]["品德"] <= 30 then
		if DrawStrBoxYesNo(-1, -1, "要帮助西毒吗？", C_WHITE, 30) == true then		
			path = 2
		else
			path = 3
		end	
	else
		path = 3
	end
	instruct_30(27, 48, 25, 39)	
	if path == 1 then
		instruct_0();	
		say("洪帮主，我来助你！欧阳锋看招！") 	
		instruct_0();	
		say("你是谁？？我是谁？？？欧阳锋是谁？？？？？",60,0,"欧阳锋") 	
		JY.Person[60]["攻击力"] = JY.Person[60]["攻击力"] + 100
		JY.Person[60]["防御力"] = JY.Person[60]["防御力"] + 100
		JY.Person[60]["轻功"] = JY.Person[60]["轻功"] + 150		
		if instruct_6(265,4,0,0) == false then --单挑西毒
			instruct_15(0);   
			instruct_0();  
			do return; end		
		end
		JY.Person[60]["攻击力"] = JY.Person[60]["攻击力"] - 100
		JY.Person[60]["防御力"] = JY.Person[60]["防御力"] - 100
		JY.Person[60]["轻功"] = JY.Person[60]["轻功"] - 150			
		instruct_3(-2,26,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		instruct_0();	
		say("跑得还真快。他好像掉了件东西......") 			
		instruct_0();	
		instruct_2(252, 1)
		instruct_0();	
		say("嘿，看这老毒物疯疯癫癫的，没想到却越疯约厉害。小子，老叫化从来不欠人人情。这打狗棒法本来是丐帮镇帮之宝，不过你在旁边看了这许久，以你小子的资质八成已经领悟了不少。看你品性不坏，我就把运劲诀窍也传给你吧。",69,0,"洪七公") 		
		instruct_0();	
		say("谢谢洪老前辈！") 		
		instruct_14()		
		instruct_13()
		instruct_2(167, 1)
		instruct_0();	
		say("哈哈哈！我去也！",69,0,"洪七公") 		
		instruct_14()		
		instruct_3(-2,25,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)
		instruct_13()		
	elseif path == 2 then
		instruct_37(-3)
		instruct_0();	
		say("欧阳前辈，我来助你！") 	
		JY.Person[69]["内力"] = math.modf(JY.Person[69]["内力最大值"] * 0.5)
		JY.Person[60]["内力"] = math.modf(JY.Person[60]["内力最大值"] * 0.5)
		if instruct_6(264,4,0,0) == false then 
			instruct_15(0);   
			instruct_0();  
			do return; end		
		end	
		instruct_3(-2,25,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)		
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景	
		instruct_0();	
		say("你是谁？？？我又是谁？？？",60,0,"欧阳锋") 			
		instruct_0();	
		say("（不会疯了吧，那我帮他岂不是没有好处）") 
		instruct_0();	
		say("（罢了，好事成双，我再打！）") 
		if instruct_6(265,4,0,0) == false then 
			instruct_15(0);   
			instruct_0();  
			do return; end		
		end	
		JY.Person[69]["内力"] = math.modf(JY.Person[69]["内力最大值"] * 1)
		JY.Person[60]["内力"] = math.modf(JY.Person[60]["内力最大值"] * 1)		
		instruct_3(-2,26,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)		
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景			
		instruct_2(251, 1)
		instruct_2(252, 1)
		instruct_0();
		if MPPD(0) == 8 and MPDJ(0) < 2 then
			JoinMP(0, 8, 2)
		end
		say("哈哈，终于拿到好处了！") 		
	else
		instruct_37(3)
		if instruct_16(58) then
			instruct_0();	
			say("义父和洪老前辈有危险！少侠，请帮我分开他们二人。",58,0,"杨过") 	
			instruct_0();	
			say("好！")
		else
			instruct_0();	
			say("两个人这样下去肯定会油尽灯枯，不行，我要想办法分开他们。")
		end
		JY.Person[60]["攻击力"] = JY.Person[60]["攻击力"] + 100
		JY.Person[60]["防御力"] = JY.Person[60]["防御力"] + 100
		JY.Person[60]["轻功"] = JY.Person[60]["轻功"] + 100			
		JY.Person[69]["攻击力"] = JY.Person[69]["攻击力"] + 100
		JY.Person[69]["防御力"] = JY.Person[69]["防御力"] + 100
		JY.Person[69]["轻功"] = JY.Person[69]["轻功"] + 100	
		if instruct_6(266,4,0,0) == false then --单挑西毒北丐
			instruct_15(0);   
			instruct_0();  
			do return; end		
		end	
		JY.Person[60]["攻击力"] = JY.Person[60]["攻击力"] - 100
		JY.Person[60]["防御力"] = JY.Person[60]["防御力"] - 100
		JY.Person[60]["轻功"] = JY.Person[60]["轻功"] - 100			
		JY.Person[69]["攻击力"] = JY.Person[69]["攻击力"] - 100
		JY.Person[69]["防御力"] = JY.Person[69]["防御力"] - 100
		JY.Person[69]["轻功"] = JY.Person[69]["轻功"] - 100			
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景		
		instruct_0();	
		say("哈哈！老毒物，欧阳锋！老叫化今日服了你啦。",69,0,"洪七公") 	
		instruct_0();	
		say("我是欧阳锋！我是欧阳锋！我是欧阳锋！你是老叫化洪七公！哈哈哈！",60,0,"欧阳锋") 	
		instruct_14()		
		instruct_3(-2,25,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)
		instruct_3(-2,26,-2,-2,-2,-2,-2,0,0,0,-2,-2,-2)
		instruct_13()				
		instruct_0();	
		say("唉，想这北丐西毒数十年来反覆恶斗，互不相下，岂知竟同时在华山绝顶归天。一笑泯恩仇。天意啊。")
		instruct_0();	
		instruct_2(252, 1)
		instruct_0();
		say("他们二人的绝学如果就这样失传实在可惜。待我把所领悟到的招式整理成篇，也好传承下去。")
		local word = ""
		if JY.Person[zj()]["资质"] > 50 then
			instruct_0();	
			instruct_2(167, 1)	
			if instruct_16(58) then
				JY.Person[58]["武功3"] = 80
				JY.Person[58]["武功等级3"] = 0
				word = "打狗棒法"
			end
		else
			instruct_0();	
			instruct_2(251, 1)
			if instruct_16(58) then
				JY.Person[58]["武功3"] = 120
				JY.Person[58]["武功等级3"] = 0
				word = "灵蛇杖法"
			end			
		end
		AddPersonAttrib(0, "攻击力", 10);
		AddPersonAttrib(0, "防御力", 10);
		AddPersonAttrib(0, "轻功", 10);
		instruct_0();
		QZXS(JY.Person[zj()]["姓名"].."攻防轻增加10点")			
		if instruct_16(58) then
			instruct_0();	
			say("......",58,0,"杨过") 	
			instruct_0();	
			say("杨大哥，你别太难过了，二老毕竟最后是笑着去的。")		
			instruct_0();	
			say("唉，甚么荣名，甚么威风，也不过是大梦一场罢了。",58,0,"杨过") 	
			JY.Person[58]["攻击力"] = JY.Person[58]["攻击力"] + 10
			JY.Person[58]["防御力"] = JY.Person[58]["防御力"] + 10
			JY.Person[58]["轻功"] = JY.Person[58]["轻功"] + 10	
			instruct_0();
			QZXS("杨过攻防轻增加10点，领悟"..word)	
		end
	end
end

OEVENTLUA[10014] = function() --药王庄事件
	if instruct_18(144) == false or instruct_18(145) == false or 
		instruct_16(1) == false or instruct_16(2) == false then
		do return end
	end
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_37(2)
	local pid = 9999;				
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[16][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "慕容景岳";
	JY.Person[pid]["生命最大值"] = 2500
	JY.Person[pid]["生命"] = 2500
	JY.Person[pid]["内力最大值"] = 5000
	JY.Person[pid]["内力"] = 5000
	JY.Person[pid]["防御力"] = 300
	JY.Person[pid]["攻击力"] = 250
	JY.Person[pid]["轻功"] = 250
	JY.Person[pid]["拳掌功夫"] = 100
	JY.Person[pid]["武功1"] = 21
	JY.Person[pid]["武功等级1"] = 999
	JY.Person[pid]["声望"] = 90	
	pid = 10000
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[17][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "薛鹊";
	JY.Person[pid]["生命最大值"] = 2500
	JY.Person[pid]["生命"] = 2500
	JY.Person[pid]["内力最大值"] = 5000
	JY.Person[pid]["内力"] = 5000
	JY.Person[pid]["防御力"] = 250
	JY.Person[pid]["攻击力"] = 250
	JY.Person[pid]["拳掌功夫"] = 100
	JY.Person[pid]["轻功"] = 300
	JY.Person[pid]["武功1"] = 21
	JY.Person[pid]["武功等级1"] = 999	
	JY.Person[pid]["声望"] = 90	
	pid = 10001
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[45][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "石万嗔";
	JY.Person[pid]["生命最大值"] = 2800
	JY.Person[pid]["生命"] = 2800
	JY.Person[pid]["内力最大值"] = 5500
	JY.Person[pid]["内力"] = 5500
	JY.Person[pid]["防御力"] = 350
	JY.Person[pid]["攻击力"] = 350
	JY.Person[pid]["轻功"] = 250
	JY.Person[pid]["拳掌功夫"] = 150
	JY.Person[pid]["武功1"] = 21
	JY.Person[pid]["武功等级1"] = 999	
	JY.Person[pid]["声望"] = 90		
	JY.Person[pid]["攻击带毒"] = 240	
	for i = 2, HHH_GAME_SETTING["WG_COUNT_MAX"] do
		for j = 9999, 10001 do
			JY.Person[j]["武功"..i] = 0
			JY.Person[j]["武功等级"..i] = 0
		end
	end
	SetS(49, 0, 0, 0, 1)
	instruct_0();	
	say("咦，等等！大家别动！",2,0,"程灵素") 
	instruct_0();	
	say("妹子，怎么了？",1,0,"胡斐") 	
	instruct_0();	
	say("我在门口的布置被人动过....难道有人入侵....",2,0,"程灵素") 	
	instruct_14()
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 5286, 5286, 5286, 0, 0, 0)
	instruct_13()
	instruct_0();	
	say("哈哈，师妹好眼力！",16,0,"慕容景岳") 	
	instruct_0();	
	say("妹子小心！",1,0,"胡斐") 	
	if instruct_6(267,4,0,0) == false then 
		instruct_15(0);   
		instruct_0();  
		do return; end		
	end		
	instruct_0();	
	SetS(49, 0, 0, 0, 2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 6416, 6416, 6416, 0, 0, 0)
	instruct_13()	
	instruct_0();	
	say("嘿嘿，好功夫！小丫头，你就是无嗔那贼秃的小徒弟？",624)  
	instruct_0();	
	say("程师妹，见了师叔怎不快磕头？",622) 	
	instruct_0();	
	say("咱们哪里钻出师叔来啦？没听见过。",2) 	
	instruct_0();	
	say("毒手神枭的名字听过没有？你师父难道从来不敢提我吗？",624)	
	instruct_0();	
	say("这名字倒听见过的。我师父说他从前确是有过一个师弟，只是他滥用毒药害人，不守门规，早给师祖逐出门墙了。石前辈，那便是你么？",2) 	
	instruct_0();	
	say("臭丫头，敬酒不吃吃罚酒！",624)	
	if WarMain(308) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	instruct_0();	
	SetS(49, 0, 0, 0, 3)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_21(1)
	instruct_21(2)
	instruct_13()		
	instruct_0();	
	say("大哥，小心！",2,0,"程灵素") 	
	instruct_14()	
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 5286, 5286, 5286, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 5290, 5290, 5290, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 6416, 6416, 6416, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 5436, 5436, 5436, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5166, 5166, 5166, 0, 0, 0)
	instruct_13()	
	instruct_0();	
	say("怎么两个人都跑掉了。不行，我得跟上去看看。") 
	instruct_14()
	instruct_19(15, 28)
	instruct_13()
	instruct_0();	
	say("啊！胡大哥，程姑娘她....？") 		
	instruct_0();	
	say("二妹....她为了救我....",1) 
	instruct_0();	
	say("嘿，哭什么。很快你们就能在下面团圆了。",624)		
	instruct_0();	
	say("（胡大哥心神不宁无法出战，只能挡一下了）想动手，先过我这一关！") 
	instruct_0();	
	say("着！",624)			
	instruct_0();	
	say("啊！") 	
	AddPersonAttrib(0, "中毒程度", 100)
	local path = 0
	if WarMain(308) == false then 
		--instruct_15(0);   
		--instruct_0();  
		--do return; end	
		path = 1
	end		
	instruct_0();	
	SetS(49, 0, 0, 0, 4)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_13()		
	instruct_0();	
	say("二妹！二妹！",1,0,"胡斐") 		
	instruct_0();	
	say("大哥....你累啦....快歇一歇吧....",2,0,"程灵素") 		
	instruct_0();	
	say("生死有命....你不必难过....",2,0,"程灵素") 	
	instruct_0();	
	say("以后大哥....要是找到了大嫂....要待她好....你不见她面时....天天要十七八遍....挂在心....",2,0,"程灵素") 	
	instruct_0();	
	say("二妹！",1,0,"胡斐") 
	
	if JY.Person[zj()]["医疗能力"] >= 240 and instruct_18(26) and path ~= 1 then
		instruct_32(26,-1)
		instruct_0();	
		say("（背包里还有莽牯朱蛤，罢了，死马当做活马医）胡大哥先别难过，让我来看看。") 	
		instruct_14()	
		instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 27, 0, 0, 0, 0, 0, 9290, 9290, 9290, 0, 0, 0)
		instruct_13()				
		instruct_0();	
		say("呼，成功了！") 		
		instruct_0();	
		say("妹子！妹子你怎么样！",1,0,"胡斐") 		
		instruct_0();	
		say("我，我好像做了一个梦....",2,0,"程灵素") 	
		instruct_0();	
		say("胡大哥，程姑娘身体刚刚恢复，先让她静养数天吧。") 	
		instruct_0();	
		say("啊，说得对，说得对。",1,0,"胡斐") 	
		instruct_14()	
		instruct_13()			
		instruct_0();	
		say("谢谢少侠救命之恩，我身体好多了。",2,0,"程灵素") 	
		if putong() == 7 and zj() == 0 then
			instruct_0();	
			say("程姑娘太客气了。只是没想到莽牯朱蛤这百毒之王，却也能起到以毒攻毒的活命作用。") 
			instruct_0();	
			say("先师深悔一生用毒太多，晚年致力研究以毒入医，医毒本源的道理。",2,0,"程灵素")			
			instruct_0();	
			say("俗话说，一草一木一石，知之而善用者为药，不知之而滥用者为毒。",2,0,"程灵素")
			instruct_0();	
			say("世人常说人参杀人无过，大黄救人无功。其实对症下药，即使大毒者如巴豆天仙子者，若用得其法，也能活人。",2,0,"程灵素")		
			instruct_0();	
			say("在下受教了。药王果然名不虚传，只可惜晚生了十年，无幸聆听大师的教诲。") 	
			instruct_0();	
			say("少侠精通医毒两道，若是先师在此，定会把少侠引为知己呢。",2,0,"程灵素")	
			instruct_0();
			QZXS(JY.Person[zj()]["姓名"].."领悟医毒同源之道")					
		end
		instruct_0();	
		say("耽误了小兄弟那么多天，真是心有愧疚。我们这便上路吧。",1,0,"胡斐") 	
		instruct_0();	
		say("好，两位请。") 		
		instruct_14()	
		instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_10(1)
		instruct_10(2)	
		instruct_13()	
		instruct_2(253,1)	
	else
		instruct_14()	
		instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(104, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_10(1)
		instruct_13()	
		if path ~= 1 then
			Cls()
			instruct_2(253,1)
			Cls()
			addHZ(5)
		end
		instruct_0();	
		say("胡大哥，请节哀....") 		
		instruct_0();	
		say("二妹....",1,0,"胡斐") 		
		instruct_14()	
		instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_13()				
	end	
end

OEVENTLUA[20003] = function()	--李莫愁离队事件
    say("李仙子，你先回小村，有需要时，我再去找你帮忙。");
    instruct_21(161);   --  21(15):离队
    --instruct_3(70,102,1,0,20004,0,0,9292,9292,9292,-2,-2,-2); 
	setteam(161, 1)
end

--70,103 新队友传信

OEVENTLUA[20004] = function()	--李莫愁小村
		MyTalk("有需要我帮忙的地方吗？", 161);
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,29) ==true then    --  9(9):是否要求加入?否则跳转到:Label1

        if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
            instruct_10(161);   
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            do return; end
        end    --:Label2

				MyTalk("你的队伍已满，我无法加入。", 161);
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
end


OEVENTLUA[20005] = function()
	local menu = {}
	local num = 1
	if JY.Person[0]["实战"] >= 500 and JY.Person[585]["等级"] < 30 and JY.Person[662]["等级"] == 30 then
		say("…………………………")
		say("…………………………",228,0,"小二")
		say("喂，您没事吧，连我都打？",228,0,"小二")
		CC.DYRW = 0
		CC.DYRW2 = 585
		if WarMain(341) then addHZ(107) addHZ(108) end
		JY.Person[585]["等级"] = 30
		say("…………………………")
		say("咋样，满意了吧，无敌了吧，空虚了吧？总有一天你也会像我一样，安安心心当个小二。",228,0,"小二")
		do return end
	end
	say("这是最新的服务，我们这里可以替您传信给朋友们，让他们立刻到您身边。",228,0,"小二") 	
	for i = 1, #TeamP do
		local pid = TeamP[i]
		menu[num] = {JY.Person[pid]["姓名"], nil, JY.Person[pid]["YES"], pid}
		num = num + 1
	end
	DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY, "要传信给哪位队友？", C_WHITE, CC.DefaultFont)
	local r2 = ShowMenu(menu,#menu,15,CC.MainSubMenuX,CC.MainSubMenuY+CC.SingleLineHeight,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);	
	if r2 <= 0 then
		do return end
	end
	local pid = menu[r2][4]
	if pid == 662 and JY.Person[662]["等级"] < 30 then --武骧金星：水镜四奇要求实战
		if T2SQ(zj()) then 
			say("您不就在这儿么，请别跟小的开玩笑了。",228,0,"小二") 	
			do return end
		end
		if JY.Person[0]["实战"] < 400 then
			say("水镜先生近日外出访友，请稍等数月吧。",228,0,"小二") 	
			do return end		
		end
		say("何事多愁频上楼，清宵冷月对影流。白雪冰河十年镜，为谁锁心独自囚。",565,0,"水镜四奇") 
		say("贵客远来，不亦说乎。未知有何见教？",565,0,"水镜四奇") 
		if DrawStrBoxYesNo(-1, -1, "是否与之过招？", C_WHITE, 30) == false then
			say("不敢打扰水镜先生，晚辈就此告退。") 
			do return end
		else
			say("晚辈久仰神州三绝大名，不自量力，特来请教。")
			say("切磋尚可，指教不敢，请。",565,0,"水镜四奇")
			CC.DYRW = 0
			CC.DYRW2 = 662
			if not WarMain(341) then
				say("多谢前辈指点。")
				say("后生可畏，好，好。",565,0,"水镜四奇")
				do return end
			else
				say("晚辈侥幸，多承前辈手下留情。")
				say("不愧是武林圣地的传人，也罢，我便随你走一遭，去见见南贤北丑两位老友吧。",565,0,"水镜四奇")
				addHZ(134)
				JY.Person[pid]["经验"] = 52000
				War_AddPersonLVUP(pid);  
				Cls()
			end
		end
	end
	if not instruct_20(20,0) then
		instruct_10(pid)
		tb(JY.Person[pid]["姓名"].."加入队伍")
		setteam(pid, 0)
	else
		say("您的队伍里没有位置了。",228,0,"小二") 	
	end
end

OEVENTLUA[20006] = function()
	say("阿青姑娘，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(614)
	setteam(614, 1)
end

OEVENTLUA[20007] = function()
	say("耶律兄弟，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(619)
	setteam(619, 1)
end

OEVENTLUA[20008] = function()
	say("杨公子，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(616)
	setteam(616, 1)
end

OEVENTLUA[20009] = function()
	say("欧阳前辈，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(620)
	setteam(620, 1)
end

OEVENTLUA[20010] = function()
	say("胡大侠，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(621)
	setteam(621, 1)
end

OEVENTLUA[20011] = function()
	say("苗大侠，请你先回家休息，有需要时，我再去找你帮忙。")
	instruct_21(3)
	setteam(3, 1)
end

OEVENTLUA[10015] = function() --神雕邪
	if instruct_18(153) and (instruct_16(58) or instruct_16(59)) then
	
	else
		do return end	
	end
	instruct_14()
	instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,23,0,0,0,0,0,7172,7172,7172,0,0,0)
	instruct_3(-2,24,0,0,0,0,0,9292,9292,9292,0,0,0)
	instruct_13()
	instruct_0();	
	say("咦，前面有打斗声。快点过去看看。") 
	instruct_14()
	instruct_19(35, 28)
	instruct_13()
	instruct_0();	
	say("李道友，这情花之毒的解药配置方法，天下除我之外再无第二人知晓。",96,0,"公孙止") 	
	instruct_0();	
	say("只要你依了我，这绝情谷里面的东西，便什么都是你的了。",96,0,"公孙止") 	
	instruct_0();
	TalkEx("李莫愁心地狠毒，用情却是极专，她一生恶孽，便是因情之一字而来，听公孙止言语越来越不庄重，心下恼火。却故意美目顾盼，巧笑嫣然。",0,2)
	instruct_0();	
	TalkEx("公孙止把持不住，正待上前....",0,2)
	instruct_0();	
	say("着！",161,0,"李莫愁") 	
	instruct_0();	
	say("啊！！好你个毒妇！！",96,0,"公孙止") 
	if instruct_16(58) then
		instruct_0();	
		say("师伯小心！",58,0,"杨过") 	
	elseif instruct_16(59) then
		instruct_0();	
		say("师姊小心！",59,0,"小龙女") 
	end
	local pid = 9999;				
	JY.Person[pid] = {};
	for i=1, #PSX-8 do
		JY.Person[pid][PSX[i]] = JY.Person[96][PSX[i]];
	end
	JY.Person[pid]["姓名"] = "公孙止";
	JY.Person[pid]["生命最大值"] = 2800
	JY.Person[pid]["生命"] = 2800
	JY.Person[pid]["内力最大值"] = 6000
	JY.Person[pid]["内力"] = 6000
	JY.Person[pid]["防御力"] = 500
	JY.Person[pid]["攻击力"] = 450
	JY.Person[pid]["轻功"] = 250
	JY.Person[pid]["特殊兵器"] = 150
	JY.Person[pid]["武功1"] = 77
	JY.Person[pid]["武功等级1"] = 999
	JY.Person[pid]["声望"] = 97	
	JY.Person[pid]["左右互搏"] = 1	
	JY.Person[pid]["资质"] = 20
	for i = 2, HHH_GAME_SETTING["WG_COUNT_MAX"] do
		JY.Person[pid]["武功"..i] = 0
		JY.Person[pid]["武功等级"..i] = 0
	end
	if instruct_6(268,4,0,0) == false then 
		instruct_15(0);   
		instruct_0();  
		do return; end		
	end		
	instruct_0();	
	instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0)
	instruct_13()
	if instruct_16(58) then
		instruct_0();	
		say("哼，我不需要你这臭小子来救我！你那个不守门规的师父呢？",161,0,"李莫愁") 	
		instruct_0();	
		say("龙儿她....她已经去了....",58,0,"杨过") 
		instruct_0();	
		say("死了？哈哈！死得好！死了一了百了，独留你一个人在世上孤独半生。死得好啊！",161,0,"李莫愁") 
		instruct_0();	
		say("住口！龙儿为救我而死，你却是为情所困虽生犹死。我二人好歹也有几年幸福时光，你却要抱着那首雁丘词郁郁此生！",58,0,"杨过") 	
		instruct_0();	
		say("当年那个美貌温柔的好女子，如今却成了人人痛恨的赤炼魔头。师伯啊师伯，你可曾有后悔过。",58,0,"杨过") 	
		instruct_0();	
		say("你！哼！",161,0,"李莫愁") 
		instruct_14()
		instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0)
		instruct_13()
		instruct_0();	
		say("啊，她身上的情花之毒还未解，怎么就走了。") 		
		instruct_0();	
		say("罢了，各人有各人的缘法。兄弟，我们也走吧。",58,0,"杨过") 			
	else
		instruct_0();	
		say("你怎么来了？杨过那小子呢？",161,0,"李莫愁") 	
		instruct_0();	
		say("他....他已经去了....",59,0,"小龙女") 		
		instruct_0();	
		say("死了？哈哈！死得好！死了一了百了，独留你一个人在世上孤独半生。死得好啊！",161,0,"李莫愁") 
		instruct_0();	
		say("师姊....你曾对我说过，我们做女子的，一生最有福气之事，是有个真心的郎君。",59,0,"小龙女") 	
		instruct_0();	
		say("他是为了救我而死，虽然天人两隔，但我心中....却是永远念着他的....",59,0,"小龙女") 	
		instruct_0();	
		say("....哼！",161,0,"李莫愁") 	
		instruct_14()
		instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0)
		instruct_13()
		instruct_0();	
		say("啊，她身上的情花之毒还未解，怎么就走了。") 		
		instruct_0();	
		say("师姊性格偏激，希望不要出事才好。我们到处找找吧。",59,0,"小龙女") 	
		instruct_0();	
		say("好。") 			
	end	
	SetS(10, 20, 29, 3, 99)
	
	instruct_3(10,44,0,0,0,0,10016,0,0,0,0,0,0)
	instruct_3(10,46,0,0,0,0,10016,0,0,0,0,0,0)
	instruct_3(10,47,0,0,0,0,10016,0,0,0,0,0,0)
	setRW(104, 1)
end

OEVENTLUA[10016] = function() --神雕邪part2
	if instruct_16(63) and (instruct_16(58) or instruct_16(59)) then
	
	else
		do return end	
	end
	instruct_14()
	instruct_3(10,99,0,0,0,0,0,7174,7174,7174,0,0,0)
	instruct_3(10,44,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(10,46,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(10,47,0,0,0,0,0,0,0,0,0,0,0)
	instruct_13()
	instruct_0();	
	say("前面那个人是....李莫愁？") 	
	instruct_0();	
	say("啊啊啊！！！",161,0,"李莫愁") 
	instruct_0();
	TalkEx("李莫愁受了情花之刺，先前还仗真气护身，花毒一时不致发作。如今毒素行遍全身，真气涣散，花毒越发越猛。隐隐进入了疯魔状态。",0,2)	
	instruct_0();	
	if instruct_16(58) then
		instruct_0();	
		say("小心！",58,0,"杨过") 	
	elseif instruct_16(59) then
		instruct_0();	
		say("小心！",59,0,"小龙女") 
	end	
	JY.Person[161]["攻击力"] = JY.Person[161]["攻击力"] + 200
	JY.Person[161]["轻功"] = JY.Person[161]["轻功"] + 150
	JY.Person[161]["防御力"] = JY.Person[161]["防御力"] + 150	
	if instruct_6(269,4,0,0) == false then 
		instruct_15(0);   
		instruct_0();  
		do return; end		
	end			
	JY.Person[161]["攻击力"] = JY.Person[161]["攻击力"] - 200
	JY.Person[161]["轻功"] = JY.Person[161]["轻功"] - 150
	JY.Person[161]["防御力"] = JY.Person[161]["防御力"] - 150	
	instruct_0()
	instruct_13()
	instruct_0();
	TalkEx("李莫愁一生倨傲，从不向人示弱，但这时心中酸苦，身上剧痛。再也忍耐不住，突然间双臂一振，猛向程英手中所持长剑撞去。",0,2)	
	instruct_0();
	TalkEx("程英无日不在想替姨父全家报仇，但忽地见她向自己剑尖上撞来，出其不意，吃了一惊，自然而然的缩剑相避。",0,2)	
	instruct_0();
	TalkEx("李莫愁撞了个空，直往地上跌去。花毒发作起来，痛苦的翻滚嘶叫着，众人无不恻然。",0,2)	
	instruct_0();	
	say("少侠..请你想个法子，救救她吧。",63,0,"程英") 
	instruct_0();	
	say("（程姑娘心地善良，竟愿开口为仇人求助，我怎能袖手旁观）我记得那日为杨大哥采来的绝情草还剩下几棵....") 	
	instruct_14()
	instruct_37(2)
	instruct_13()
	instruct_0();	
	say("呃......",161,0,"李莫愁") 
	instruct_0();	
	say("行了，应该没有大碍。") 	
	instruct_0();	
	say("谁要你们救我的。",161,0,"李莫愁") 	
	instruct_0();	
	say("李仙子，这从生到死再到生的转了几圈，你还不肯放下执念吗？") 	
	instruct_0();	
	say("由爱故生忧，由爱故生怖。若离于爱者，无忧亦无怖。") 
	instruct_0();	
	say("你便如这情花，伤人亦自伤。其实恩爱也罢，不是恩爱也罢，总都是“无常难得久”。若能放下了便是海阔天空。") 	
	instruct_0();	
	say("......",161,0,"李莫愁") 	
	if instruct_16(58) then
		instruct_0();	
		say("师伯，龙儿这一去，我亦觉得两世为人。能为心爱的人郁郁一生我心甘情愿，但为一个负心人含恨终老，你认为值得吗？？",58,0,"杨过") 			
	elseif instruct_16(59) then
		instruct_0();	
		say("师姊，记得你还跟我说过，男人家变了心，你便用一千匹马也拉不回来。就算你把钢刀架在他头颈里，逼得他回到你身边，他虚情假意，跟你花言巧语的再骗你一阵，你又有什么味道？",59,0,"小龙女") 
		instruct_0();	
		say("你为他自叹自唉，他又哪里会怜惜半分了。",59,0,"小龙女") 
	end		
	instruct_0();	
	say("......罢了，你们要怎么样。",161,0,"李莫愁") 	
	instruct_0();	
	say("来小村吧，愿李仙子能从此放下一切，重新为人。") 		
	instruct_0();	
	say("......好，我这就去小村。",161,0,"李莫愁") 	
	instruct_14()
	instruct_3(10,99,0,0,0,0,0,0,0,0,0,0,0)
	--SetS(70,30,23,3,102)
	--instruct_3(70,102,1,0,20004,0,0,9292,9292,9292,-2,-2,-2); 
	setteam(161, 1)
	instruct_13()
	instruct_0();	
	say("程姑娘....") 	
	instruct_0();	
	say("少侠放心，我没事。只盼她真的可以改过自新。",63,0,"程英") 
	instruct_0();	
	say("唉，其实她也是个可怜的人....我多少可以理解她的心境....",63,0,"程英") 
	instruct_0();	
	say("啊？") 	
	instruct_0();	
	say("啊，没事，我们继续上路吧。",63,0,"程英")
	if MPPD(0) == 3 then
		instruct_0();
		if instruct_16(58) then 
			say("少侠为我夫妻二人辛苦奔忙，这里是我派武功的一些心得，请少侠收下吧。", 58)
		elseif instruct_16(59) then
			say("少侠为我夫妻二人辛苦奔忙，这里是我派武功的一些心得，请少侠收下吧。", 59)
		end
		JoinMP(0, 3, 2)
	end
	if putong() == 6 then
		instruct_0();
		TalkEx(JY.Person[zj()]["姓名"].."见她娇脸凝脂，眉黛鬓青，想象她这些年来香闺寂寞，相思难遣，不禁暗暗为她难过。",0,2)	
		instruct_0();	
		say("唉，我自以为持圣仁之道便能无敌于天下。却不知，太上忘情，最下不及情，情之所钟，正在吾辈。这情之一物，千古年来，又有几人能够参透？") 			
		QZXS(JY.Person[zj()]["姓名"].."领悟以情入圣之道！")
	end
	SetS(22, 0, 0, 0, 5)
end

OEVENTLUA[10017] = function() --神雕正
	if instruct_18(153) and instruct_16(63) and (instruct_16(78) or instruct_16(56)) then
	
	else
		do return end	
	end
	instruct_14()
	instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(-2,24,0,0,0,0,0,9292,9292,9292,0,0,0)
	instruct_13()
	instruct_0();	
	say("咦，前面突然传来一阵歌声，过去看看。") 
	instruct_14()
	instruct_19(35, 28)
	instruct_13()
	instruct_0();	
	say("问世间，情是何物，直教生死相许？天南地北双飞客，老翅几回寒暑？欢乐趣，离别苦，就中更有痴儿女。君应有语，渺万里层云，千山暮雪，只影向谁去？",161,0,"李莫愁") 	
	instruct_0();	
	say("李莫愁！陆家上上下下数十口人命，你可还记得！",63,0,"程英") 	
	instruct_0();	
	say("哼，小丫头，我不去找你，你倒找上门来了。接招！",161,0,"李莫愁") 	
	if instruct_16(56) then
		instruct_0();	
		say("师妹小心！",56,0,"黄蓉") 	
	elseif instruct_16(78) then
		instruct_0();	
		say("师妹小心！",78,0,"梅超风") 
	end
	JY.Person[161]["攻击力"] = JY.Person[161]["攻击力"] + 200
	JY.Person[161]["轻功"] = JY.Person[161]["轻功"] + 200
	JY.Person[161]["防御力"] = JY.Person[161]["防御力"] + 200	
	if instruct_6(268,4,0,0) == false then 
		instruct_15(0);   
		instruct_0();  
		do return; end		
	end		
	instruct_0();	
	instruct_13()
	instruct_0();	
	say("嘿，桃花岛门人恃众为胜，果然了得。",161,0,"李莫愁") 		
	instruct_0();	
	say("且慢。你说桃花岛武功不过如此，那就错了。我听他说过一路玉箫剑法，尽可破得你的拂尘功夫......") 	
	instruct_0();
	TalkEx(JY.Person[zj()]["姓名"].."边画边说，每一句话都入情入理，所说的功夫每一项均巧妙无比。只把李莫愁听得脸如土色。",0,2)	
	instruct_0();	
	say("罢了，罢了！",161,0,"李莫愁") 		
	instruct_14()
	instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0)
	instruct_13()	
	local word
	if instruct_16(56) then
		instruct_0();	
		say("嘿，好口才。竟然能把李莫愁吓走，你也足以自豪了。",56,0,"黄蓉") 
		AddPersonAttrib(56, "攻击力", 10);
		AddPersonAttrib(56, "防御力", 10);
		AddPersonAttrib(56, "轻功", 10);		
		word = "黄蓉"
	elseif instruct_16(78) then
		instruct_0();	
		say("嘿，好口才。竟然能把李莫愁吓走，你也足以自豪了。",78,0,"梅超风") 
		word = "梅超风"
		AddPersonAttrib(78, "攻击力", 10);
		AddPersonAttrib(78, "防御力", 10);
		AddPersonAttrib(78, "轻功", 10);			
	end	
	instruct_0();	
	say("少侠这一番见解，真是令人豁然开窍。",63,0,"程英") 		
	instruct_0();	
	say("两位见笑了。桃花岛武学确有过人之处。假以时日，两位必能成为一代宗师。") 	
	AddPersonAttrib(63, "攻击力", 10);
	AddPersonAttrib(63, "防御力", 10);
	AddPersonAttrib(63, "轻功", 10);
	QZXS("程英和"..word.."攻防轻加10点");
	
	SetS(10, 20, 29, 3, 99)
	instruct_3(10,44,0,0,0,0,10018,0,0,0,0,0,0)
	instruct_3(10,46,0,0,0,0,10018,0,0,0,0,0,0)
	instruct_3(10,47,0,0,0,0,10018,0,0,0,0,0,0)
	setRW(104, 1)
end

OEVENTLUA[10018] = function() --神雕正part2
	if instruct_16(58) and instruct_16(59) then
	
	else
		do return end	
	end
	instruct_14()
	instruct_3(10,99,0,0,0,0,0,7174,7174,7174,0,0,0)
	instruct_3(10,44,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(10,46,0,0,0,0,0,0,0,0,0,0,0)
	instruct_3(10,47,0,0,0,0,0,0,0,0,0,0,0)
	instruct_13()
	instruct_0();	
	say("前面那个人是....李莫愁？") 	
	instruct_0();	
	say("师姊，你怎么在这里？",59,0,"小龙女") 
	instruct_0();	
	say("是你们？把玉女心经交出来！",161,0,"李莫愁") 
	instruct_0();	
	say("龙儿小心！",58,0,"杨过") 	
	if instruct_6(270,4,0,0) == false then 
		instruct_15(0);   
		instruct_0();  
		do return; end		
	end			
	JY.Person[161]["攻击力"] = JY.Person[161]["攻击力"] - 200
	JY.Person[161]["轻功"] = JY.Person[161]["轻功"] - 200
	JY.Person[161]["防御力"] = JY.Person[161]["防御力"] - 200	
	instruct_0()
	instruct_13()
	instruct_0();	
	say("这就是玉女心经上的武功？哼，为何师父如此偏心，只传你不传我！",161,0,"李莫愁") 	
	instruct_0();	
	say("师姊....其实这玉女心经，给了你也是无用。",59,0,"小龙女") 
	instruct_0();	
	say("为什么？",161,0,"李莫愁") 	
	instruct_0();
	TalkEx("小龙女回头看了杨过一眼，甜蜜一笑，接着从怀里掏出一本书，向李莫愁掷去。",0,2)	
	instruct_0();	
	say("〈将玉女心经急急阅毕，一脸茫然〉原来是这样....竟然是这样....『若非二人互持，时时关切，小则重病，大则丧身』",161,0,"李莫愁") 		
	instruct_0();
	TalkEx("李莫愁蓦地里伤痛难禁，遥遥望见杨过和小龙女并肩而立，一个是英俊潇洒的美少年，一个是娇柔婀娜的俏姑娘，眼睛一花，模模糊糊的竟看到是自己刻骨相思的意中人陆展元，另一个却是他的妻子何沅君。",0,2)		
	instruct_0();
	TalkEx("突然纵声而歌，音调凄婉，转头便走，霎时之间，身形已在山后隐没，只剩下余音绕梁。",0,2)
	addHZ(119)
	instruct_14()
	instruct_3(10,99,0,0,0,0,0,0,0,0,0,0,0)
	instruct_13()	
	if putong() == 6 then
		instruct_0();
		instruct_0();	
		say("唉，当年娇俏温柔的小姑娘，今日七分癫狂的赤炼魔头。叹世间情为何物。") 			
		instruct_0();	
		say("我自以为持圣仁之道便能无敌于天下。却不知，太上忘情，最下不及情，情之所钟，正在吾辈。这情之一物，千古年来，又有几人能够参透？") 			
		QZXS(JY.Person[zj()]["姓名"].."领悟以情入圣之道！")
		addHZ(103)
	end	
	instruct_0();	
	say("过儿，我们虽经这重重波折，但最后....还是能在一起了。",59,0,"小龙女") 
	instruct_0();
	TalkEx("小龙女满脸红晕，依偎在杨过怀中。杨过只是微笑着看着她，不禁把她的手握得更紧了些。",0,2)	
	instruct_0();	
	say("我二人能有今日，都是多得兄弟相助。这本书我留着也无用，就送给兄弟了。",58,0,"杨过") 	
	instruct_0();	
	say("谢谢杨大哥。") 	
	instruct_0();
	if MPPD(0) == 3 then JoinMP(0, 3, 2) end	
	instruct_2(254, 1)
	SetS(22, 0, 0, 0, 5)
end

OEVENTLUA[10019] = function() --河洛客栈小二打传闻
	if T9ZY(0) and instruct_18(255) == false and JY.GOLD >= 1888 and juexing() >= 2 then
		instruct_0()
		say("啊啊，客官您真面善。怎么好像在哪里见过您？",220,0,"神秘小二") 	
		instruct_0()
		say("啊啊啊，我想起来了。原来您就是那位七进七出耐力持久的赵爷啊。",220,0,"神秘小二") 	
		instruct_0()
		say("您能不能跟我说说陈某会怎样安排您在长坂坡出场啊？",220,0,"神秘小二") 	
		instruct_0()
		say("什么什么？您不懂我在说啥？好吧，貌似我还真的有点穿越了。",220,0,"神秘小二") 		
		instruct_0()
		say("哎呀我们回归正题吧。我家有一把家传的枪，那简直就是为赵爷您量身订造的啊。",220,0,"神秘小二") 		
		instruct_0()
		say("看在您这么英明神武的份上，只要您1888大元？成不？",220,0,"神秘小二") 		
		if DrawStrBoxYesNo(-1, -1, "要买吗？", C_WHITE, 30) == true then	
			instruct_0()
			say("赵爷您真是有眼光！",220,0,"神秘小二") 					
			instruct_2(174, -1888)
			instruct_2(255, 1)
			instruct_0()
			say("赵爷您慢走哎。",220,0,"神秘小二") 	
			instruct_0()
			say("..........") 				
		end
		do return end
	end
	instruct_0()
	local pid, eid = -1
	local number = math.random(2, 3)
	say("这里是河洛江湖传闻小站，一切皆有可能，本客栈概不负责任。",220,0,"传闻站") 	
	Cls()
	if GetS(106, 63, 20, 0) >= math.modf(6 + 5 * tianshu()) then
		say("最近暂时没有什么传闻，过段时间再来吧。",220,0,"传闻站") 	
		do return end
	end	
	local event = math.random(#CC.battlee)
	say(CC.battlee[event][4],220,0,"传闻站") 
	Cls()
	if not inteam(CC.battlee[event][2]) then
		do return end
	end
	say("咦？难道你就是传闻中的人？",220,0,"传闻站") 	
	Cls()
	if DrawStrBoxYesNo(-1, -1, "要接受吗？", C_WHITE, 30) == false then		
		say("对不起，原来我看错了。",220,0,"传闻站") 	
		do return end
	end		
	SetS(106, 63, 21, 0, CC.battlee[event][1])
	SetS(106, 63, 20, 0, GetS(106, 63, 20, 0) + 1)
	
	pid = CC.battlee[event][2]
	eid = CC.battlee[event][3]
	local tmp1 = JY.Person[eid]["攻击力"] 	
	local tmp2 = JY.Person[eid]["轻功"]
	local tmp3 = JY.Person[eid]["防御力"]	
	
	JY.Person[eid]["攻击力"] = math.modf(JY.Person[pid]["攻击力"] * 0.7) + math.random(100)
	JY.Person[eid]["轻功"] = math.modf(JY.Person[pid]["轻功"] * 0.6) + 50
	JY.Person[eid]["防御力"] = math.modf(JY.Person[pid]["防御力"] * 0.7) + math.random(100)
	
	if WarMain(364) == false then
		Cls()
		JY.Person[eid]["攻击力"] = tmp1
		JY.Person[eid]["轻功"] = tmp2
		JY.Person[eid]["防御力"] = tmp3
		light()
		say("看来你修行还不够啊....",220,0,"传闻站") 	
		for i = 1, number do
			local str = math.random(2, 7)
			str = conversion(str)
			QZXS(changeattrib(pid, str, 2))
		end
		do return end
	end
	Cls()
	JY.Person[eid]["攻击力"] = tmp1
	JY.Person[eid]["轻功"] = tmp2
	JY.Person[eid]["防御力"] = tmp3	
	light()
	for i = 1, number + 1 do
		local str = math.random(2, 7)
		str = conversion(str)
		QZXS(changeattrib(pid, str, 1))
	end	
	Cls()
	say("恭喜你顺利解决了传闻。",220,0,"传闻站") 			
end

OEVENTLUA[314] = function() --武当入门
    OEVENTLUA[31020]()
end

OEVENTLUA[600] = function() --擂鼓山
    instruct_27(3,6342,6348) --显示动画(图1,图2,图3)
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2623,115,0); --[115苏星河]:逍遥派不肖弟子苏星河，拜*见本派新任掌门．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2624,49,1); --[49虚竹]:老前辈行此大礼，*可折杀小僧了．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2625,115,0); --[115苏星河]:师弟，你是我师父的关门弟*子，又是本派掌门．我虽是*师兄，却也要向你磕头！
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2626,49,1); --[49虚竹]:这个．．这个．．．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2627,115,0); --[115苏星河]:师弟，你真是福泽深厚．我*和丁春秋想这宝石指环，想*了几十年，始终都无法到手*，你却在一个时辰之内，便*受到师父的垂青．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2628,49,1); -- [49虚竹]:前辈拿去便是．这只指环，*小僧半点用处也没有．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2629,115,0) --[115苏星河]:师弟，你受师父临死时的重*托，岂能推卸责任？**师父将指环交给你，是叫你*除灭丁春秋那厮，是不是？
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2630,49,1); -- [49虚竹]:正是．但小僧功行浅薄，*怎能当此重任？
	instruct_0();   --  0(0)::空语句(清屏)
	if cxzj() == 49 then 
	Cls()
	say("丁春秋如今正在星宿海为恶一方,还望师弟能给师傅报仇。",115,0,"苏星河")
	Cls()
	say("师，师兄，我会帮师父和你报仇的。")	
	Cls()
	say("多谢掌门。我还有八个弟子散落各地，我准备出游一趟，把他们找回来重建逍遥派。",115,0,"苏星河")	
	Cls()
	say("那就有劳师兄了。")	
	instruct_2(105,1); --[49虚竹]得到物品[105天山六阳掌]数量[1]
	instruct_2(75,1); --[49虚竹]得到物品[75小无相功]数量[1]
	instruct_2(200,1); --[49虚竹]得到物品[200七宝指环]数量[1]	
	instruct_45(zj(),20) --[49虚竹]增加轻功20
	instruct_46(zj(),3000)--[49虚竹]增加内力3000
	instruct_47(zj(),60)--[49虚竹]增加武功60
	instruct_48(zj(),200)--[49虚竹]增加生命200
	instruct_35(zj(),0,8,0) --设置[49虚竹]武功[0]为[8天山六阳掌]经验为0
	instruct_35(zj(),1,98,0)--设置[49虚竹]武功[1]为[98小无相功]经验为0
	instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,2,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,0,1,0,601,0,0,6340,6340,6340,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_2(247,1); --得到物品[247逍遥神仙环]1个
	instruct_0();
	instruct_34(zj(),10);
	instruct_0();
	else
	instruct_1(2631,0,1); --[0资]:苏前辈，这是怎麽回事？
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2632,115,0) --[115苏星河]:事情是这样子的．本派乃逍*遥派，师父收了我和丁春秋*两个弟子．我师父有个规矩*，因他所学甚杂，谁要做掌*门，各种本事都要比试，不*但比武，还　得比琴棋书画*．但丁春秋於各种杂学一窍*不通，眼见掌门人无望，竟*忽施暗算将师父打落深谷，*又将我打得重伤．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2633,0,1); --[0资]:这人真是可恶．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2634,115,0) --[115苏星河]:后来师父趁机诈死，*又设下了这个棋局，*想藉此找出悟性高的人．*立他为掌门，并传他功力，*将来好除去丁春秋这恶贼．**今天，我们终於出现了能破*解此珍珑的人，师父在传完*他功力后也仙逝了．*掌门师弟，我逍遥派的门户*就靠你清理了．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2635,49,1); -- [49虚竹]:我是误打误撞的，并没有什*麽悟性．更何况我是少林弟*子，怎能改投别派．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2636,0,1); --[0资]:贤弟，这位老前辈因为要传*你毕生功力而逝去，你还忍*心拒绝人家吗．况且，那丁*春秋也是个无恶不作，罪无*可赦的恶徒呀．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2637,49,1); --[49虚竹]:．．．．．．．
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2638,0,1); --[0资]:好，我看就这样了．*苏前辈，我们会去找那星宿*老怪，杀了他替你师父报仇
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2639,115,0)--[115苏星河]:老朽谢谢这位少侠的帮忙．***掌门师弟，此去路上一切要*小心，丁春秋那老贼行事卑*鄙．．．．*对了，我有一个徒弟医术高*明，人称”阎王敌”的薛神*医，你可以去找他帮忙．*见到他时只要出示掌门信物*的”七宝指环”即可．
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,2,1,0,602,0,0,6522,6522,6522,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,0,1,0,601,0,0,6340,6340,6340,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_41(49,105,1); --[49虚竹]得到物品[105天山六阳掌]数量[1]
	instruct_41(49,75,1); --[49虚竹]得到物品[75小无相功]数量[1]
	instruct_41(49,200,1); --[49虚竹]得到物品[200七宝指环]数量[1]
	instruct_45(49,20) --[49虚竹]增加轻功20
	instruct_46(49,3000)--[49虚竹]增加内力3000
	instruct_47(49,60)--[49虚竹]增加武功60
	instruct_48(49,200)--[49虚竹]增加生命200
	instruct_35(49,0,8,0) --设置[49虚竹]武功[0]为[8天山六阳掌]经验为0
	instruct_35(49,1,98,0)--设置[49虚竹]武功[1]为[98小无相功]经验为0
	instruct_2(247,1); --得到物品[247逍遥神仙环]1个
	instruct_0();
	instruct_34(49,10);
	instruct_0();
			do return end
	end
	instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();
	instruct_0();
end

OEVENTLUA[630] = function()
    instruct_1(2679,0,1); -- [0资]:啊，原来是这样啊……
	instruct_0();
	instruct_2(79,1); --得到物品[79八荒六合功]1个
	instruct_0();
				if GetS(111, 0, 0, 0) == 0 then
				say("咦这是？？？",0) 
			    SetS(106, 63, 1, 0, 0)
                SetS(106, 63, 2, 0, 117)
				--if WarMain(288) == false then
				--say("真是可惜",0) 
				--else
				say("原来如此",0) 
	            QZXS("领悟八荒六合！")
	            instruct_0();
	            SetS(111, 0, 0, 0,101)
				--end
                end
	instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);
	if cxzj() == 49 then
	   instruct_33(zj(),101,0)--[49虚竹]学会[101八荒六合功]
	   instruct_0();
	   instruct_34(zj(),10);--[49虚竹]增加资质[10]
	   instruct_0();
	   if instruct_16(53,0,16) == true then
	      instruct_1(4384,53,0) --[53段誉]:二哥，这套武功原来是这样运行啊。
	      instruct_0();
		  instruct_1(4385,49,0) --[49虚竹]:对了，三弟，你学过北冥神功吧，那这套武功你应该很容易学会。
	      instruct_0();
		  instruct_33(53,101,0)--[53段誉]学会[101八荒六合功]
	    end 
        do return end
    end
	if instruct_16(49) then
	   instruct_33(49,101,0)--[49虚竹]学会[101八荒六合功]
	   instruct_0();
	   instruct_34(49,10);--[49虚竹]增加资质[10]
	   instruct_0();
	   if instruct_16(53,0,16) == true then
	      instruct_1(4384,53,0) --[53段誉]:二哥，这套武功原来是这样运行啊。
	      instruct_0();
		  instruct_1(4385,49,0) --[49虚竹]:对了，三弟，你学过北冥神功吧，那这套武功你应该很容易学会。
	      instruct_0();
		  instruct_33(53,101,0)--[53段誉]学会[101八荒六合功]
	    end 
        do return end
    end	
end

OEVENTLUA[598] = function()
    instruct_1(2591,49,1); --[49虚竹]:佛祖啊，我找不到回少林的*路了，请您指引我一条明路*吧。
	instruct_0(); 
	    if instruct_9(2,0) == false then 
			do return end
	    end
	instruct_0();	
	instruct_1(2592,0,1); --[0资]:小和尚，不如我送你回少林*吧。
	instruct_0();
	instruct_1(2593,49,1);--[49虚竹]:哇哇哇，佛祖显灵了……
	instruct_0();
	    if instruct_28(0,75,999,7,0) == false then 
		   instruct_1(2594,49,1); --[49虚竹]:施主眼中充满戾气，恐入魔*道，小僧知道，这一定是佛*祖对我的考验，阿弥陀佛，*小僧不能与你同行。
	       instruct_0();
			do return end
	    end
		    if instruct_20(20,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
			instruct_1(2595,49,1); --[49虚竹]:师傅说的没错，佛祖真是灵*验啊，阿弥陀佛。
			instruct_0();
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,15,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
			instruct_3(-2,2,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
			instruct_3(28,38,1,0,0,0,0,2286,2286,2286,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
			if cxzj() ~= 49 then
			instruct_10(49);
			else
			for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do
			JY.Person[zj()]["武功"..i] = JY.Person[49]["武功"..i]
			end
			end
                do return; end
            end
	instruct_1(2596,49,1); --[49虚竹]:阿弥陀佛，你队伍已满，我无法加入。
	instruct_0();
	instruct_1(2597,0,1); --[0资]:那你就去小村等我吧
	instruct_0();
	instruct_1(2598,49,1); --[49虚竹]:阿弥陀佛，小僧不知道去小*村的路。
	instruct_0();
end

OEVENTLUA[599] = function() --擂鼓山
    instruct_1(2600,0,1);   --  1(1):[AAA]说: 老先生，怎麽一个人坐在这*下棋，这棋一个人下的起来*吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2601,115,0);   --  1(1):[???]说: 小兄弟，难道你对我这"珍*珑"也有兴趣？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2602,0,1);   --  1(1):[AAA]说: "珍珑"？这盘局很难解吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2603,115,0);   --  1(1):[???]说: 这个珍珑棋局乃先师所设。*先师当年穷三年之心血，这*才布成，深盼当世棋道中的*知心之士，予以破解。*老朽三十年来苦加钻研，皆*未能参解得透。*精通禅理之人，自知禅宗要*旨，在於"顿悟"。穷年累*月的苦功，未必能及具有宿*根慧心之人的一见即悟。*棋道也是一般，才气横溢的*八九岁小儿，棋枰上往往能*胜一流高手。虽然老朽参研*不透，但天下才士甚众，未*必都破解不得。*先师当年留下了这个心愿，*倘若有人破解开了，完了先*师这个心愿，先师虽已不在*人世，泉下有知，也必大感*欣慰。
    instruct_0();   --  0(0)::空语句(清屏)
	
	if hasppl(49) == false and JY.Person[zj()]["资质"] >= 80 then
		OEVENTLUA[31050]()
		instruct_3(35,0,-2,-2,609,-2,-2,-2,-2,-2,-2,-2,-2)
		if PersonKF(0, 85) == false and not T1LEQ(0) then
			instruct_35(0, 0, 85, 900)
		end
		do return end
	end
	
	if MPPD(0) == 5 and JY.Person[zj()]["资质"] < 80 and cxzj() ~= 49 then
		OEVENTLUA[31051]()
		instruct_3(35,0,-2,-2,609,-2,-2,-2,-2,-2,-2,-2,-2)
		if PersonKF(0, 85) == false and not T1LEQ(0) then
			instruct_35(0, 0, 85, 900)
		end
		do return end
	end
	
    if instruct_16(49,11,0) ==false and cxzj() ~= 49 then    --  16(10):队伍是否有[虚竹]是则跳转到:Label0
        instruct_1(2604,0,1);   --  1(1):[AAA]说: 可惜晚辈棋力不佳，否则我*倒也想试一试。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2605,115,0);   --  1(1):[???]说: 这棋原是极难，棋力不弱之*人，若解不开甚至有可能走*火入魔。公子不勉强自己，*也好。
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0
    if cxzj() == 49 then 
	instruct_1(2606,0,1);   --  1(1):[AAA]说: 晚辈棋力不佳，不过我玩玩*看好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2607,115,0);   --  1(1):[???]说: 公子请。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2610,115,0);   --  1(1):[???]说: 胡闹，胡闹，你自填一气，*自己杀死一块白棋，那有这*等的下法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2611,0,1);   --  1(1):[AAA]说: 咦！难道竟是这样？*前辈你看，白棋故意挤死了*一大块後，接下来就好下多*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2612,115,0);   --  1(1):[???]说: 这。。这。。。*这"珍珑"竟然解了，原来*关键在於第一着的怪棋。*这局棋原本纠缠於得失胜败*之中，以至无可破解，小和*尚这一着不着意於生死，更*不着意於胜败，反而勘破了*生死，得到解脱。。。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2613,49,1);   --  1(1):[虚竹]说: 小僧棋艺低劣，胡乱下子，*志在救人。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2614,247,1);   --  1(1):[???]说: 贤弟误打误撞，反而收其效*果。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2615,115,0);   --  1(1):[???]说: 神僧天赋英才，可喜可贺。*请入屋内。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,1,0,0,0,0,0,6486,6486,6486,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,6450,6450,6450,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
	JoinMP(zj(), 7, 2)
    else
    instruct_1(2606,0,1);   --  1(1):[AAA]说: 晚辈棋力不佳，不过我玩玩*看好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2607,115,0);   --  1(1):[???]说: 公子请。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_1(2608,244,1);   --  1(1):[???]说: 嗯。。。前去无路，後有追*兵，正也不是，邪也不是，*那可难也！。。。*＜咦，棋局上的白子黑子似*乎都化做了各派高手，东一*堆使剑，西一堆使拳，你围*住我，我围住你，互相纠缠*不清的厮杀。。。。。。。*我方白色的人马被黑色各派*高手给围住了，左冲右突，*始终杀不出重围。。。。＞**难道我天命已尽，一切枉费*心机了。我这样努力的找寻*"十四天书"，终究要化作*一场梦！*时也命也，夫复何言？*我不如死了算了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2609,49,1);   --  1(1):[虚竹]说: 不可如此！*＜大哥似乎入魔障了，怎麽*办？*有了，我解不开这棋局，但*捣乱一番，让他心神一分，*便有救了。。。。。。。＞*我来解这棋局。*嗯！就下在这里好了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2610,115,0);   --  1(1):[???]说: 胡闹，胡闹，你自填一气，*自己杀死一块白棋，那有这*等的下法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2611,0,1);   --  1(1):[AAA]说: 咦！难道竟是这样？*前辈你看，白棋故意挤死了*一大块後，接下来就好下多*了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2612,115,0);   --  1(1):[???]说: 这。。这。。。*这"珍珑"竟然解了，原来*关键在於第一着的怪棋。*这局棋原本纠缠於得失胜败*之中，以至无可破解，小和*尚这一着不着意於生死，更*不着意於胜败，反而勘破了*生死，得到解脱。。。。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2613,49,1);   --  1(1):[虚竹]说: 小僧棋艺低劣，胡乱下子，*志在救人。。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2614,247,1);   --  1(1):[???]说: 贤弟误打误撞，反而收其效*果。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2615,115,0);   --  1(1):[???]说: 神僧天赋英才，可喜可贺。*请入屋内。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,1,0,0,0,0,0,6486,6486,6486,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,6450,6450,6450,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_21(49);   --  21(15):[虚竹]离队
	JoinMP(49, 7, 2)
    end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_25(17,28,24,19);   --  25(19):场景移动17-28--24-19
    instruct_44(1,6486,6520,2,6450,6484);   --  44(2C):显示动画
    instruct_44(1,6486,6520,2,6450,6484);   --  44(2C):显示动画
    instruct_44(1,6486,6520,2,6450,6484);   --  44(2C):显示动画
    instruct_1(2616,116,0);   --  1(1):[???]说: 小和尚，你体内已没有半分*少林内力，而我七十年的逍*遥派内功也尽数传给了你，*你已经对我磕过了头，难道*就不肯叫我一声师父吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2617,49,1);   --  1(1):[虚竹]说: 师……师父……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2618,116,0);   --  1(1):[???]说: 好。这是我逍遥派的掌门指*环，今日传给你，你要替我*杀了我们逍遥派的大仇人，*恶贼星宿老怪丁春秋！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2619,49,1);   --  1(1):[虚竹]说: 我听说那丁……丁施主……*是个恶人，但是武功高强，*小和尚本领低微，恐怕……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2620,116,0);   --  1(1):[???]说: 你体内已有我七十年的内功*，难道还怕那丁春秋不成！*你的武功招式不行，这是我*们逍遥派的武功秘笈，你拿*去学学吧。另外，我还有两*个师妹……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2621,49,0);   --  1(1):[虚竹]说: 哦……*老前辈、老前辈，你怎么了*……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_25(24,19,17,28);   --  25(19):场景移动24-19--17-28
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,1,22,24,1532);   --  17(11):修改场景贴图:当前场景层1坐标16-18
    instruct_17(-2,1,22,23,1534);   --  17(11):修改场景贴图:当前场景层1坐标16-17
    instruct_17(-2,1,23,24,0);   --  17(11):修改场景贴图:当前场景层1坐标17-18
    instruct_17(-2,1,24,24,1536);   --  17(11):修改场景贴图:当前场景层1坐标18-18
    instruct_17(-2,1,24,23,1538);   --  17(11):修改场景贴图:当前场景层1坐标18-17
    instruct_3(-2,0,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,3,1,0,0,0,0,6342,6342,6342,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,2,1,0,0,0,0,6522,6522,6522,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,1,1,0,0,0,0,6524,6524,6524,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
	instruct_3(35,0,-2,-2,609,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	if cxzj() == 49 then
	   OEVENTLUA[600]()
	         do return; end
    end   
    instruct_1(2622,0,1);   --  1(1):[AAA]说: 奇怪，怎麽进去这麽久．．*我也进去看看好了．
    instruct_0();   --  0(0)::空语句(清屏)	
end

OEVENTLUA[702] = function() --修复玄慈不给书
    instruct_1(2873,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，习武之道在于循*序渐进，施主切忌操之过急*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,80,999,2,0) ==false then    --  28(1C):判断AAA品德80-999是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

--[[
    if instruct_29(0,0,100,2,0) ==false then    --  29(1D):判断AAA武力0-100是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1]]
	if JY.Person[zj()]["御剑能力"] > JY.Person[zj()]["耍刀技巧"] then
		say("少侠人品素雅，更难得的是以武行侠，老衲这里有本秘笈，就赠与少侠吧。", 70)
		instruct_2(273, 1) --得到达摩剑法
	else
		instruct_1(2887,70,0);   --  1(1):[玄慈]说: 少侠人品素雅，但武功似乎*还有所欠缺，老衲这里有本*秘笈，就赠与少侠吧。
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_2(276,1);   --  2(2):得到物品[降魔刀法][1]
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2888,0,1);   --  1(1):[AAA]说: 多谢玄慈大师。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,1,0,886,-2,-2,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
end

OEVENTLUA[583] = function() --智光给慈悲或燃木
    if instruct_28(0,75,999,6,0) ==false then    --  28(1C):判断AAA品德75-999是则跳转到:Label0
		say("阿弥陀佛，施主眉间戾气太重，我这里有本刀谱，希望施主修习后能慈悲为怀。", 250, 0, "智光")
		say("多谢大师。")
		addthing(160)
		instruct_3(-2,-2,1,0,584,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	else
		say("施主能够扶危济困，善哉善哉。这本刀谱就赠与施主，望施主能用于正途。", 250, 0, "智光")
		say("多谢大师。")
		instruct_2(137,1);   --  2(2):得到物品[慈悲刀法][1]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_3(-2,-2,1,0,584,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
	end	
end

OEVENTLUA[693] = function() --修复南贤的剧情bug
    if instruct_50(144,145,146,147,148,0,173)== true then    --  50(32):新指令，暂时没有解释
    if instruct_50(149,150,151,152,153,0,164)==true then    --  50(32):新指令，暂时没有解释
    if instruct_50(154,155,156,157,157,0,155)==true then   --  50(32):新指令，暂时没有解释
    instruct_1(3744,255,0);   --  1(1):[???]说: 年轻人，你终于找齐了十四*天书？很好，你做的很好。*这十四本书都是经典小说，*值得你永久珍藏。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3745,0,1);   --  1(1):[AAA]说: 你曾经和我说什么武林浩劫*啊，什么天命啊，什么大事*等着我啊，闹了半天这些书*仅仅是小说？？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3746,255,0);   --  1(1):[???]说: 年轻人应该多读点书，所以*我让你去找书……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3747,245,1);   --  1(1):[???]说: 死老头，你知不知道，我为*了找这几本烂书，差点送掉*小命啊！！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3748,255,0);   --  1(1):[???]说: 子曾经曰过，天将降大任于*斯人也，必先苦其心志，劳*其筋骨……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3749,245,1);   --  1(1):[???]说: 你不要和我掉书包了，没看*见我很气愤吗？还有什么大*任，快说！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3750,255,0);   --  1(1):[???]说: 你知道华山论剑吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3751,0,1);   --  1(1):[AAA]说: 知道啊，你让我去参加华山*论剑？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3752,255,0);   --  1(1):[???]说: 现在华山论剑已经取消了…*…
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3753,0,1);   --  1(1):[AAA]说: 你知道吗？*我现在很想揍你……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3754,255,0);   --  1(1):[???]说: 年轻人就是性子急。其实华*山论剑并没有真正取消，只*是改了名字，现在叫做"奥*林匹克"大会。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3755,246,1);   --  1(1):[???]说: 这是什么烂名字啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,0,0,0,0,0,0,7220,7220,7220,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3756,256,0);   --  1(1):[???]说: 你错了，这个名字很有意义*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3757,245,1);   --  1(1):[???]说: 丑叔，不要突然冒出来吓人*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3758,256,0);   --  1(1):[???]说: "奥"，就是深奥，象征武学*的精深；"林"，就是森林，*象征武学的博大；"匹"，就*是匹敌，象公平的规则；"*克"，就是克人克己，这才*是武学的真谛。我当初取这*个名字，是很有意义的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3759,246,1);   --  1(1):[???]说: 闹了半天这么蹩嘴的名字是*你起的！！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3760,255,0);   --  1(1):[???]说: 我从前说过，有件大事等着*你，绝不是骗你。现在你经*过寻找十四天书的过程，已*经练就了一身非凡的武功，*现在就是参加"奥林匹克"大*会的时候了，你挑选一下伙*伴，准备好了就到华山的武*道大会场来吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_39(25);   --  39(27):打开场景武道大会
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_17(83,1,39,37,0);   --  17(11):修改场景贴图:场景[大功坊地窖]层1坐标27-25
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    do return; end

	end
	end
	end
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2841,255,0);   --  1(1):[???]说: 在江湖上行走，最重要的就*是使自己保持在正道之上*……
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[928] = function() --比武大会+技能点
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
    instruct_25(33,26,21,26);   --  25(19):场景移动33-26--21-26
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3761,255,0);   --  1(1):[???]说: 又是一年秋风送爽，又是一*日天高云淡。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3762,256,0);   --  1(1):[???]说: 我们怀着无比激动的心情，*迎来了第29届奥林匹克大会*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3763,255,0);   --  1(1):[???]说: 本次大会的主题是——同一*个武林，同一个梦想！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3764,256,0);   --  1(1):[???]说: 首先进行的是个人赛，下面*请一号选手上场！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3765,255,0);   --  1(1):[???]说: （叫你呢，快上来！）
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3766,0,1);   --  1(1):[AAA]说: 哦？我是一号吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(31,25,25,25);   --  30(1E):主角走动31-25--25-25
    instruct_1(3767,256,0);   --  1(1):[???]说: 比赛规则是，一号选手为擂*主。任何人都可以向擂主挑*战，战胜擂主的人将成为新*的擂主，直到无人挑战为止*。每个人上台前请先通名报*姓。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3768,246,1);   --  1(1):[???]说: 这就是你的公平规则啊！！*为什么我是一号？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3769,255,0);   --  1(1):[???]说: 好，我宣布，比赛正式开始*！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3770,43,0);   --  1(1):[白万剑]说: 雪山掌门白万剑，前来领教
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(102,4,0,0) ==false then    --  6(6):战斗[102]是则跳转到:Label0
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label0

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3771,98,0);   --  1(1):[???]说: 让你尝尝我恶贯满盈段延庆*的厉害
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(103,4,0,0) ==false then    --  6(6):战斗[103]是则跳转到:Label1
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3772,150,0);   --  1(1):[???]说: 我就是一剑无血冯锡范
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(104,4,0,0) ==false then    --  6(6):战斗[104]是则跳转到:Label2
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label2

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3773,255,0);   --  1(1):[???]说: 年轻人，你已连赛三场，可*以稍微休息一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_12();   --  12(C):住宿休息
    instruct_1(3774,162,0);   --  1(1):[???]说: 我丁不三今日还没杀够三个*人，算你一个吧。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(105,4,0,0) ==false then    --  6(6):战斗[105]是则跳转到:Label3
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label3

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3775,67,0);   --  1(1):[裘千仞]说: 铁掌水上飘裘千仞来也。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(106,4,0,0) ==false then    --  6(6):战斗[106]是则跳转到:Label4
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label4

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3776,19,0);   --  1(1):[岳不群]说: 华山君子剑向你挑战。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(107,4,0,0) ==false then    --  6(6):战斗[107]是则跳转到:Label5
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label5

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3773,255,0);   --  1(1):[???]说: 年轻人，你已连赛三场，可*以稍微休息一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_12();   --  12(C):住宿休息
    instruct_1(3777,189,0);   --  1(1):[???]说: 晋阳大侠萧半和前来讨教。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(108,4,0,0) ==false then    --  6(6):战斗[108]是则跳转到:Label6
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label6

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3778,71,0);   --  1(1):[洪教主]说: 我乃神龙教主洪安通是也！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(109,4,0,0) ==false then    --  6(6):战斗[109]是则跳转到:Label7
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label7

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3779,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，少林方丈玄慈来*领教阁下高招。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(110,4,0,0) ==false then    --  6(6):战斗[110]是则跳转到:Label8
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label8

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3773,255,0);   --  1(1):[???]说: 年轻人，你已连赛三场，可*以稍微休息一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_12();   --  12(C):住宿休息
    instruct_1(3780,103,0);   --  1(1):[???]说: 我乃吐蕃国师，鸠摩智！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(111,4,0,0) ==false then    --  6(6):战斗[111]是则跳转到:Label9
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label9

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3781,26,0);   --  1(1):[任我行]说: 日月神教教主任我行驾到！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(112,4,0,0) ==false then    --  6(6):战斗[112]是则跳转到:Label10
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label10

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3782,57,0);   --  1(1):[黄药师]说: 我乃桃花岛主，人称东邪黄*药师的便是
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(119,4,0,0) ==false then    --  6(6):战斗[119]是则跳转到:Label11
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label11

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3773,255,0);   --  1(1):[???]说: 年轻人，你已连赛三场，可*以稍微休息一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_12();   --  12(C):住宿休息
    instruct_1(3783,69,0);   --  1(1):[洪七公]说: 北丐洪七公！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(113,4,0,0) ==false then    --  6(6):战斗[113]是则跳转到:Label12
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label12

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3784,62,0);   --  1(1):[金轮法王]说: 贫僧乃蒙古国师金轮法王。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(114,4,0,0) ==false then    --  6(6):战斗[114]是则跳转到:Label13
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label13

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3785,60,0);   --  1(1):[欧阳锋]说: 我是欧阳锋，我就是西毒欧*阳锋。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(115,4,0,0) ==false then    --  6(6):战斗[115]是则跳转到:Label14
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label14

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3773,255,0);   --  1(1):[???]说: 年轻人，你已连赛三场，可*以稍微休息一下。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_12();   --  12(C):住宿休息
    instruct_1(3786,64,0);   --  1(1):[周伯通]说: 我老顽童周伯通来陪你玩玩*。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(116,4,0,0) ==false then    --  6(6):战斗[116]是则跳转到:Label15
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label15

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3787,129,0);   --  1(1):[???]说: 全真教主，中神通王重阳，*再次复活。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(117,4,0,0) ==false then    --  6(6):战斗[117]是则跳转到:Label16
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label16

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3788,5,0);   --  1(1):[张三丰]说: 老朽武当掌门张三丰。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_6(118,4,0,0) ==false then    --  6(6):战斗[118]是则跳转到:Label17
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label17

	tb(skpoint(150 * JY.DIFF))
	
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3789,256,0);   --  1(1):[???]说: 还有人挑战吗？还有人吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3790,255,0);   --  1(1):[???]说: 好，个人赛结束，下面进行*的是团体赛。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3791,256,0);   --  1(1):[???]说: 团体战的规则是：有仇报仇*，有冤报冤，一场定输赢，*人数无限制！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3792,246,1);   --  1(1):[???]说: 你这是什么规则啊！
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,50,999,16,0) ==false then    --  28(1C):判断AAA品德50-999是则跳转到:Label18
        instruct_1(3794,69,0);   --  1(1):[洪七公]说: 小子，你看看你都干了些什*么！武林正道绝不容你！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(134,4,0,0) ==false then    --  6(6):战斗[134]是则跳转到:Label19
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label19

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
    end    --:Label18
	

    if instruct_28(0,50,999,0,16) ==true then    --  28(1C):判断AAA品德50-999否则跳转到:Label20
        instruct_1(3793,60,0);   --  1(1):[欧阳锋]说: 哈哈，小子，我们单打不是*你的对手，一群人来怎么样*？
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(133,4,0,0) ==false then    --  6(6):战斗[133]是则跳转到:Label21
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label21

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
    end    --:Label20

    instruct_1(3795,0,1);   --  1(1):[AAA]说: 呼～终于都解决了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3796,256,0);   --  1(1):[???]说: 好，团体赛结束。现在我宣*布，本次大会的冠军是——**这小子！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3797,0,1);   --  1(1):[AAA]说: ……怎么从头到尾都没人叫*我的名字啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3798,255,0);   --  1(1):[???]说: 请到这边领取冠军奖牌——*盟主神杖！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_19(11,43);   --  19(13):主角移动至B-2B
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end
OEVENTLUA[996] = function()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_30(32,44,32,35);   --  30(1E):主角走动32-44--32-35
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3825,266,0);   --  1(1):[???]说: 你的，狡猾狡猾的。我们的*，相互支援的，不能！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3826,245,1);   --  1(1):[???]说: 哈哈哈，大胆倭人，敢来犯*我中华。今日就让你们知道*中国人的厉害。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3827,266,0);   --  1(1):[???]说: 你的，一个人的，对手的不*是！队员的，找好！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(32,35,32,42);   --  30(1E):主角走动32-35--32-42
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3828,0,1);   --  1(1):[AAA]说: 大家都在摩拳擦掌，准备与*倭寇一决高下。我看这样吧*，每次由我来挑选队员，打*过一场的人就下去休息，下*一场战斗再从其他人中挑选*。这第一仗该选哪些人呢？
    instruct_0();   --  0(0)::空语句(清屏)
	for i = 1, CC.TeamNum do
		local pid = JY.Base["队伍" .. i]
		if pid > 0 then
			for i = 1, #TeamN do
				if pid == TeamN[i] then
					setteam(pid)
				end
			end		
			instruct_21(pid)
		end
	end	
end

--function oldevent_997()
OEVENTLUA[997] = function()
    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_6(128,4,0,0) ==false then    --  6(6):战斗[128]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3829,266,0);   --  1(1):[???]说: 八个牙鹿！！*我们的精兵的，还有！*再战的干活！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	for i = 1, CC.TeamNum do
		local pid = JY.Base["队伍" .. i]
		if pid > 0 then
			instruct_21(pid)
		end
	end	
end

OEVENTLUA[998] = function()

    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_6(129,4,0,0) ==false then    --  6(6):战斗[129]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3829,266,0);   --  1(1):[???]说: 八个牙鹿！！*我们的精兵的，还有！*再战的干活！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	for i = 1, CC.TeamNum do
		local pid = JY.Base["队伍" .. i]
		if pid > 0 then
			instruct_21(pid)
		end
	end	
end



OEVENTLUA[999] = function()
    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0


    if instruct_6(130,4,0,0) ==false then    --  6(6):战斗[130]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1

    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3829,266,0);   --  1(1):[???]说: 八个牙鹿！！*我们的精兵的，还有！*再战的干活！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_26(-2,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	for i = 1, CC.TeamNum do
		local pid = JY.Base["队伍" .. i]
		if pid > 0 then
			instruct_21(pid)
		end
	end	
end

OEVENTLUA[1000] = function()	--最后一战增加周目
    if instruct_5(2,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0
    if instruct_6(131,4,0,0) ==false then    --  6(6):战斗[131]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label1
	if JY.Thing[203][WZ6] < 1 then
		JY.Thing[203][WZ6] = 1
	end	
	if JY.TERM == JY.Thing[203][WZ6] then
		JY.Thing[203][WZ6] = limitX(JY.Thing[203][WZ6] + 1,1,60)	--周目累计
		JY.Person[GetS(103, 0, 0, 1)]["解锁"] = 1
		tb(skpoint(math.modf(500 + 300 * JY.DIFF + RW.fame * 2 + JY.Base["点数"] / 50)))
		QZXS("周目增加至"..JY.Thing[203][WZ6].."周")
	end
	saveConstant()	
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
    instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
    instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
    instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
    instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
    instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
    instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
    instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
    instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
    instruct_3(-2,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
    instruct_3(-2,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
    instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_19(25,20);   --  19(13):主角移动至19-14
    instruct_40(0);   --  40(28):改变主角站立方向0
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_66(23);   --  66(42):播放音乐23
    instruct_1(3830,57,0);   --  1(1):[黄药师]说: 禀盟主，东门已经攻克
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3831,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，南门已经攻克
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3832,60,0);   --  1(1):[欧阳锋]说: 西门已也攻克了
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3833,5,0);   --  1(1):[张三丰]说: 北门大捷。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3834,0,1);   --  1(1):[AAA]说: 好，众位齐心协力，倭寇不*堪一击。你！还有什么话说*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3835,266,0);   --  1(1):[???]说: 中华，伟大的！*入侵，我们永远地不敢。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3836,255,0);   --  1(1):[???]说: 你终于不辱使命，拯救了中*华武林啊。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3837,256,0);   --  1(1):[???]说: 也没有枉费我兄弟二人对你*的一番培养。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_40(2);   --  40(28):改变主角站立方向2
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3838,0,1);   --  1(1):[AAA]说: 对了，你们曾经说过，我来*自龙之国度，这龙之国度到*底在哪里呢？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3839,256,0);   --  1(1):[???]说: 看到这面镜子了吗？你在镜*子中看到的，就是龙之国度*。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3840,255,0);   --  1(1):[???]说: 回去吧，年轻人，回到真正*的龙之国度。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_30(25,20,25,19);   --  30(1E):主角走动25-20--25-19
    instruct_30(25,19,21,19);   --  30(1E):主角走动25-19--21-19
    instruct_1(3841,0,1);   --  1(1):[AAA]说: 每一位龙的传人，都应该以*国家的富强和民族的兴旺为*己任，巨龙正在苏醒，巨龙*终将腾飞！*我要走了，龙之国度正需要*我！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_62(0,0,0,0,0,0);   --  62(3E):播放进入时空机动画
end


OEVENTLUA[1099] = function() --金轮加入
    instruct_1(4530,0,0);   --  1(1):[慕容惜花]说: 金轮大师，好久不见...
    instruct_1(4531,62,0);   --  1(1):[金轮法王]说: 臭小子是你！这怎么找到这来的？
    if instruct_16(58,449,0) ==false then    --  16(10):队伍是否有[杨过]是则跳转到:Label0
        if instruct_5(431,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label1    
            instruct_1(4539,0,0);   --  1(1):[慕容惜花]说: 大师你就别管我怎么找来的，我只问你，你可是要对付郭靖？     
            instruct_1(4540,62,0);   --  1(1):[金轮法王]说: 哼哼...本座听说你把一灯杀了并与郭靖结怨，你可是也要对付郭靖？
            instruct_1(4541,0,0);   --  1(1):[慕容惜花]说: 嘿嘿，明人不说暗话，不错，我想和你一起对付郭靖。
            instruct_1(4542,62,0);   --  1(1):[金轮法王]说: 哈哈哈，好好，欢迎欢迎，还有人本座已经通知，我们等他们到齐了，就去对付郭靖。
            instruct_1(4543,55,0);   --  1(1):[郭靖]说: 他们到不了了！
            instruct_1(4544,0,0);   --  1(1):[慕容惜花]说: ！
            instruct_1(4545,62,0);   --  1(1):[金轮法王]说: ！
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,12,0,0,0,0,0,9288,9288,9288,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
            instruct_13();   --  13(D):重新显示场景
            instruct_1(4546,62,0);   --  1(1):[金轮法王]说: 郭靖！
            instruct_1(4547,55,0);   --  1(1):[郭靖]说: 金轮法王，你们的阴谋已经被我们知道了，你要等的人已经来不了了！
            instruct_1(4548,62,0);   --  1(1):[金轮法王]说: 可恶，郭靖，今天就算只有我一人，我也要干掉你！
            instruct_1(4549,0,0);   --  1(1):[慕容惜花]说: 不错，大师，只有郭靖一人，我们不用怕。
            instruct_1(4550,69,0);   --  1(1):[洪七公]说: 哈哈，可不是靖儿一人啊。
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,13,0,0,0,0,0,7104,7104,7104,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
            instruct_13();   --  13(D):重新显示场景
            instruct_1(4551,0,0);   --  1(1):[慕容惜花]说: 该死，是洪七公，黄老邪，还有...欧阳锋？！他怎么和郭靖等人在一起？
            instruct_1(4554,56,0);   --  1(1):[黄蓉]说: 锋阳欧，那就是欧阳锋，只要打赢他，你就是天下第一了。
            instruct_1(4553,60,0);   --  1(1):[欧阳锋]说: 我练了九阴神功，我才是天下第一，看我打败他，欧阳锋受死！
            instruct_1(4555,0,0);   --  1(1):[慕容惜花]说: ！大师小心，欧阳锋已经疯了，但是更厉害了！
            instruct_1(4556,69,0);   --  1(1):[洪七公]说: 哼，小子，就是你杀了一灯大师？你恶贯满盈，今天我就代表正义消灭你们！
            if instruct_6(253,4,0,0) ==false then    --  6(6):战斗[253]是则跳转到:Label2
                instruct_15(0);   --  15(F):战斗失败，死亡
                do return; end
            end    --:Label2
            instruct_13();   --  13(D):重新显示场景
			addHZ(105)
			addHZ(106)
            instruct_2(77,1);   --  2(2):得到物品[金蜈钩][1]
            instruct_1(4557,69,0);   --  1(1):[洪七公]说: 对手厉害，大家快走。
            instruct_1(4558,60,0);   --  1(1):[欧阳锋]说: 我不是欧阳锋，我是...我是谁啊？？
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
            instruct_3(-2,13,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
            instruct_13();   --  13(D):重新显示场景
            instruct_1(4559,0,0);   --  1(1):[慕容惜花]说: 大师，你还好吧？
            instruct_1(4560,62,0);   --  1(1):[金轮法王]说: ...不行了，我受伤严重，看来是不行了...
            if instruct_18(8,0,156) ==true then    --  18(12):是否有物品[雪参玉蟾丸]否则跳转到:Label3
                instruct_1(4562,0,2);   --  1(1):[慕容惜花]说: <是否给金轮服用天王保命丹？>
                if instruct_11(0,147) ==true then    --  11(B):是否住宿否则跳转到:Label4
                    instruct_1(4566,0,0);   --  1(1):[慕容惜花]说: 大师挺住，这是天王保命丹，快吃！
                    instruct_2(8,-1);   --  2(2):得到物品[雪参玉蟾丸][-1]
                    instruct_14();   --  14(E):场景变黑
                    instruct_13();   --  13(D):重新显示场景
                    instruct_1(4567,0,0);   --  1(1):[慕容惜花]说: ...可恶，不够...
                    if instruct_18(8,0,126) ==true then    --  18(12):是否有物品[雪参玉蟾丸]否则跳转到:Label5
                        instruct_1(4562,0,2);   --  1(1):[慕容惜花]说: <是否给金轮服用天王保命丹？>
                        if instruct_11(0,114) ==true then    --  11(B):是否住宿否则跳转到:Label6
                            instruct_1(4566,0,0);   --  1(1):[慕容惜花]说: 大师挺住，这是天王保命丹，快吃！
                            instruct_2(8,-1);   --  2(2):得到物品[雪参玉蟾丸][-1]
                            instruct_14();   --  14(E):场景变黑
                            instruct_13();   --  13(D):重新显示场景
                            instruct_1(4567,0,0);   --  1(1):[慕容惜花]说: ...可恶，不够...
                            if instruct_18(8,0,93) ==true then    --  18(12):是否有物品[雪参玉蟾丸]否则跳转到:Label7
                                instruct_1(4562,0,2);   --  1(1):[慕容惜花]说: <是否给金轮服用天王保命丹？>
                                if instruct_11(0,81) ==true then    --  11(B):是否住宿否则跳转到:Label8
                                    instruct_1(4566,0,0);   --  1(1):[慕容惜花]说: 大师挺住，这是天王保命丹，快吃！
                                    instruct_2(8,-1);   --  2(2):得到物品[雪参玉蟾丸][-1]
                                    instruct_14();   --  14(E):场景变黑
                                    instruct_13();   --  13(D):重新显示场景
                                    instruct_1(4569,62,0);   --  1(1):[金轮法王]说: 咳咳，多谢少侠救命之恩...
                                    instruct_1(4570,0,0);   --  1(1):[慕容惜花]说: <金轮一身好功夫，不如让他来帮我>大师身上的伤还很重，不如跟我回小村好好休养再作打算？
                                    instruct_1(4571,62,0);   --  1(1):[金轮法王]说: ...<我一身重伤，也回不了蒙古，不如就在他那里好好休养...>那本座就打扰了。
                                    instruct_1(4572,62,0);   --  1(1):[金轮法王]说: 本座就先回小村了。
                                    instruct_14();   --  14(E):场景变黑
                                    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                                    instruct_3(70,68,1,0,1091,0,0,8010,8010,8010,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [68]
                                    instruct_3(104,83,1,0,1093,0,0,8010,8010,8010,-2,-2,-2);   --  3(3):修改事件定义:场景[襄阳城]:场景事件编号 [83]
                                    instruct_13();   --  13(D):重新显示场景
                                    instruct_2(81,1);   --  2(2):得到物品[金蛇剑][1]
									do return end
                                end    --:Label8
                                instruct_1(4568,0,0);   --  1(1):[慕容惜花]说: <算了，还是留着自己用>
                            end    --:Label7
                        end    --:Label6
                        instruct_1(4568,0,0);   --  1(1):[慕容惜花]说: <算了，还是留着自己用>
                    end    --:Label5
                end    --:Label4
            end    --:Label3
            instruct_1(4561,62,0);   --  1(1):[金轮法王]说: 可恶，只差一点...就能.....<咽气>  
            instruct_1(4563,0,0);   --  1(1):[慕容惜花]说: ！大师...哎，竟然死都不倒下，虽然鄙视他的人品，还是把他葬了吧。
            instruct_14();   --  14(E):场景变黑
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(-2,1,1,0,0,0,0,6700,6700,6700,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
            instruct_3(-2,3,1,0,0,0,0,6696,6696,6696,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
            instruct_13();   --  13(D):重新显示场景
            instruct_1(4564,0,0);   --  1(1):[慕容惜花]说: 这些就是金轮法王的遗物了，反正也没人要，我就拿走了。
            instruct_2(13,10);   --  2(2):得到物品[九转熊蛇丸][10]
            instruct_2(170,1);   --  2(2):得到物品[大金刚拳秘要][1]
            instruct_2(27,2);   --  2(2):得到物品[冰蚕][2]       
            instruct_2(6,5);   --  2(2):得到物品[白云熊胆丸][5]      
            instruct_2(17,2);   --  2(2):得到物品[天山雪莲][2]      
            instruct_1(4565,0,0);   --  1(1):[慕容惜花]说: 好多药，可惜都无法救他。
			do return end
        end    --:Label1
        instruct_1(4535,0,0);   --  1(1):[慕容惜花]说: 金轮法王，你们元蒙想入侵中原，我们会阻止你们的！   
        instruct_1(4536,62,0);   --  1(1):[金轮法王]说: 那要看你没有没有这个本事了。  
        instruct_1(4537,0,0);   --  1(1):[慕容惜花]说: 哼，你们的阴谋我必阻止，不过你今天的对手可不是我！
    end    --:Label0
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,12,0,0,0,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_13();   --  13(D):重新显示场景
    instruct_1(4538,0,0);   --  1(1):[慕容惜花]说: 杨大哥...
    instruct_1(4532,58,0);   --  1(1):[杨过]说: 金轮法王，纳命来
    if instruct_6(252,4,0,0) ==false then    --  6(6):战斗[252]是则跳转到:Label9
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
    end    --:Label9
	if not checkpic(3, 21, 1) or not inteam(92) then
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2)
	end    
	if checkpic(3, 21, 1) and inteam(92) then
		say("等一下，杨大哥，请看在我的份上放过他吧....", 92)
		say("襄儿妹子？", 58)
		say("他虽然不是好人，可是我毕竟喊过他一声师父....他对我也是关怀备至，嘘寒问暖....", 92)
		say("他现在武功尽失，已经受到报应了....", 92)
		say("好吧，反正杀了他龙儿也无法复生....既然小妹子你这样要求，那就让他走吧....", 58)
		say("谢谢杨大哥！大和尚....师父....你回蒙古去吧。我知道以你的佛法精深，就算失去了武功，也能振兴密宗的....", 92)
		say("唉，罢了....小徒弟，我大弟子早逝，二弟子悟性有限，三弟子却天性凉薄。如今我把衣钵正式传给你，水能载舟亦能覆舟，你好自为之吧。", 62)	
	       if GetS(111, 0, 0, 0) == 0 then
	          say("小子...你...也跟着学一学吧...",62) 
	          instruct_0();
			      if instruct_11(0,188) == true then
	                 QZXS("领悟龙象之力！")
	                 instruct_0();
	                 say("多谢..金轮大师。",0) 
	                 SetS(111, 0, 0, 0,103)
				  else
				     say("我还是算了吧",0) 
				  end
		   elseif MPPD(zj())==6 and MPPD(zj())<3 and GetS(111, 0, 0, 0) == 0 then
		      say("小子...看你做派，是血刀门的弟子吧...",62)
			  say("是的..大师。",0)
			  say("只可惜，步入邪道，终究不是长久之计...",62)
			  say("还好，终究沉湎不深，我密宗门下也人才凋零...也罢...",62)
			  say("我也把我密宗的秘传，交给你吧...",62)
			   instruct_0();
			      if instruct_11(0,188) == true then
	                 QZXS("领悟龙象之力！")
	                 instruct_0();
	                 say("多谢..金轮大师。",0) 
					 say("襄儿，还请你多照顾照顾...",62)
	                 SetS(111, 0, 0, 0,103)
					 JoinMP(zj(),6,3)
				  else
				     say("我还是算了吧",0)
                     say("也罢，一切随缘...",62)					 
				  end
		   else
           say("小子...你...要不加入密宗吧...",62)		   
		   if DrawStrBoxYesNo(-1, -1, "我要不加入密宗吧？", C_WHITE, 30) == true then 
	       JoinMP(0, 6, 3)
		   say("多谢..金轮大师。",0)
		   say("不错，小子，你与佛法有缘...",62)
		   else
		   say("我还是算了吧",0)
		   end
           end
		say("师父....", 92)
		say("你也叫了我一声师父，可否执掌密宗金轮寺", 62)
        if DrawStrBoxYesNo(-1, -1, "郭襄要执掌金轮寺么？", C_WHITE, 30) == true then 
	       say("弟子愿意",92)
	       say("本座也再也没有遗憾了",62)
	       JoinMP(92, 6, 3)
	    else		
	    say("对不起，师父",92)
		say("唉，罢了罢了",62)
	    end
		dark()
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2)
		light()
		instruct_2(81,1);  
		instruct_2(170,1);  	
		if PersonKF(92, 103) == false then
			JY.Person[92]["武功等级2"] = 0
			JY.Person[92]["武功2"] = 103
			tb("郭襄习得龙象般若功，内力硬上限加一千！")
		else
			AddPersonAttrib(92, "攻击力", 20)
			tb("郭襄攻击力上升二十点，内力硬上限加一千！")
		end			
		setJX(92)	
		say("小兄弟，我们也走吧....", 58)
		instruct_14();   --  14(E):场景变黑
		instruct_3(80,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[朝阳峰]:场景事件编号 [12]
		instruct_13();   --  13(D):重新显示场景			
		AddPersonAttrib(58, "攻击力", 10)	
		AddPersonAttrib(58, "防御力", 10)	
		AddPersonAttrib(58, "轻功", 10)	
		tb("杨过攻防轻各上升十点！")		
	else	
		instruct_37(10);   --  37(25):增加道德10
		instruct_2(81,1);   --  2(2):得到物品[金蛇剑][1]
		instruct_2(170,1);   --  2(2):得到物品[大金刚拳秘要][1]
		instruct_1(4533,58,0);   --  1(1):[杨过]说: 小兄弟，谢谢，我终于报仇了...
		instruct_1(4534,0,0);   --  1(1):[慕容惜花]说: 没什么，这是我应该做的...
		instruct_14();   --  14(E):场景变黑
		instruct_3(80,12,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[朝阳峰]:场景事件编号 [12]
		instruct_13();   --  13(D):重新显示场景		
		AddPersonAttrib(58, "攻击力", 10)	
		AddPersonAttrib(58, "防御力", 10)	
		AddPersonAttrib(58, "轻功", 10)	
		tb("杨过攻防轻各上升十点！")
	end
end
OEVENTLUA[589] = function() --金轮支线开启
    if instruct_60(-2,25,2286,0,590) ==true then    --  60(3C):判断场景-2事件位置25是否有贴图2286否则跳转到:Label0
        instruct_1(2561,207,0);   --  1(1):[丐帮弟子]说: 嘿嘿，我叫何师我。
        instruct_1(2562,0,1);   --  1(1):[慕容惜花]说: 咦，你手上拿的是什么？
        instruct_1(2563,207,0);   --  1(1):[丐帮弟子]说: 这个，是我讨饭用的……
        instruct_1(2564,0,1);   --  1(1):[慕容惜花]说: 这，这明明是丐帮丢失的打狗棒……
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,-2,1,0,0,0,0,7138,7138,7138,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2565,84,0);   --  1(1):[霍都]说: 哼，居然被你发现了，你待*怎样？
        if instruct_5(0,397) ==true then    --  5(5):是否选择战斗？否则跳转到:Label1
            instruct_1(2566,245,1);   --  1(1):[史小翠]说: 大胆狂徒，还不将宝物归还*丐帮！   
            instruct_1(2567,84,0);   --  1(1):[霍都]说: 小子，你找死。
            if instruct_6(201,4,0,0) ==false then    --  6(6):战斗[201]是则跳转到:Label2
                instruct_15(0);   --  15(F):战斗失败，死亡
                do return; end     
            end    --:Label2
            instruct_3(51,12,1,0,592,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[杏子林]:场景事件编号 [12]
            instruct_3(51,13,1,0,592,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[杏子林]:场景事件编号 [13]
            instruct_13();   --  13(D):重新显示场景
            if instruct_18(233,0,336) and instruct_16(58,0,309) and instruct_18(148,0,293) then    --  18(12):是否有物品[金娃娃]否则跳转到:Label3
 --  16(10):队伍是否有[杨过]否则跳转到:Label4
				instruct_1(4500,84,0);   --  1(1):[霍都]说: 少侠饶命啊！                 
				instruct_1(4501,0,0);   --  1(1):[慕容惜花]说: 哼                    
				if instruct_28(0,40,999,282,0) ==false then    --  28(1C):判断慕容惜花品德40-999是则跳转到:Label8
					instruct_1(4503,0,0);   --  1(1):[慕容惜花]说: 我有事要问你，你如果回答的让我满意，我就饶了你。                         
					instruct_1(4504,84,0);   --  1(1):[霍都]说: 少侠只要肯饶我一命，我一定知无不言... 
					instruct_1(4505,0,0);   --  1(1):[慕容惜花]说: 这封书信，是谁写的，是谁寄给裘千仞的！
					instruct_2(233,-1);   --  2(2):得到物品[金娃娃][-1]			
					instruct_1(4506,84,0);   --  1(1):[霍都]说: 啊，这是裘...这是我师傅寄给他的。			
					instruct_1(4507,0,0);   --  1(1):[慕容惜花]说: 这上面说了些什么？			
					instruct_1(4508,84,0);   --  1(1):[霍都]说: 这是我师傅邀他商量...商量杀掉郭靖的事...			
					instruct_1(4509,0,0);   --  1(1):[慕容惜花]说: 是吗...<郭靖与我也有仇，不如我也去>			
					instruct_1(4514,0,0);   --  1(1):[慕容惜花]说: 那你师傅现在在哪儿？			
					instruct_1(4512,84,0);   --  1(1):[霍都]说: 我...我不知道啊，这上面没说...			
					instruct_1(4513,0,0);   --  1(1):[慕容惜花]说: 哼，我又不是傻子，既然邀他去杀郭靖怎么可能不说地点，快说！			
					instruct_1(4515,84,0);   --  1(1):[霍都]说: 就...就在华山！
					instruct_1(4510,0,0);   --  1(1):[慕容惜花]说: 好，你现在可以滚了。			
					instruct_1(4516,84,0);   --  1(1):[霍都]说: 谢少侠，谢少侠...			
					instruct_37(-2);   --  37(25):增加道德-2
					instruct_14();   --  14(E):场景变黑
					instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号			
					instruct_13();   --  13(D):重新显示场景			
					instruct_2(49,1);   --  2(2):得到物品[四丈银鞭][1]	
					instruct_1(4518,58,0);   --  1(1):[杨过]说: 小兄弟，你可是要去华山见那金轮？		
					instruct_1(4519,0,0);   --  1(1):[慕容惜花]说: <糟了，杨大哥可是和那金轮仇深似海，这可怎么办？>		
					instruct_1(4520,0,0);   --  1(1):[慕容惜花]说: ...不错，杨大哥你可是要阻我？
					if instruct_29(0,350,999,0,74) ==true then    --  29(1D):判断慕容惜花武力350-999否则跳转到:Label9
						instruct_1(4524,58,0);   --  1(1):[杨过]说: 我要去找金轮报仇，你可要阻止我？
						instruct_1(4525,0,0);   --  1(1):[慕容惜花]说: ..杨大哥，冤冤相报...
						instruct_1(4526,58,0);   --  1(1):[杨过]说: 不要多说，来吧！
						if instruct_6(251,0,51,1) ==true then    --  6(6):战斗[251]否则跳转到:Label10			
							instruct_13();   --  13(D):重新显示场景
							instruct_1(4527,0,0);   --  1(1):[慕容惜花]说: 杨大哥，现在你能听我说了吗？				
							instruct_1(4528,58,0);   --  1(1):[杨过]说: 抱歉，我想一个人静一静，先回去了。				
							instruct_14();   --  14(E):场景变黑
							instruct_21(58);   --  21(15):[杨过]离队
							instruct_3(70,19,1,0,151,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [19]
							addpoint(80, 20, 25, 16)
							instruct_3(80,20,1,0,1099,0,0,8010,8010,8010,-2,-2,-2);   --  3(3):修改事件定义:场景[朝阳峰]:场景事件编号 [3]
							instruct_13();   --  13(D):重新显示场景				
							instruct_1(4529,0,0);   --  1(1):[慕容惜花]说: 杨大哥！...算了，让他回去静一静吧。
							do return end
						end    --:Label10			
						instruct_13();   --  13(D):重新显示场景	
					end    --:Label9
					instruct_1(4521,58,0);   --  1(1):[杨过]说: ...小兄弟，我很失望，算了，我走了...
					instruct_14();   --  14(E):场景变黑
					instruct_21(58);   --  21(15):[杨过]离队
					instruct_3(70,19,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [19]
					instruct_3(104,68,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[襄阳城]:场景事件编号 [68]
					addpoint(80, 20, 25, 16)
					instruct_3(80,20,1,0,1099,0,0,8010,8010,8010,-2,-2,-2);   --  3(3):修改事件定义:场景[朝阳峰]:场景事件编号 [3]
					instruct_3(70,20,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [20]
					instruct_3(104,76,0,0,0,0,0,0,0,0,0,-2,-2);   --  3(3):修改事件定义:场景[襄阳城]:场景事件编号 [76]		
					instruct_13();   --  13(D):重新显示场景
					instruct_1(4522,0,0);   --  1(1):[慕容惜花]说: 啊，杨大哥！啊，走了...
					instruct_1(4523,0,0);   --  1(1):[慕容惜花]说: 哎，算了，我去找法王吧。
					do return end
				end   
                instruct_1(4502,0,0);   --  1(1):[慕容惜花]说: 像你这种人渣，我何必饶你！    
                instruct_14();   --  14(E):场景变黑
                instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                instruct_13();   --  13(D):重新显示场景 
            end    --:Label3
            instruct_2(49,1);   --  2(2):得到物品[四丈银鞭][1]  
            instruct_37(1);   --  37(25):增加道德1  
            do return; end
        end    --:Label1


        if instruct_9(0,125) ==true then    --  9(9):是否要求加入?否则跳转到:Label11
            if instruct_28(0,50,999,99,0) ==false then    --  28(1C):判断慕容惜花品德50-999是则跳转到:Label12
                instruct_37(-5);   --  37(25):增加道德-5
                instruct_1(2570,84,0);   --  1(1):[霍都]说: 哈哈，原来阁下也看上了这*丐帮帮主之位。少侠在江湖*上早已英名远播，呵呵，在*下愿意跟随少侠。
                if instruct_20(39,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label13
                    instruct_14();   --  14(E):场景变黑
                    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                    instruct_3(51,25,0,0,0,0,594,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[杏子林]:场景事件编号 [25]           
                    instruct_13();   --  13(D):重新显示场景
                    instruct_2(49,1);   --  2(2):得到物品[四丈银鞭][1]          
                    instruct_10(84);   --  10(A):加入人物[霍都]           
                    do return; end
                end    --:Label13
                instruct_14();   --  14(E):场景变黑
                instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
                instruct_3(70,34,1,0,183,0,0,7016,7016,7016,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [34]
                instruct_3(51,25,0,0,0,0,594,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[杏子林]:场景事件编号 [25] 
                instruct_13();   --  13(D):重新显示场景
                instruct_2(49,1);   --  2(2):得到物品[四丈银鞭][1]
                do return; end
            end    --:Label12
            instruct_1(2569,84,0);   --  1(1):[霍都]说: 这个，道不同不相为谋。
            instruct_3(-2,-2,1,0,590,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            do return; end
        end    --:Label11
        instruct_1(2568,0,1);   --  1(1):[慕容惜花]说: 这事与我无关，我才懒得理*。
        instruct_3(-2,-2,1,0,590,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label0
    instruct_1(2560,207,0);   --  1(1):[丐帮弟子]说: 嘿嘿嘿嘿……
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[512] = function() --欧阳锋加入，需杨过
	if hasppl(58) then
		say("义父！", 58)
		say("你，你是谁？", 60)
		say("是我啊！我是过儿！", 58)
		say("过儿？过儿？啊啊，我的头好痛！", 60)	
		say("杨兄小心！")
		if WarMain(304) then
			say("你使的是蛤蟆功！", 60)
			say("是啊，是你传授给我的蛤蟆功！", 58)		
			say("过儿！儿子！你是我的儿子！", 60)
			say("杨大哥，欧阳前辈这个样子，还是把他带回小村慢慢疗养才是。")
			say("说的也是....", 58)		
			say("义父，你跟我们回小村吧，来....", 58)
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景	
			if MPPD(0) == 0 and JY.Person[0]["品德"] <= 30 then
				say("嘿嘿嘿嘿，老毒物已经疯了，他的白驼山庄就由我接收啦。", 0)
				JoinMP(0, 8, 3)
			end			
			instruct_2(82,1)
			instruct_2(251,1)
			setteam(620, 1)
		else
			instruct_1(2149,60,0);   --  1(1):[欧阳锋]说: 不对，不对，我脑子有点不*清楚，我要一个人想想……
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景		
			say("义父....唉....", 58)
		end
	else
		instruct_1(2142,0,1);   --  1(1):[AAA]说: ＜这不是西毒欧阳锋吗？怎*么在这倒立……＞
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(2143,60,0);   --  1(1):[欧阳锋]说: 乖儿子，快叫爸爸！
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(2144,246,1);   --  1(1):[???]说: ＜不是吧，占我便宜……＞
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(2145,60,0);   --  1(1):[欧阳锋]说: 快叫爸爸，爸爸传授高深的*武功给你！
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(2146,0,1);   --  1(1):[AAA]说: ＜高深的武功？＞
		instruct_0();   --  0(0)::空语句(清屏)

		if instruct_11(1,0) ==false then    --  11(B):是否住宿是则跳转到:Label0
			do return; end
		end    --:Label0

		instruct_37(-1);   --  37(25):增加道德-1
		instruct_1(2147,247,1);   --  1(1):[???]说: ＜你不是我的＞*爸爸！
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(2148,60,0);   --  1(1):[欧阳锋]说: 哈哈哈，乖儿子，我现在就*把九阴真经传给你
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_2(82,1);   --  2(2):得到物品[逆运真经][1]
		instruct_0();   --  0(0)::空语句(清屏)
		if GetS(111, 0, 0, 0) == 0 then
	    say("乖儿子，我刚刚想到了一些招数，现在就传给你。",60) 
	    instruct_0();
			    if instruct_11(0,188) == true then
	                 QZXS("领悟逆运真经奥妙！")
	                 instruct_0();
	                 say("多谢爸爸（才怪）！",0) 
					 instruct_0()
	                 SetS(111, 0, 0, 0,104)
				else
				     say("乖儿子，我刚说什么来着？？",60) 
					 instruct_0()
					 say("（刚才等于白说啊。。。。。）",0) 
					 instruct_0()
				end	
		end		
		instruct_1(2149,60,0);   --  1(1):[欧阳锋]说: 不对，不对，我脑子有点不*清楚，我要一个人想想……
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		if MPPD(0) == 0 and JY.Person[0]["品德"] <= 30 then
			say("嘿嘿嘿嘿，老毒物已经疯了，他的白驼山庄就由我接收啦。", 0)
			JoinMP(0, 8, 3)
		end		
	end
end


OEVENTLUA[10020] = function() --郭襄支线1
	if not inteam(92) or not GX(92) then
		do return end
	end
	dark()
	light()
	say("......", 92)
	say("襄儿，你怎么了？")
	say("大哥，你愿意陪我在这城中走走吗？", 92)
	say("（为何襄儿刚一进这屋里就变得满腹沉重....）好....")
	addevent(-2, 16, 0, 10021, 3)
	addevent(-2, 17, 0, 10021, 3)
	addevent(-2, 11, 0, 0, 0)
	addevent(-2, 12, 0, 0, 0)	
	addevent(-2, 13, 0, 0, 0)	
end

OEVENTLUA[10021] = function() --郭襄支线2
	if not inteam(92) or not GX(92) then
		do return end
	end
	dark()
	light()
	say("这襄阳城真是好地方，民风淳朴，城町兴旺，又远离纷争，和平得很呐。",200,0,"酒客") 	
	say("唉，你知道什么！这襄阳城二十年前却是经历过重重战火洗礼，几乎就要生灵涂炭。",207,0,"酒客") 	
	say("真的？这是怎么回事？",200,0,"酒客") 	
	say("你久居塞外，自然不知。这城当年曾被外族侵略，眼看就要城破家亡，幸亏当年有一郭姓大侠挺身而出，领导武林中人奋力抗争，终于打退了外族。可惜他和他的妻子却战死沙场，以身殉城，可叹可敬啊！",207,0,"酒客") 	
	say("当年那郭大侠本来可以隐居世外桃源置身事外，却偏偏把一身精力放在这守城当中，据说他的一个女儿也因此流落民间，从此再也无了音讯。他时常说，行侠仗义济人困厄自然是我辈本分，可真正的侠之大者，却要抱着忧国忧民之心才是。",207,0,"酒客") 	
	say("好汉子！不愧那一句大侠的尊称！",200,0,"酒客") 	
	say("为国为民，侠之大者！来，为这八个字干一杯！",207,0,"酒客") 
	say("干！",200,0,"酒客") 	
	say("（郭大侠？殉城？刚刚那座屋子....难道是？）")
	say("大哥....我们去那边的桥上走走吧....", 92)	
	say("啊？好....")	
	addevent(-2, 15, 0, 10022, 3)
	addevent(-2, 14, 0, 10022, 3)
	addevent(-2, 16, 0, 0, 0)
	addevent(-2, 17, 0, 0, 0)	
end

OEVENTLUA[10022] = function() --郭襄支线3
	if not inteam(92) or not GX(92) then
		do return end
	end
	dark()
	light()
	say("大哥....这里风景真好....", 92)	
	say("襄儿....")	
	say("大哥，你可知道，我的名字，就来自于这座城呢。", 92)		
	say("啊？")		
	say("这里，是我爹娘当年相遇的地方。", 92)	
	say("桃李春风一杯酒，江湖夜雨十年灯。我娘当年，常常念着这句诗。", 92)	
	say("他们本来可以做对神仙眷侣，远遁江湖，可是我爹却偏偏把家国这两个字放在嘴边，然后守襄阳守了二十年。", 92)	
	say("我在这里出生，这里长大，可是我厌倦这里的一切，所以我终于离开了这里。", 92)	
	say("那一天，我听到襄阳城难，拼了命的往这里赶，可是只来得及亲手在江边埋葬了他们。", 92)	
	say("爹....娘....女儿看你们来了....", 92)		
	say("襄儿....")	
	dark()
	light()
	say("大哥，我们走吧。", 92)		
	say("嗯....")		
	say("别担心我，前面的路还长呢，不是吗？嘻嘻。", 92)		
	addevent(-2, 15, 0, 0, 0)
	addevent(-2, 14, 0, 0, 0)	
	addevent(-2, 18, 0, 10023, 3)	
	addevent(-2, 19, 0, 10023, 3)	
end

OEVENTLUA[10023] = function() --郭襄支线4
	if not inteam(92) or not GX(92) then
		do return end
	end
	if getzx(153) > 0 then
		do return end
	end
	dark()
	addevent(-2, 20, 0, 0, 0, 4108*2)	
	light()
	say("两位请留步。", 62)
	say("大和尚，你有什么事？", 92)
	say("小姑娘可是姓郭名襄？", 62)
	say("你怎么知道我的名字？", 92)	
	say("我与郭大侠乃过命的交情，已有二十余年不见，今闻郭大侠已经逝世，老僧心痛如绞，因此兼程赶来，要到他灵前去一拜。", 62)
	say("大和尚原来是我爹的好友，那倒是失敬了。", 92)	
	say("今天见到故人之女风采盈然，实在是老僧之幸。老僧下榻之处离此不远，两位愿意赏脸一叙吗？", 62)
	say("赏脸倒是不必，赏一巴掌倒是有的。我爹生前没说过有什么古怪和尚朋友，倒是有一蒙古僧人叫什么轮子的忒是讨厌，总是和他作对。大师看上去圆墩浑厚，倒是像个轮子，不知怎么称呼啊。", 92)	
	say("小丫头，竟然敢消遣我！", 62)
	say("嘿，就知道是你！装神弄鬼，我爹怎么可能有你这样鬼祟的朋友！", 92)	
	say("找死！", 62)
	say("襄儿小心！")	
	if WarMain(302) then
		addHZ(45) 
        AddPersonAttrib(92, "拳掌功夫", 10)
        AddPersonAttrib(92, "御剑能力", 10)
        AddPersonAttrib(92, "耍刀技巧", 10)
        AddPersonAttrib(92, "特殊兵器", 10)
		AddPersonAttrib(92, "暗器技巧", 10) --武骧金星：添加暗器
		tb("郭襄兵器值提升十点！")
	else --武骧金星：修正输给金轮也算赢的BUG
		instruct_15()
		do return end
	end		
	say("嘿，大哥做得好。封了你的穴，看你这和尚还嚣张！", 92)
	say("襄儿，我们要拿这和尚怎么办？")	
	say("恶和尚，姑娘今日不杀你，你以后可要知道好歹，不能再害人了罢！", 92)
	say("小姑娘心地倒好，老和尚很喜欢你啊！", 62)	
	say("啊！你不是被封穴了吗？", 92)	
	say("我金轮国师武功独步天下，难道这推经转脉，易宫换穴的粗浅功夫也不会么？小姑娘，你只须拜我为师，我便将这一身功夫，尽数传你。", 62)		
	say("你想得美！", 92)		
	say("嘿，这可由不得你。", 62)		
	say("啊！", 92)	
	say("哈哈，小姑娘乖乖跟我走吧！", 62)	
	say("襄儿！！！")	
	dark()
	addevent(-2, 20, 0, 0, 0, 0)	
	addevent(-2, 18, 0, 0, 0, 0)	
	addevent(-2, 19, 0, 0, 0, 0)	
	instruct_21(92)
	light()
	say("糟糕！襄儿被那老和尚捉走了，我得快点去找她！")	
	addevent(3, 20, 0, 10024, 3)	
end

OEVENTLUA[10024] = function() --郭襄支线5
	if instruct_20() then
		do return end
	end
	dark()
	addevent(3, 21, 1, 10024, 1, 4108*2)	
	light()
	say("老和尚，是你！快点把襄儿交出来！")	
	say("哼！我还要找她呢！你来得正好，等我把你捉了引她出来！", 62)	
	if WarMain(303) == false then
		instruct_15()
		do return end
	end
	say("哼！臭小子武功有进步，看在我徒弟份上今天就饶了你！", 62)	
	dark()
	addevent(3, 21, 0, 0, 0, 0)	
	light()
	say("徒弟....？")	
	say("大哥！", 92)	
	dark()
	addevent(3, 21, 1, 10024, 1, 4604*2)	
	light()	
	say("襄儿！你没事了？")	
	say("嗯，说来话长。那和尚捉了我之后，不知为何突然想收我为徒。我和他虛以委蛇了一番，趁机逃了出来....", 92)
	say("那就好....你没事吧？")
	say("我没事，他虽然是恶人，但对我却挺好的....", 92)	
	say("我们趁他找回来之前快点走吧。")	
	say("好....", 92)		
	dark()
	addevent(3, 20, 0, 0, 0, 0)	
	addevent(3, 21, 0, 0, 0, 0)	
	addpic(3, 21, 1)
	instruct_10(92)
	light()	
end

OEVENTLUA[837] = function() --幽冥符 924
	--TalkEx("东汉蔡邕之墓",0,2)
	instruct_1(3344, 0, 1)
	local pid = -1
	if hasppl(581) then pid = 581 end
	if hasppl(73) then pid = 73 end	
	if pid ~= -1 and hasthing(54) and (not hasHZ(76)) then
		say("蔡邕？那不就是制作这焦尾琴的蔡中郎么。这个叫小虾米的人好可恶....", pid)
		say("（看她这个样子，还是不要说我也去盗墓了的好....）")
		say("同为爱乐之人，我应该拜祭一下前辈的墓才是。", pid)
		dark()
		addevent(-2, -2, -2, 0, 0, 2770*2)
		light()
		say("咦？这东西是？", pid)
		addHZ(76)		
	end
end

OEVENTLUA[1046] = function() --耶律齐觉醒
	if hasppl(619) and JX(619) == false then
		say("师父，弟子磕头，您老人家万福金安。", 619)
		say("免礼平身！你小娃儿也万福金安！", 64)
		say("耶律兄原来是周前辈的弟子啊。（师徒本性也差太多了吧！）")
		say("来来，让我看看你武功有没有进步。", 64)
		if WarMain(305) then
			say("小娃子有进步！只是这分心二用的本事还差点火候，仔细看好了....", 64)
			dark()
			light()
			say("谢师父指点。", 619)
			tb("耶律齐学会左右互搏，攻防轻各加十五点！")
			setJX(619)
			setTF(619, 98)
			JY.Person[619]["左右互搏"] = 1
			AddPersonAttrib(619, "攻击力", 15)
			AddPersonAttrib(619, "防御力", 15)
			AddPersonAttrib(619, "轻功", 15)
		else
			say("小娃儿本事还差点，去练练再来！", 64)
		end
		do return end
	end
    instruct_1(3898,64,0);   --  1(1):[周伯通]说: 来来来，和老顽童过两招。
    instruct_0();   --  0(0)::空语句(清屏)
    if instruct_5(6,0) ==false then    --  5(5):是否选择战斗？是则跳转到:Label0
        instruct_1(3899,0,1);   --  1(1):[慕容惜花]说: 前辈别开玩笑了，晚辈哪里*是您的对手！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0
    if instruct_6(67,8,0,1) ==false then    --  6(6):战斗[67]是则跳转到:Label1
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(3900,64,0);   --  1(1):[周伯通]说: 你的功夫还不行，去练练再*来！
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_1(3901,64,0);   --  1(1):[周伯通]说: 小兄弟，你这是什么功夫？*教教我好不好？
    instruct_0();   --  0(0)::空语句(清屏)
	if not hasHZ(24) and checkpic(20, 0, 1) then --hasHZ(32) 武骧金星：修正BUG
		say("前辈别开玩笑了。")
		say("拜托你一定要教教我！不然我就不让你走！", 64)
	        if JY.Person[zj()]["左右互搏"] == 1 and GetS(111, 0, 0, 0) == 0 then
	          say("（随便教点东西打发他好了）那前辈请看清楚了....")
	          instruct_0();
			  say("哈哈，小兄弟，我也教你几招！", 64)	
			  instruct_0(); 
			      if instruct_11(0,188) == true then
	                 QZXS("领悟左右互搏精义！")
	                 instruct_0();
	                 say("多谢前辈",0) 
	                 SetS(111, 0, 0, 0,999)
				  else
				     say("不要啊？那算啦。",64)					 
				  end
		             tb("周伯通攻击力加二十点！")
		             AddPersonAttrib(64, "攻击力", 20)				  
				     addHZ(24)
                  do return; end
            end
		say("（随便教点东西打发他好了）那前辈请看清楚了....")
		dark()
		light()
		tb("周伯通攻击力加二十点！")
		AddPersonAttrib(64, "攻击力", 20)
		say("哈哈，小兄弟，下次来的时候叫你看看老顽童的进展！", 64)	
		addHZ(24)		
	end
end

OEVENTLUA[843] = function() --陆无双支线1
	if hasppl(92) and LWS(92) then
		say("表姊！", 92)
		say("双儿！你怎么会在这里？", 63)
		say("原来你们是表姊妹？")
		say("这事说来话长....当年.....", 63)
		dark()
		light()
		say("后来我找了个机会，就逃离了那魔头的身边，然后就跟着你到处跑了....", 92)
		say("对了，双儿，这是我桃花岛的旋风扫叶腿法，虽然不能根治你腿脚的旧伤，但也能让你行动更加方便。", 63)
		say("谢谢表姊。", 92)
		dark()
		AddPersonAttrib(92, "轻功", 20)		
		light()
		tb("陆无双轻功增加20点！")
		addHZ(80)
		say("那李莫愁随时可能回来找你们姊妹的麻烦，程姑娘不如随我们回小村，也好有个照应。")
		say("那就有劳公子了。", 63)
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_3(104,60,1,0,971,0,0,7244,7244,7244,-2,-2,-2);   --  3(3):修改事件定义:场景[襄阳城]:场景事件编号 [60]

		if instruct_20(19,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
			instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_10(63);   --  10(A):加入人物[程英]
			instruct_0();   --  0(0)::空语句(清屏)
			do return; end
		end    --:Label1
		instruct_1(12,63,0);   --  1(1):[程英]说: 你的队伍已满，我就直接去*小村吧。
		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
		instruct_3(70,30,1,0,155,0,0,6120,6120,6120,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [30]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		do return end
	end
    instruct_1(3357,0,1);   --  1(1):[慕容惜花]说: 适才听那李莫愁之言，姑娘*似乎是桃花岛主黄药师之徒*？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3358,63,0);   --  1(1):[程英]说: 不错，我算是恩师黄药师的*关门弟子吧。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3359,0,1);   --  1(1):[慕容惜花]说: 如此说来，姑娘武功一定是*不错的了。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3360,63,0);   --  1(1):[程英]说: 哪里哪里，恩师传我一套玉*箫剑法，我还未练得纯熟。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3361,0,1);   --  1(1):[慕容惜花]说: 那程姑娘可否与在下一游，*帮忙在下寻找那十四天书？
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_28(0,65,999,20,0) ==false then    --  28(1C):判断慕容惜花品德65-999是则跳转到:Label0
        instruct_1(3362,63,0);   --  1(1):[程英]说: 我看公子脸上泛有戾气，公*子还是多做些善事才是．
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,-2,0,844,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        do return; end
    end    --:Label0

    instruct_1(3363,63,0);   --  1(1):[程英]说:  嗯！好吧．*反正我一人在此也是无聊，*就随公子一游吧．
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(104,60,1,0,971,0,0,7244,7244,7244,-2,-2,-2);   --  3(3):修改事件定义:场景[襄阳城]:场景事件编号 [60]

    if instruct_20(19,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label1
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_10(63);   --  10(A):加入人物[程英]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label1

    instruct_1(12,63,0);   --  1(1):[程英]说: 你的队伍已满，我就直接去*小村吧。
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(70,30,1,0,155,0,0,6120,6120,6120,-2,-2,-2);   --  3(3):修改事件定义:场景[燕子坞]:场景事件编号 [30]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
end

OEVENTLUA[1051] = function() --瑛姑送寒阴箭七绝针
	TalkEx("小兄弟，多谢你了。我这二十多年研究出了两套武功，这就传授给你吧。", 237, 0, "瑛姑")
	addthing(281, 1)
	addthing(331)
	TalkEx("多谢前辈。", 0, 1) 
	instruct_3(-2, -2,1,0,1048,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
end

OEVENTLUA[730] = function()  --林平之觉醒
	if instruct_16(36) then  --是否在队伍
		TalkEx("余沧海，你还认得我吗？", 36, 1)  --对话
		Cls()  --清屏
		TalkEx("你，你，你是福威镖局的林*平之！", 24, 0)  --对话
		Cls()  --清屏
		TalkEx("不错，正是我！你为了辟邪*剑谱，害的我家破人亡，今*日，我就让你见识一下辟邪*剑法，你看清楚了！", 36, 1)  --对话
		Cls()  --清屏
		JY.Person[24]["武功1"] = 48
		JY.Person[24]["攻击力"] = JY.Person[24]["攻击力"] + 50
		JY.Person[24]["防御力"] = JY.Person[24]["防御力"] + 50
		JY.Person[24]["轻功"] = JY.Person[24]["轻功"] + 50
		if WarMain(51, 0) == false then  --战斗开始
			instruct_15()  --死亡
			Cls()  --清屏
			do return end  --无条件结束事件
			Cls()  --清屏

		else
			instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			Cls()  --清屏
			instruct_13()  --场景变亮
			instruct_37(-5)  --增加品德
			setJX(36)
			do return end  --无条件结束事件

		end
	else
		TalkEx("嘿嘿嘿，我要想办法把青城*派发扬广大……", 24, 0)  --对话
		Cls()  --清屏
		do return end
	end
end
--学葵花
OEVENTLUA[5000] = function()
		if JY.Person[0]["性别"] == 1 then
	       say("妹妹，以后你就是副教主了。",27);
		   say("（我什么时候成了你妹妹？。。。）",0);
           say("姐姐很早就想要一个你这样的妹妹了，嘻嘻。",27);
           say("姐。姐姐。。（反正也不会亏本？。。。）",0);
	    else
	       say("弟弟，以后你就是副教主了。",27);
           say("（我什么时候成了你弟弟？。。。）",0);
           say("姐姐很早就想要一个你这样的弟弟了，嘻嘻。",27);
           say("姐。姐姐。。（反正也不会亏本？。。。）",0);
	    end
if MPPD(0) ~= 0 then 
   		if JY.Person[0]["性别"] == 1 then
          say("那个..妹妹已经有门派了...",0);
	    else
	      say("那个..弟弟已经有门派了...",0);
	    end
		say("没关系，换一下门派而已。",27);  
		    if instruct_11(0,188) == true then	
               JoinMP(0,12,4)
			   say("姐姐会好好疼你的。",27);
			else   
               say("那就不勉强你了。",27);
		    end
else
JoinMP(0,12,4)
end
        if JY.Person[0]["性别"] == 1 then
say("好妹妹，姐姐教你葵花神功。",27);
say("（！！！我还不想变性啊！！！）",0);
instruct_2(93,1);   --  2(2):得到物品[葵花宝典][1]
say("放心好了，不会让妹妹失望的，这可是姐姐千辛万苦为妹妹准备的礼物哦。",27);
say("咦？男女都可以练？",0);
say("姐姐怎么可能害妹妹呢。",27);
	    else
say("乖弟弟，姐姐教你葵花神功。",27);
say("（！！！我还不想变性啊！！！）",0);
instruct_2(93,1);   --  2(2):得到物品[葵花宝典][1]
say("放心好了，不会让弟弟失望的，这可是姐姐千辛万苦为弟弟准备的礼物哦。",27);
say("咦？男女都可以练？",0);
say("姐姐怎么可能害弟弟呢。",27);
	    end
instruct_0();   --  0(0)::空语句(清屏)
	        if GetS(111, 0, 0, 0) == 0 then
				if instruct_11(0,188) == true then
				     say("谢谢东方姐姐！",0); 
					 instruct_0();
	                 QZXS("领悟葵花真解！")
	                 instruct_0();
	                 SetS(111, 0, 0, 0,105)
				else
				     say("姐姐的好意心领了。",0) 
					 say("那好吧。",27);
					 instruct_0()
				end	
			end	
        if JY.Person[0]["性别"] == 1 then
say("今天姐姐高兴，说吧，妹妹想要什么，姐姐都帮你取来",27);
say("东方姐姐可知道《笑傲江湖》此书？",0);
say("这本书到是听过，好像在华山岳不群那里，妹妹可是想要？姐姐帮你取来便是。",27);
say("不劳烦东方姐姐，妹妹自己动手便可。",0);
say("不愧是本教主的妹妹，有气魄，要是有什么麻烦直接叫上姐姐，姐姐帮你摆平。",27);
	    else
say("今天姐姐高兴，说吧，弟弟想要什么，姐姐都帮你取来",27);
say("东方姐姐可知道《笑傲江湖》此书？",0);
say("这本书到是听过，好像在华山岳不群那里，弟弟可是想要？姐姐帮你取来便是。",27);
say("不劳烦东方姐姐，弟弟自己动手便可。",0);
say("不愧是本教主的弟弟，有气魄，要是有什么麻烦直接叫上姐姐，姐姐帮你摆平。",27);
	    end
    instruct_3(57,1,1,0,913,0,0,5696,5696,5696,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [1]
    instruct_3(57,0,1,0,0,0,0,5694,5694,5694,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [0]
    instruct_3(57,32,1,0,900,0,0,5180,5180,5180,-2,-2,-2);   --  3(3):修改事件定义:场景[华山派]:场景事件编号 [32]
	instruct_3(-2,0,1,0,5001,0,0,5720,5720,5720,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5000]
end

OEVENTLUA[5001] = function()
        if JY.Person[0]["性别"] == 1 then
say("妹妹可是需要姐姐帮忙么。",27);
say("不劳烦姐姐，妹妹可以解决，就是来看看姐姐",0);
say("嘻嘻...真是可贴心的妹妹。",27);
	    else
say("弟弟可是需要姐姐帮忙么。",27);
say("不劳烦姐姐，弟弟可以解决，就是来看看姐姐",0);
say("嘻嘻...真是可贴心的弟弟。",27);
	    end
end

OEVENTLUA[5002] = function()
        if MPPD(0) ~= 11 and JY.Person[0]["觉醒"] > 0 then
            say("阁下来我刀宗有何贵干？",597);
            say("途经此地，特来拜会。",0);
            say("怕是阁下有备而来吧。",597);
            say("宗主英明，在下听闻刀宗乃是从东瀛而来，特来拜会。",0);
            say("我刀宗从未与中原有所接触，不知阁下所为何事？",597);
            say("不知宗主可否知晓天书？",0);
			say("哼哼，自然。",597);
			say("不知宗主为何抢我天书？",0);
			say("阁下可是在质疑本宗主？",597);
			say("在下不敢。",0);
			say("哼！本宗对天书并无兴趣，也未曾抢夺天书。",597);
			say("那不知从何而来的东瀛武士？",0);
			say("哦？那些家伙已经动手了么？阁下当真不走运。",597);
			say("听宗主之言，想来是知道些什么，望宗主明示。",0);
			say("一些野心勃勃之人，怕是想要入侵这中原大地吧。",597);
			say("！！！",0);
			say("我刀宗来中原不过是跟随本宗另一位宗主谢云流而来。",597);
			say("谢云流？",0);
			say("阁下无需知晓，只需知晓谢云流也是中原人便可。",597);
			say("阁下在江湖中寻找十四天书，想来应该会碰到他，若是遇到他，务必告诉本宗主。",597);
			say("若是在下遇到，定当告知宗主。",0);
			say("嗯？你果真是个麻烦，都追到本宗主这来了。",597);
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
			    --instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
				instruct_3(-2, 0, 0, 0, 0, 0, 0, 7260, 7260, 7260, -2, 16, 13) --加贴图
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
			say("宫本？你擅闯我刀宗可是想死？",597);	
			say("...宫本..只为此人而来...",516);	
			say("你想在我刀宗动手？。",597);	
			say("...宫本...不敢.",516);
			say("离开刀宗地界本宗主不管，但是在刀宗地界，谁敢擅自动手，可别怪本宗主不客气。",597);
			say("..多谢..宫本告辞。",516);
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
			    --instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
				instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, 16, 13) --加贴图
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景

			say("此人好大的杀气！！",0);
			say("这是自然，宫本乃是东瀛数一数二的高手，你在他手上走不过一招，不过宫本既然参与此事，阁下怕是麻烦了。",597);
			say(".....",0);
			say("想来抢夺阁下天书的便是他们吧。",597);
			say("多谢谢宗主救命之恩。",0);
			say("不用谢我，本宗规矩，刀宗之内禁止争斗。",597);
            say("在下为宗主所救却是事实。",0);
			say("随你如何想，本宗主无需阁下感谢。",597);
			say("........",0);
			say("森九岚，怕是需要你跑一趟了。",597);
			say("不知殿下有何吩咐？",929)
			say("陪这位少侠一同去寻找谢云流。",597);
			say("遵命。",929)
			say("若是他死在路途中，你便直接回来便是。",597);
			say("是。",929)
			say("............",0);
			say("阁下的路途怕是不平静了。",597);
				if instruct_20() then 
				setteam(929,1)
				say("我去小村等你。",929)
				else 
				instruct_10(929)
				end
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
			    instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
				instruct_3(-2, -2, 1, 0, 5007, 0, 0, -2, -2, -2, -2, -2, -2) --加贴图
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
				SetS(99,1,0,0,1)
		    	do return end
		end	
	say("（你到底去哪了呢？）",597);	
	say("实力不够到处乱跑可是会死的哦～",597);	
end

OEVENTLUA[5006] = function()
if XYL(0) then 
say("师傅！",929);
instruct_10(929)
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
		    	do return end
end
say("阁下有何见教？？",929);
end
OEVENTLUA[5007] = function()
say("还有事么？",597);
if MPPD(0) == 0 and JY.Person[0]["御剑能力"] >= 350 then 
say("我想加入刀宗，不知宗主可否答应？",0);
say("你？。。谢云流不在我还真不敢随便给他找徒弟，嘛，既然他给我找不自在，我也给他找一次。好吧我答应你了。",597);
say("多谢宗主",0);
say("如若叛门，杀无赦！",597);
say("弟子谨记。",0);
		if DrawStrBoxYesNo(-1, -1, "要学一刀流的武功么？", C_WHITE, 30) == true then 
			JoinMP(0, 11, 3) 
             instruct_35(zj(), 0, 131,999)	
			 if zj() == 0 and (putong() > 0 or teshu() > 0) then 
			 DrawStrBoxWaitKey(string.format("%s 学会武功 %s", JY.Person[zj()]["姓名"], JY.Wugong[131]["名称"]), C_ORANGE, CC.DefaultFont)
			 if DrawStrBoxYesNo(-1, -1, "要切换外功精通么？", C_WHITE, 30) == true then 
			    SetS(112,1,0,0,131)
			 end
			 end
		end
end
					if GetS(111,0,0,0) == 0 and JY.Person[0]["觉醒"] > 0 and JY.Person[0]["御剑能力"] >= 350 then
	                 say("你的实力已经可以学习太虚剑意，需要参悟么？",597)
			        if instruct_11(0,188) == true then
	                 QZXS("领悟太虚剑意！")
	                 instruct_0();
	                 say("多谢！",0) 
	                 SetS(111,0,0,0,180)
				    end
	                end	
end
OEVENTLUA[5008] = function()
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_14();   --  14(E):场景变黑
 instruct_3(-2, 0, 0, 0, 0, 0, 0, 9398, 9398, 9398, -2, 27, 31) --加贴图
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_13();   --  13(D):重新显示场景
 if XYL(0) then 
    say("师傅，您回来啦？",929);
	say("顺道回来看看，对了，无悠那丫头呢？",0)
	say("公主殿下出去找您去了。",929);
	say("那算了，你随我走一趟吧，有些事情需要处理。",0)
	say("是，师傅。",929);
				if instruct_20() then 
				say("我去小村等你。",929)
				setteam(929,1)
				else 
				instruct_10(929)
				end
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
			    instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
				instruct_3(-2, -2,0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
				instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景
		    	do return end
 end
 if JY.Person[0]["觉醒"] > 0 then
    say("何人擅闯刀宗？",929);
	say("在下恰逢路过，特来拜会。",0)
	say("让他进来吧。",597);
	say("遵命。",929);
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_14();   --  14(E):场景变黑
instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, 27, 31) --加贴图
instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2) --加贴图
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_13();   --  13(D):重新显示场景
 do return end
 end
    say("何人擅闯刀宗？",929);
	say("在下恰逢路过，特来拜会。",0)
	say("此地不欢迎任何人，请回。",929);
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_14();   --  14(E):场景变黑
 instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, 27, 31) --加贴图
    instruct_19(28,32);   --  19(13):主角移动至19-14
    instruct_40(0);   --  40(28):改变主角站立方向0
 instruct_0();   --  0(0)::空语句(清屏)
 instruct_13();   --  13(D):重新显示场景
 --instruct_3(113, 3, 0, 0, 0, 0, 5008, 0, 0, 0, -2, 28, 31) --加贴图 --1-26-
end
OEVENTLUA[5003] = function()
if hasthing(147) then 
say("这是？？",0);
addthing(339)
instruct_3(-2, -2, -2, 0, 5004, 0, 0, -2, -2, -2, -2, -2, -2)
end
end

OEVENTLUA[5004] = function() --放水之战
if MPPD(zj()) == 7 and MPDJ(zj()) >= 2 then 
say("这是？？",0);
SetS(86, 1, 9, 5, 1)
SetS(86, 2, 13, 5, 3)
if WarMain(226) then
say("我逍遥派就靠你传承了。",116)
SetS(111,0,0,0,998)
JoinMP(0,7,5)
SetS(86, 2, 13, 5, 1)
SetS(86, 1, 9, 5, 0)
instruct_3(-2, -2, -2, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
end
SetS(86, 2, 13, 5, 1)
SetS(86, 1, 9, 5, 0)
instruct_3(-2, -2, -2, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
end
end

OEVENTLUA[5005] = function() --放水之战
if JY.Person[0]["觉醒"] > 0 then 
local aa = 0
for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do
if yongnei(JY.Person[0]["武功"..i]) and JY.Person[0]["武功"..i] > 0 then
   aa = aa + 1
end
end
if aa < 2 then 
   do return end
end  
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_14();   --  14(E):场景变黑
				instruct_3(-2, -2, -2, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
				                instruct_0();   --  0(0)::空语句(清屏)
                instruct_13();   --  13(D):重新显示场景

say("我闯荡江湖这么多年，终究是走他人之路，我为何不走出自己的路，今日我便自创属于我自己的武功！！")
instruct_0(); 
local menu
	local WGid
	Cls();
	DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,"选择融合功体", C_WHITE, CC.DefaultFont);
	menu = {};
	for i = 1, HHH_GAME_SETTING["WG_COUNT_MAX"] do
		WGid = JY.Person[0]["武功"..i];
		if yongnei(WGid, 0) and WGid ~= 91 then	---显示内功
		   menu[#menu + 1] = {JY.Wugong[WGid]["名称"],nil,1,WGid};
		end
	end
	local r = ShowMenu(menu,#menu,0,CC.MainSubMenuX,CC.MainSubMenuY+CC.SingleLineHeight,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
	if r <= 0 then
		return 0
	end	

	JY.Thing[224]["加攻击力"] = menu[r][4] --设置功体
	local a = 0
	for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	   if JY.Person[0]["武功"..i] == JY.Thing[224]["加攻击力"] then 
	     -- JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		 a=i
	   end
	end
		Cls()
		DrawStrBox(CC.MainSubMenuX, CC.MainSubMenuY,"选择融合功体", C_WHITE, CC.DefaultFont);
		menu = {};
		for i = 1, HHH_GAME_SETTING["WG_COUNT_MAX"] do
			WGid = JY.Person[0]["武功"..i];
			if yongnei(WGid, 0) and WGid ~= 91 and WGid ~= JY.Thing[224]["加攻击力"] then	---显示内功
			   menu[#menu + 1] = {JY.Wugong[WGid]["名称"],nil,1,WGid};
			end
		end	
		local r = ShowMenu(menu,#menu,0,CC.MainSubMenuX,CC.MainSubMenuY+CC.SingleLineHeight,0,0,1,1,CC.DefaultFont,C_ORANGE,C_WHITE);
		if r <= 0 then
			return 0
		end	
    
	JY.Thing[224]["加防御力"] = menu[r][4] --设置功体
	JY.Person[0]["武功"..a] = 9999
	JY.Person[0]["武功等级"..a] = 999
	local a = 0
	for i = 1,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	   if JY.Person[0]["武功"..i] == JY.Thing[224]["加防御力"] then 
	     -- JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		 a=i
	   end
	end
    for i = a,HHH_GAME_SETTING["WG_COUNT_MAX"] do 
	      JY.Person[0]["武功"..i] = JY.Person[0]["武功"..i+1]
		  JY.Person[0]["武功等级"..i] = JY.Person[0]["武功等级"..i+1] 
	end
		JY.Person[0]["武功"..HHH_GAME_SETTING["WG_COUNT_MAX"]] = 0
		JY.Person[0]["武功等级"..HHH_GAME_SETTING["WG_COUNT_MAX"]] = 0
		
	JY.Thing[224]["名称2"] = "";
	while JY.Thing[224]["名称2"] == "" do
		JY.Thing[224]["名称2"] = Shurufa(32, CC.ScreenH - 6 * CC.Fontbig)
		if JY.Thing[224]["名称2"] == "" then
			DrawStrBoxWaitKey("请给你的武功命名", C_WHITE, 30)
		end
	end
	JY.Wugong[9999]["名称"] = JY.Thing[224]["名称2"]
	say("终于练成了，哈哈哈哈！")
instruct_3(-2, -2, -2, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
end
end

OEVENTLUA[498] = function() --止水
    say("你准备好了吗？",129,0);   --  1(1):[???]说: 你准备好了吗？
    instruct_0();   --  0(0)::空语句(清屏)
    if instruct_6(177,8,0,1) == false then
	say("少侠还需努力一番。",129,0);
    do return end 
    end
	instruct_2(77,1)----  2(2):得到物品[先天功][1]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    say("好，好，少侠武功盖世，这*本书理应归少侠所有。",129,0);   --  1(1):[???]说: 好，好，少侠武功盖世，这*本书理应归少侠所有。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(148,1);   --  2(2):得到物品[射鵰英雄传][1]
    instruct_0();   --  0(0)::空语句(清屏)
	       if GetS(111, 0, 0, 0) == 0 then
	          say("少侠身具先天功，却是未能领悟其中之奥妙，可需要本座为少侠指点一番？",129) 
	          instruct_0();
			      if instruct_11(0,188) == true then
	                 QZXS("领悟先天功奥秘！")
	                 instruct_0();
	                 say("多谢重阳真人！",0) 
	                 SetS(111, 0, 0, 0,100)
				  else
				     say("既如此，相信少侠才智过人，应当能自行领悟。",129) 
				  end 
           end

    if instruct_16(59,0,167) ==true then    --  16(10):队伍是否有[小龙女]否则跳转到:Label2
        say("你是王重阳。",59,0);   --  1(1):[小龙女]说: 你是王重阳。
        instruct_0();   --  0(0)::空语句(清屏)
        say("？不知这位姑娘是？",129,0);   --  1(1):[???]说: ？不知这位姑娘是？
        instruct_0();   --  0(0)::空语句(清屏)
        say("看招！",59,0);   --  1(1):[小龙女]说: 看招！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(248,74,0,1) ==false then    --  6(6):战斗[248]是则跳转到:Label3
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_13();   --  13(D):重新显示场景
            say("原来是朝英的传人，你为什么挑战本座？",129,0);   --  1(1):[???]说: 原来是朝英的传人，你为什么挑战本座？
            instruct_0();   --  0(0)::空语句(清屏)
            say("古墓石棺。",59,0);   --  1(1):[小龙女]说: 古墓石棺。
			instruct_0();   --  0(0)::空语句(清屏)
            say("原来如此，唉，可笑我枉为修道之人，却看不透胜败，以致...唉...",129,0);   --  1(1):[???]说: 原来如此，唉，可笑我枉为修道之人，却看不透胜败，以致...唉...
            instruct_0();   --  0(0)::空语句(清屏)
            say("......",59,0);   --  1(1):[小龙女]说: ......
            instruct_0();   --  0(0)::空语句(清屏)
            say("以你现在的功力，虽然在武林中也算不错，但还是有所不足，我指点你一番吧。",129,0);   --  1(1):[???]说: 以你现在的功力，虽然在武林中也算不错，但还是有所不足，我指点你一番吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_14();   --  14(E):场景变黑
            instruct_35(59,1,107,0);   --  35(23):设置小龙女武功1:九阴神功攻击力0
            instruct_35(59,2,100,0);   --  35(23):设置小龙女武功2:先天功攻击力0
            instruct_13();   --  13(D):重新显示场景
            instruct_0();   --  0(0)::空语句(清屏)
            say("咱们有缘再见！",129,0);   --  1(1):[???]说: 咱们有缘再见！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(-2,0,1,0,499,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
            instruct_0();   --  0(0)::空语句(清屏)
--end

        end    --:Label3

        instruct_13();   --  13(D):重新显示场景
        instruct_0();   --  0(0)::空语句(清屏)
        say("原来是朝英的传人，你为什么挑战本座？",129,0);   --  1(1):[???]说: 原来是朝英的传人，你为什么挑战本座？
        instruct_0();   --  0(0)::空语句(清屏)
        say("古墓石棺。",59,0);   --  1(1):[小龙女]说: 古墓石棺。
		instruct_0();   --  0(0)::空语句(清屏)
        say("原来如此，唉，可笑我枉为修道之人，却看不透胜败，以致....唉....",129,0);   --  1(1):[???]说: 原来如此，唉，可笑我枉为修道之人，却看不透胜败，以致...唉...
        instruct_0();   --  0(0)::空语句(清屏)
        say("......",59,0);   --  1(1):[小龙女]说: ......
        instruct_0();   --  0(0)::空语句(清屏)
        say("也罢，你师祖一生都想胜过我，导致她在古墓里孤老终生，我也心中有愧，你也胜过我也算了一桩心愿。",129,0);   --  1(1):[???]说: 也罢，你师祖一生都想胜过我，导致她在古墓里孤老终生，我也心中有愧，你也胜过我也算了一桩心愿。
        instruct_45(59,20);   --  45(2D):小龙女增加轻功30
        instruct_47(59,20);   --  47(2F):小龙女增加攻击力30
        instruct_46(59,1000);   --  46(2E):小龙女增加内力2000
        instruct_48(59,100);   --  48(30):小龙女增加生命200
        instruct_0();   --  0(0)::空语句(清屏)
        say("咱们有缘再见！",129,0);   --  1(1):[???]说: 咱们有缘再见！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
        instruct_3(-2,0,1,0,499,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_0();   --  0(0)::空语句(清屏)
		addHZ(27)
--end

    end    --:Label2

    say("咱们有缘再见！",129,0);   --  1(1):[???]说: 咱们有缘再见！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,0,1,0,499,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_0();   --  0(0)::空语句(清屏)
end

OEVENTLUA[486] = function() --止水
say("洪帮主，近来可好？")
say("我现在只是个糟老头儿，再*也没半点功夫了。",69)
say("洪帮主不必担心，一灯大师*让晚辈给您带来了疗伤之法。")
say("什么疗伤之法？",69)
say("据一灯大师讲，这是九阴真*经中记载的疗伤圣法，您依*照此法练功，很快就能复原*。")
say("当真？待我练来。",69)
dark()
light()
say("这九阴真经真是一部奇书啊*，我这么重的伤势也能复原*。小兄弟，谢谢你啊。",69)
say("洪帮主何必客气。")
if GetS(111,0,0,0) == 0 then 
say("你为老叫花的伤势也是费心了，观你一路作为，也是光明磊落之人，帮老叫花师徒许多。",69)
say("老叫花传你一门功夫，你可愿学？",69)
if yesno("是否要学？") then 
	QZXS("领悟擒龙功！")
	say("多谢洪老前辈!") 
	instruct_0();
	SetS(111, 0, 0, 0,178)
	addthing(338)
end
end
say("我听说你正在寻找十四天书*？",69)
say("是啊，洪老前辈可有线索？")
say("据我所知，《射鵰英雄传》*一书，应该是在重阳真人手*上。",69)
say("可是重阳真人已经仙去了呀*？")
say("此书被全真教视为镇教至宝*，应该会传给下一代掌门。",69)
say("你老人家的意思是，此书现*在丘真人手上？")
say("我也只是猜测。",69)
say("多谢洪前辈指点。<去重阳宫吧>")
addevent(-2,0,1,487,1)
addevent(19,0,1,496,1)
end

