--占用[5009-6000]
OEVENTLUA[5009] = function() --欢总移驾刀宗
if XYL(0) then 
say(".....................",455)
say(".....................",0)
say(".....................",455)
say("你为何在我刀宗？",0)
say(".....................",455)
say(".....................",0)
say("无悠让我来的....",455)
say("....那丫头，算了既然她让你来的你就留在这吧，帮我照顾好她。",0)
say("这是自然。",455)
instruct_3(-2,-2,-2,0,5010,0,0,-2,-2,-2,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
elseif cxzj() == 597 then 
say("不知小公主有何吩咐？",455)
say("无事，来看看。",0)
elseif cxzj() == 929 then 
say("公主殿下吩咐说让你送一份好酒过去。",0)
say("我这就去。",455)
else
say(".....................",455)
say(".....................",0)
say(".....................",455)
say(".....................",0)
say("这年头当个小兵也不容易，少侠别来无恙？",455)
say(".....................",0)
say("少侠何故如此看在下？",455)
say(".....................",0)
say(".....................",455)
say(".....................",0)
say(".....................",455)
say("隐士高人当真是行事不拘一格。",0)
say(".....................",455)
say("龙门一战当真是吓晚辈一跳。",0)
say("在下无心比斗，只愿安心当一个小兵。",455)
say("多谢前辈当日放水，在下感激不尽。",0)
say("我早已没有了争强好胜的心，无需谢我。",455)
say("听当日前辈所言，前辈也是江湖中数一数二的高手，为何隐退在此？",0)
say(".....................",455)
say("晚辈唐突了。",0)
say("无妨，只是有些感慨罢了。",455)
say("当年四兄弟何等意气风发，欲称霸一方。",455)
say("不想却因理念不合各奔东西，多年未曾再见。",455)
say("如非如此，想必如今早已一统天下。",455)
say("不知各位前辈都是何名讳？",0)
say("我大哥改名研究佛理不问世事，名讳我也不方便透露，想来你也没有机会遇见他。",455)
say("二哥独孤，专研武学但求一败，现已改名独孤求败。",455)
say("三哥君宝，如今已开宗立派，江湖人称张真人。",455)
say("张真人的名讳晚辈早有耳闻，想来前辈的其他几位兄长也是高人。",0)
say("而我隐姓埋名，只想安稳度过一生。",455)
say("行走江湖少不得与人打交道，莫要争强好胜。",455)
say("晚辈谨记。",0)
instruct_3(-2,-2,-2,0,5010,0,0,-2,-2,-2,-2,-2,-2);--修改事件定义:当前场景当前场景事件编号
end
end

OEVENTLUA[5010] = function() --欢总移驾刀宗
if XYL(0) then 
say("无悠那丫头回来让她莫要到处乱跑",0)
say("好的。",455)
else 
say("少侠无事可来看看樱花。",455)
if GetS(99,1,0,0) == 1 and GetS(99,1,1,0) == 0 then 
say("若是惹上了麻烦，可以来此暂避。",455)
SetS(99,1,1,0,1)
end
say("好的。",0)
end
end

OEVENTLUA[5011] = function() --昆仑派门卫
say("掌门已经*率领众弟子前去围剿明教了，现在不接待任何人，速速离去。",192)
end

OEVENTLUA[5012] = function() --昆仑仙境
say("。。居然死了，当真可惜，死者为大，入土为安，不要怪我。")
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
	instruct_3(-2,4,1,0,0,0,0,3348*2,3348*2,3348*2,-2,29,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	instruct_3(-2,5,1,0,0,0,0,3348*2,3348*2,3348*2,-2,27,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(-2,6,1,0,0,0,0,3350*2,3350*2,3350*2,-2,29,12);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	instruct_3(-2,7,1,0,0,0,0,3350*2,3350*2,3350*2,-2,27,12);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_17(11,1,29,47,0) --  3(3):修改事件定义:场景[明教]:大门开关
    instruct_19(28,14);   --  19(13):主角移动至2D-12
    instruct_40(0);   --  40(28):改变主角站立方向1
	instruct_3(-2,0,1,0,0,0,0,4702*2,4702*2,4702*2,-2,28,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
say("嗷！！！！！", 613)
say("什么东西？！！！！！", 0)
	if WarMain(320) == false then
		instruct_15()
		return
	end
	light()
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	addthing(83)
say("这是！！这猴子身上竟有如此神功秘籍！", 0)
say("大难不死必有后福，果然如此。", 0)
end

OEVENTLUA[5013] = function() --昆仑仙境石碑
say("青莲剑仙李白题字。")
end

OEVENTLUA[5014] = function() --明教灭3X
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
say("咦？好像有人说话……", 0)
    instruct_0();   --  0(0)::空语句(清屏)
	instruct_25(29,27,29,15) --场景移动
say("你到底是什么人，怎么进入*我明教的？", 12)
say("你问我成崑怎麽进来的？当*然是大摇大摆走进来的。", 18)	
say("你是混元霹雳手成崑，*谢法王的师父？", 14)
say("没错，*我就是那头笨狮的师父。**拜他的鲁莽所赐，你们和六*大派结下了这麽多梁子。", 18)
say("今天起明教就将化为灰烬，*也了结了我多年来的心愿。", 18)
say("要是我猜的没错，这中间的*一切都是你苦心安排的。", 11)	
say("杨左使倒还蛮聪明的嘛。***没错，激起谢逊的愤怒，*让他到处乱杀人，*留下我的名字好激我现身，*到最后再故意让江湖人知道*其实是明教谢逊所为，引起*江湖各大派与明教间仇杀，*这一切都是我精心计画的。", 18)
say("你为何要如此做？", 14)
say("要问就去问你们前任教主*阳顶天。我原本一桩美好的*姻缘却被他活生生拆散了，*明明是我爱妻，只因他当*上了魔教的大头子，就将我*爱妻霸占了去。*因此我心中便立下重誓：*只要我成崑还有一口气在，*定要让魔教永无宁日。*我立下此誓已有二十余年，*今日方见大功告成。**哈哈！", 18)
say("如今你们明教众高手已经中*了我的暗算，我今日不杀你*们，明日你们就眼看着明教*的覆灭吧，哈哈哈……", 18)
say("哼，我等纵然是死，你不会让你好过！", 11)
say("啊！杨逍，想不到你居然还有后手！", 18)
instruct_30(29,27,29,18);   --  30(1E):主角走动27-49--27-34
instruct_25(29,18,29,29) --场景移动
say("各位当真是好雅兴，可否带上我呢？", 0)
say("谁？！", 18)
say("各位不用紧张，在下所图不过一本书而已，不知谁能给在下解惑呢？", 0)
say("（这小子看起来也不是个善类，或许可以借他之手除掉这几个人）", 18)
say("这....", 11)
say("......", 14)
say("......", 12)
say("这位少侠不知想要何书？", 18)
say("天书。", 0)
say("（天助我也）此事我倒是知道一二。", 18)
say("不知大师可否告知在下？", 0)
say("若是少侠助我除掉明教，我便告知少侠天书下落。", 18)
say("大师此言当真？可莫要诓我。", 0)
say("少侠尽管放心便是。", 18)
say("好，一言为定。", 0)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 11)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 12)
say("熊熊圣火，焚我身躯，生亦何欢，死亦何苦。", 14)
SetS(11,60,15,0,1)
	if instruct_6(255) ==false then    --光明圣火阵
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
		instruct_0();   --  0(0)::空语句(清屏)
	end
	light()
    instruct_3(-2,90,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(-2,94,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(-2,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
instruct_37(-2)
say("大师的要求我已经办到了，还请大师不要食言。", 0)
say("汝阳王府有一本少侠所需的天书。", 18)
say("......", 0)
say("少侠不必多疑，我可将少侠引荐给郡主，以少侠的武艺必将受郡主器重。", 18)
say("届时少侠便可趁机取得天书。", 18)
say("听大师所言，想必大师也是那郡主麾下，大师不怕我告诉那郡主？", 0)
say("郡主自会明断是非。", 18)
say("暂且相信大师所言，如若大师骗我，我自会找大师讨个说法。", 0)
say("自然。六大派已在山下，少侠可随我从密道离去，转道去绿柳山庄便可。", 18)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,103,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [103]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_3(-2,106,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [106]
    instruct_3(-2,107,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [107]
    instruct_3(13,101,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [101]
    instruct_3(13,102,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [102]
    instruct_3(13,0,1,0,5016,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [0]
    instruct_3(13,1,1,0,5016,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 [1]
	instruct_3(-2,100,1,0,5015,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [100]
say("（这和尚眼神不对，想来没说实话，先撤再说）", 0)
end

OEVENTLUA[5015] = function() --小昭
say("我叫小昭，是这里的丫鬟。",66)
say("＜哇，怎会有如此美丽的姑*娘！＞",0)
say("欸，公子，你干嘛一直看着*我？",66)
say("姑娘，明教已灭，你一人留在此处怕是有危险，何不跟我一起离去？",0)
say(".......",66)
say("六大派已经攻入光明顶，再不走就来不及了，快跟我走。",0)
say("多谢公子。",66)
instruct_37(2)
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,100,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 [100]
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
	instruct_3(104,53,1,0,972,0,0,7052,7052,7052,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 
	if instruct_20(4,0) == false then 
	instruct_10(66)
	do return; end
	end
say("你的队伍已满，我就直接去*小村吧。",66)
instruct_3(70,38,1,0,157,0,0,7008,7008,7008,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 
end

OEVENTLUA[5016] = function() --乾坤大挪移
say("莫非这二人竟是阳顶天夫妇*？这里有封信，看看写些什*麽：",0)
say("今余神功第四层初成，*即悉成崑之事，*血气翻涌不克自制，*真力将散，行当大归。*天也命也，复何如耶？**今余命在旦夕，*有负衣教主重托，*实为本教罪人。*盼夫人持余亲笔遗书，*召聚众人，令谢逊暂摄副教*主之位，处份本教重务。。",221,0,"阳顶天") 
say("原来阳教主是在练功时，*因知悉成崑的事后，*不慎走火入魔了。*而阳教主夫人。。。。*这里有把匕首，*看来是因愧疚而自杀了。*这个羊皮卷，大概就是他*当时在练的神功吧。",0)
instruct_2(74)
instruct_0();   --  0(0)::空语句(清屏)
if inteam(66) then 
say("公子，小昭能看看么？",66)
say("嗯？拿去看吧。",0)
say("多谢公子。",66)
instruct_35(66,2,97,0)
instruct_35(0,2,97,0)
tb("小昭学会乾坤大挪移")	
end
instruct_3(11,100,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,0,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,1,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶]:场景事件编号 100
instruct_3(-2,3,1,0,267,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[光明顶密道]:场景事件编号 3
instruct_3(68,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [3]
instruct_3(68,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [13]
instruct_3(68,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [4]
instruct_3(68,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [5]
instruct_3(68,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [6]
instruct_3(68,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑派]:场景事件编号 [7]
instruct_3(34,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [0]
instruct_3(34,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [1]
instruct_3(34,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [3]
instruct_3(34,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [4]
instruct_3(34,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [5]
instruct_3(34,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [6]
instruct_3(34,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崆峒]:场景事件编号 [7]
instruct_3(33,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [2]
instruct_3(33,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [3]
instruct_3(33,4,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [4]
instruct_3(33,5,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [5]
instruct_3(33,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [6]
instruct_3(33,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [7]
instruct_3(33,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [8]
instruct_3(33,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [9]
instruct_3(33,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [10]
		for i = 7, 10 do
			addevent(106, i, 0, 5017, 3)
		end
end

OEVENTLUA[5017] = function()
	if instruct_20() then
		do return end
	end
	dark()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	addevent(-2, 2, 0, 0, 0, 3046*2)
	addevent(-2, 5, 0, 0, 0, 3046*2)
	addevent(-2, 6, 0, 0, 0, 3046*2)
	light()
	bgtalk("只见眼前一人是个年轻公子，轻摇折扇，掩不住一副雍容华贵之气。相貌俊美，双目黑白分明，炯炯有神。只见其腰间悬着一柄长剑，剑柄上赫然镂着“倚天”两个篆文。")
	say("（这人分明是男扮女装，她身上那把剑难道是灭绝的倚天剑？）")
	say("（当真是英雄少年）少侠就是成师傅推荐的人吧，不过这绿柳山庄不收闲杂人物，这就请少侠证明一下自己吧。", 639)
	say("阿三，你就和这位少侠比一下拳脚吧。", 639)
	say("少侠请！", 640)
	if WarMain(351) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	say("阿二，你上。", 639)
	say("是！", 641)	
	if WarMain(352) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()	
	say("阿大，你去试一试少侠的剑法。", 639)
	say("是！", 642)	
	if WarMain(353) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	light()
	addHZ(63)
	say("很好！不愧是成师傅推荐的人才。在下赵敏，刚才多有得罪，向少侠赔不是了。", 639)
	say("赵姑娘客气了，不知姑娘身上的这把剑....")
	say("少侠猜的没错，各大派的人就囚在我这山庄内，少侠不妨随我出去一看。", 639)
	dark()
	null(-2, 1)
	null(-2, 2)
	null(-2, 5)
	null(-2, 6)
	addevent(-2, 15, 1, 5018, 1, 3046*2)
	addevent(-2, 16, 1, 5018, 1, 3046*2)
	addevent(-2, 17, 1, 5018, 1, 3046*2)
	light()
	instruct_10(639)
end

OEVENTLUA[5018] = function()
	if not hasppl(639) then
		say("......", 642)
		do return end
	end
	say("去把几位掌门请出来吧。", 639)
	say("是！", 642)
	dark()
	addevent(-2, 4, 0, 0, 0, 2685*2)
	addevent(-2, 11, 0, 0, 0, 2685*2)
	addevent(-2, 12, 0, 0, 0, 2685*2)
	addevent(-2, 13, 0, 0, 0, 2681*2)
	addevent(-2, 14, 0, 0, 0, 2709*2)
	addevent(-2, 3, 0, 0, 0, 2677*2)
	light()
	say("诸位掌门，这里的规矩你们是知道的了，如果你们能胜得了这位少侠，你们立刻就能走。如若败了，那便留下吧。", 642)
	say("那么少侠请吧。", 639)
	say("（原来她命人逐一与各家掌门相斗，她在旁察看，得以偷学各门各派的精妙招数，当真好计谋）")
	if WarMain(354) then
		instruct_35(639,0,37,0)
		addthing(124)	
		instruct_37(-1) 
	end			
	if WarMain(355) then
		instruct_35(639,1,60,0)
		addthing(142)
		instruct_37(-1)
	end			
	if WarMain(356) then
		instruct_35(639,2,23,0)
		addthing(89)
		instruct_37(-1)
	end			
	if WarMain(150) then
		instruct_35(639,3,41,0)
		addthing(120)	
		instruct_37(-1)
	end			
	daode(-4)
	say("（看来此人和六大派并无瓜葛）好了，送他们上路。", 639)
	dark()
	null(-2, 4)
	null(-2, 11)
	null(-2, 12)
	null(-2, 14)
	null(-2, 13)
	null(-2, 3)
	null(-2, 15)
	null(-2, 16)
	null(-2, 17)
	light()
	say("少侠武功果然高强，六大派如今只剩下少林武当，若少侠能帮我平了这两大派，本郡主自有重赏。", 639)
	say("好，一言为定。",0)
    instruct_3(28,100,0,0,0,0,5019,0,0,0,0,39,43);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
	instruct_3(28,101,0,0,0,0,5019,0,0,0,0,39,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
	instruct_3(28,102,0,0,0,0,5019,0,0,0,0,39,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [10]
end

OEVENTLUA[5019] = function()
if hasthing(147) and hasthing(151) then 
dark()
instruct_19(36,38)
    instruct_3(-2,100,0,0,0,0,0,0,0,0,0,39,43);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,101,0,0,0,0,0,0,0,0,0,39,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,102,0,0,0,0,0,0,0,0,0,39,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 
	instruct_3(-2,12,0,0,0,0,0,-2,-2,-2,-2,33,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
    instruct_3(-2,103,0,0,0,0,0,5420,5420,5420,-2,32,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,104,0,0,0,0,0,5420,5420,5420,-2,32,37);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,105,0,0,0,0,0,5420,5420,5420,-2,32,36);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,106,0,0,0,0,0,5420,5420,5420,-2,32,35);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,107,0,0,0,0,0,5420,5420,5420,-2,32,39);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,108,0,0,0,0,0,5420,5420,5420,-2,32,40);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,109,0,0,0,0,0,5420,5420,5420,-2,32,41);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,9,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(93,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(93,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("施主来我少林，不知有何见教？",70)
say("在下前来领教少林绝学。",0)
say("我见施主满身杀气，怕是来者不善。",70)
say("那又如何?",0)
say("施主，我佛慈悲，望施主放下屠刀立地成佛。",70)
say("可惜在下不信佛。",0)
say("阿弥陀佛。",70)
say("老和尚，你也不用费口舌了，六大派只剩下少林和武当，带我灭了你少林，下一个便是武当。",0)
say("阿弥陀佛。",70)
say("不说话，那我便不客气了。",0)
dark()
    instruct_3(-2,14,0,0,0,0,0,-2,-2,-2,-2,33,36);   --  3(3):修改事件定义:场景[峨眉]:场景事件编号 [12]
light()
say("阿弥陀佛。",114)
say("！！（这老和尚来时竟无半点动静！）老和尚你又是谁？。",0)
say("小僧只是一扫地僧。",114)
say("少林果然卧虎藏龙，一个扫地僧居然有如此能耐。",0)
say(".....",70)
say("小僧不愿多生事端，奈何少林已至生死存亡的地步。",114)
    if WarMain(80) == false then
	   instruct_15()
	   do return; end
	end
	instruct_37(-5)
	addHZ(114)
	addthing(168)
	addthing(171)
	addthing(69)
	addthing(273)
	addthing(85)
	addthing(92)
	addthing(276)
	instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
    instruct_3(-2,103,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,104,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,105,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,106,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,107,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,108,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
	light()
say("大师可有遗言交代？",0)
say("咳咳...只望施主不要再造杀孽。",114)
say(".....",0)
say("嗯？什么人？",0) 
dark() 
  instruct_3(-2,109,0,0,0,0,0,4643*2,4643*2,4643*2,-2,33,35);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("大哥，跟我走。",455) 
dark() 
  instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
  instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("该死，哪来这么多高手。",0) 
say("本郡主到时小瞧了这少林寺，居然还有如此多的高手。",639) 
say("以防万一，来人，放火给我烧了这少林寺。",639) 
dark() 
instruct_3(-2,109,0,0,0,0,0,3550*2,3550*2,3550*2,-2,33,38);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("阿弥陀佛。",615)
say(".......",0) 
say(".......",639)
say("施主，打那来回哪去吧。",615)
say("！！！",0) 
	CC.DYRW = 0
	CC.DYRW2 = 615
	if WarMain(341) then 
	   rewardRW(7)
	   addthing(256) addthing(257) addthing(258) 
	end
instruct_3(-2,109,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[少林]:场景事件编号 [12]
light()
say("这和尚好生厉害。",0)	
say("少林已经覆灭，他一个人翻不起大浪，先撤，上武当。",639)	
say("好。",0)
instruct_3(43,40,0,0,0,0,5020,0,0,0,0,26,28);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(43,41,0,0,0,0,5020,0,0,0,0,26,29);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
end
end

OEVENTLUA[5020] = function() --上武当
dark()
instruct_19(22,28)
instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,42,0,0,0,0,0,4641*2,4641*2,4641*2,-2,16,28);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,43,0,0,0,0,0,3192*2,3192*2,3192*2,-2,16,29);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
--instruct_3(43,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
light()
say("在下见过张真人，哦？大师也在，还有这位。（糟糕，几个高手在一起，此次怕是凶多吉少。）",0)
say("阿弥陀佛。",114)
say("....",455)
say("小友来意，老道已从兄弟这知晓。",5)
say("不过老道还是不明，小友武艺高强，为何替那鞑子屠戮中原？",5)
say("在下所谋不过天书而已，刚好朝廷有一本。",0)
say("小友何不走正道取得那天书？",5)
say("张真人可是想要劝说在下弃暗投明？",0)
say("唉，看小友神态怕是老道说不动小友了。",5)
say("张真人放心，在下也并非滥杀无辜之人，不过为了天书，在下也只能得罪了",0)
say("也罢，今日我兄弟三人怕是要以大欺小了。",5)
dark()
instruct_3(-2,44,0,0,0,0,0,4641*2,4641*2,4641*2,-2,16,30);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
light()
say("哈哈哈……如此大战岂能少得了我。",592)
say("今日我兄弟四人齐聚，又有如此大战，人生无憾。",592)
say("...........",0)
SetS(11,60,15,0,2)
setJX(5)
setJX(114)
setJX(455)
setJX(592)
if GetS(86,10,20,5) == 1 then 
   SetS(86,10,20,5,2)
end
	if instruct_6(255) ==true then    --光明圣火阵
      rewardRW(7)
	end
if GetS(86,10,20,5) == 2 then 
   SetS(86,10,20,5,1)
end
say("咳..咳...",0)
say("小友你败了。",5)
say("...",0)
say("唉，你走吧，望小友能够迷途知返。",5)
say("...谢张真人。",0)
say("如此我兄弟四人又要分道扬镳了。",592)
say("阿弥陀佛，君宝，有缘再见。",114)
dark()
instruct_3(-2,42,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,43,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,44,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_3(-2,4,1,0,5021,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
		for i = 7, 10 do
			addevent(106, i, 0, 5022, 3)
		end
light()
end

OEVENTLUA[5021] = function() --上武当
if JY.Person[0]["品德"] < 50 then 
say("望小友迷途知返。",5)
else 
say("小友能迷途知返，老道甚是欣慰。",5)
end
end

OEVENTLUA[5022] = function() --绿柳山庄
dark()
	for i = 7, 10 do
		null(-2, i)
	end	
	addevent(-2, 1, 0, 0, 0, 4595*2)
	instruct_21(639)
light()
say("在下未能完成任务，还请郡主责罚。",0)
say("少侠无需介怀，是本郡主失策了。",639)
say("谢郡主（看来天书只能想起他办法了）。",0)
say("好了，你下去休息吧。",639)
say("是。",0)
dark()
instruct_19(32,22)
instruct_3(-2,2,1,0,5023,0,0,-2,-2,-2,-2,13,21);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
null(-2, 1)
light()
say("郡主，汝阳王命郡主立刻回去。",643)
say("我爹？这是为何？",639)
say("郡主此次围剿六大派失利，陛下雷霆大怒，汝阳王收回了郡主的兵权。",643)
say("哼，我不会回去,这次不过是出现了些意外而已。",639)
say("郡主，汝阳王说绑也要绑回去。",643)
say("...........",639)
say("我知道了，待会我就回去。",639)
say("（嗯？好机会，我现在正好可以趁机去调查一番，如果天书当真在这，我也不用再费周折）",0)
end

OEVENTLUA[5023] = function() --绿柳山庄
say("嗯？这是？找到了！不对，假的？上当了！",0)
dark()
instruct_3(-2,1,0,0,0,0,0,4595*2,4595*2,4595*2,-2,12,22);   --  3(3):修改事件定义:场景[武当]:场景事件编号 [12]
instruct_40(2)
light()
say("你在做什么！？",639)
say("（糟糕，被发现了）！",0)
say("《倚天屠龙记》？原来少侠是为了此书而来。",639)
say("既然被郡主发现了，在下也不隐瞒了，在下确是为了此书而来，不想竟然是本假书。",0)
say("这本书是成师傅送给本郡主的，早在很早之前，本郡主就命人探查过，得知此乃假的。",639)
say("郡主可是发现成昆的异心了？",0)
say("本郡主从未信任过他。（嗯？何不用他....）",639)
say("（这眼神怎么怪怪的？）喂喂！！你要干嘛？",0)
say("救命啊！！！！",639)
say("...........",0)
dark()
instruct_3(-2,5,0,0,0,0,0,4632*2,4632*2,4632*2,-2,12,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,6,0,0,0,0,0,4636*2,4636*2,4636*2,-2,13,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
light()
say("小子，赶快放开郡主！",643)
say("...........（喂，你到底要干嘛？）",0)
say("（怎么关键时候这么笨？快带本郡主离开这里。）",639)
say("...........",0)
say("好小子，不说话，你这是找死！",643)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end	
say("好厉害的臭小子，郡主，等我兄弟俩去搬救兵！",643)
dark()
instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,12,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,13,24);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
light()
say("快走吧，再不走来不及了。",639)
say("去哪？",0)
say("去找成昆，你不是在找天书嘛。",639)
say("好！",0)
teammate(639)
dark()
instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(-2,2,1,0,0,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[绿柳山庄]:场景事件编号 [12]
instruct_3(9,10,0,0,0,0,5024,0,0,0,0,28,25);   --  3(3):修改事件定义:场景[成昆]:场景事件编号 [12]
addevent(9, 2, 0, 0, 0, 2648*2)
light()
end

OEVENTLUA[5024] = function() --成昆
dark()
instruct_3(9,10,0,0,0,0,0,0,0,0,0,28,25);   --  3(3):修改事件定义:场景[成昆]:场景事件编号 [12]
light()
	say("我还以为是谁，原来是少侠你啊。", 18)
	say("成昆，你居然用假天书骗我？")
	say("哼哼，让你小子发现了。", 18)
	say("告诉我真天书在哪！")
	say("哼，告诉你又何妨，天书在我那徒弟谢逊那里。", 18)
	say("当真是好算计。")
	say("不过小子你既然来了，那就留下吧。", 18)
		if WarMain(361) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
	say("该死的小子，居然栽在你的手里。", 18)	
	say("受死吧。")
dark()
null(-2,2)
addevent(72, 1, 0, 5025, 3)
addevent(72, 0, 0, 5025, 3)
JY.Scene[72]["进入条件"] = 0
light()
    say("（听闻谢逊好像是在冰火岛，看来必须要去一趟了）")
end

OEVENTLUA[5025] = function() --冰火岛
dark()
null(-2,0)
null(-2,1)
null(-2,4)
addevent(72, 8, 0, 0, 0,3987*2)
light()
    say("谁？？",13)
	say("谢狮王，在下前来索要《倚天屠龙记》这本书。")
	say("不管你是谁，给我去死。",13)
		if WarMain(261) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end
	null(-2,8)	
	light()	
	addthing(43)
	addthing(155)
	say("何必非要动手。")
	if inteam(639) and hasthing(37) and hasthing(43) then 
	say("喂，你说倚天剑和屠龙刀哪个更锋利？",639)
	say("这我哪知道。")
	say("笨呢，这不是现成的嘛，咱们试试？",639)
	say("好，我拿刀你拿剑，小心点哦，别砍到我。")
	say("本郡主比某人聪明多了。",639)
	say("来吧。")
	bgtalk("只听“咣”的一声，倚天剑和屠龙刀同时从中而断。")
	say(".................")
	say("咦？里面有东西！",639)
	say("什么东西？我看看！《九阴真经》《降龙十八掌》《武穆遗书》")
	say("原来这就是倚天剑和屠龙刀的秘密啊。",639)
	say("想不到里面藏的是神功秘籍和武穆遗书。")
	say("走啦走啦，这洞里阴森森的。",639)
	say("哦哦，这就走。")
	addthing(84)
	addthing(86)
	addthing(37,-1)
	addthing(43,-1)
	end
end

OEVENTLUA[256] = function() --朱府选择
instruct_37(1)
    say("张兄弟，这朱长龄父女不是*好人，他们根本不认识你父*亲，他们骗你，目的就是为*了屠龙刀。")
	say("啊？你是谁？为*什么这么说？姐姐她…*…",9)
	dark()
	null(-2,18)
	null(-2,11)
	null(-2,10)
	addevent(-2, 8, 0, 0, 0,5752)
	addevent(-2, 9, 0, 0, 0,7026)
	light()
	say("无忌，不要听他胡说八道。*你到底是什么人？挑拨我们*之间的关系！",165)
	say("哼，不知道是谁在胡说八道*！你们刚才在那间屋子里说*的话，我全都听见了！")
	say("好小子，留你不得！",165)
	say("啊？难道这是真的？你们…*…",9)
	say("张兄弟，你快跑！！")
	say("快追！",165)
	dark()
	null(-2,3)
	null(-2,8)
	null(-2,9)
	addevent(-2, 5, 0, 0, 0,5752)
	addevent(-2, 6, 0, 0, 0,7026)
	addevent(-2, 7, 0, 0, 0,5284)
	instruct_19(44,19)
	instruct_40(0)
	instruct_25(44,17,44,17)
	light()
	say("无忌，我们一直待你很好，*你姐姐也很喜欢你，快过来*，那边危险……",165)
	say("好弟弟，快过来，姐姐疼你*。",81)
	say("你、你，你骗我？不，不…*…啊……",9)
	say("悬崖！危险！")
	dark()
	null(-2,7)
	light()
	if yesno("要跳下去吗？") then
	say("不行，我得下去救他！")
	instruct_37(2)
	dark()
	JY.Scene[4]["进入条件"] = 0
    My_Enter_SubScene(4,20,15,2)
	null(-2,5) --清除朱九真
	null(-2,6) --清除朱九真她爹
	instruct_3(4,4,1,0,5026,0,0,5284,5284,5284,-2,26,14);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	null(68,7) --昆仑何太冲
	addevent(4, 1, 1, 5013, 1)
    light()
	instruct_27(-1,3013*2,3018*2) 
	 do return; end
	end
	say("我苦心经营这么久，居然被*你小子破坏了，拿命来。",165)
	say("哼，你这种人渣！")
	if instruct_6(145,4,0,0) == false then 
	   instruct_15(0)
	   do return; end
	end
	null(-2,5)
	null(-2,6)
	addevent(68, 3, 1, 257, 1, 5412)
	addevent(68, 13, 1, 257, 1, 5412)
	addevent(11, 106, 0, 259, 3)
	addevent(11, 107, 0, 259, 3)
	light()
	say("唉，无忌从这悬崖上摔下去*，凶多吉少啊。我去找找吧*。好像崑仑派就在这附近，*不妨去打听打听。")
end

OEVENTLUA[5026] = function() --昆仑仙境
    say("无忌你没事吧？")
	say("大哥，你怎么也下来了？",9)
	say("我下来救你的。")
	dark()
	instruct_3(-2,0,1,0,0,0,0,4702*2,4702*2,4702*2,-2,28,13);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	light()
	say("嗷！！！！！", 613)
    say("什么东西？！！！！！", 0)
			if WarMain(321) == false then
				instruct_15()
				return
			end	
	say("畜生受死！", 0)		
	say("大哥，不要！",9)
	say("无忌你干什么？", 0)
	say("大哥，你看它身上有伤，我给它治疗一下。",9)
	say(".......", 0)
	say("无忌，你真是太善良了。", 0)
	dark()
	instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	light()
	say("大哥，好了。",9)
	say("无忌，你手上什么东西？", 0)
	say("这个啊，是在它身体里拿出来的，好像是一个包裹。",9)
	say("看看是什么东西。", 0)
	say("几本书？",9)
	say("！！《九阳真经》！！", 0)
	say("大哥，这有什么问题吗？",9)
	say("无忌真是好福气，能得到如此神功。", 0)
	say("大哥，送给你吧。",9)
	say("这。。。。", 0)
	say("大哥真心待我，无忌无以为报。",9)
	say("无忌，那我就收下了，不过无忌，你也要练一练，江湖是非多。", 0)
	say("好的大哥，我看这里很安静，我想在这里待一段时间。",9)
	say("嗯，有时间我就来看你。", 0)
	addthing(83)
	instruct_3(-2,4,1,0,5027,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
	for i = 5,10 do 
	   addevent(43, i, 0, 5028, 3)
	end
end

OEVENTLUA[5027] = function() --昆仑仙境
    say("要好好练功，我过段时间来看你。", 0)
    say("好的，大哥。",9)
end

OEVENTLUA[5028] = function() --昆仑仙境
dark()
	for i = 5,10 do 
	   null(-2,i)
	end
light()
    say("晚辈见过张真人。", 0)
    say("小友客气了，不知小友前来所为何事？",5)
	say("事情是这样，晚辈机缘巧合之下遇到了张真人的徒孙张无忌。", 0)
	say("小友说的可是实话？",5)
	say("晚辈绝无半点虚言。", 0)
	say("苍天有眼，我那可怜的无忌孩儿还活着。",5)
	say("（不愧是一代宗师，好强的气势）", 0)
	say("快和我说说无忌现在怎么样了。",5)
	bgtalk("一番叙述之后..........")
	say("不想无忌竟有如此机遇，《九阳真经》是当年觉远大师所学武功，至阳至刚，对阴寒内伤有奇效。",5)
	say("张真人可派人将无忌接回来。", 0)
	say("唉，此事怕是要有劳小友了。",5)
	say("这是为何？", 0)
	say("门中弟子要去汇合其他五大派围攻光明顶了，还请少侠与远桥一起接回无忌。",5)
	say("张真人客气了，晚辈独自前往更快一点，到时候去光明顶与宋大侠汇合。", 0)
	say("有劳小友了。",5)
	for i = 2,10 do 
	   null(33,i)
	end
	null(34,0)
	instruct_3(4,0,0,0,0,0,5029,0,0,0,-2,15,30);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(4,4,0,0,0,0,5029,0,0,0,-2,16,30);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	--instruct_3(4,4,1,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [4]
end

OEVENTLUA[5029] = function() --昆仑仙境
    instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
	instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[崑仑]:场景事件编号 [5]
    instruct_30(15,30,15,20);   --  30(1E):主角走动27-49--27-34
	say("无忌～，我来看你了。", 0)
	say("奇怪人呢？", 0)
	say("此处极其隐蔽，正常应该不会被人发现，莫非自己离开了？", 0)
	say("还是先去光明顶汇合，通知宋大侠，也方便寻找无忌。", 0)
	instruct_17(11,1,29,47,0) --  3(3):修改事件定义:场景[明教]:大门开关
	--------------------------------------------------------
	instruct_17(11,1,28,46,2050) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,30,46,2054) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,30,47,2052) --  3(3):修改事件定义:场景[明教]
	instruct_17(11,1,28,47,2048) --  3(3):修改事件定义:场景[明教]
	addevent(11, 65, 0, 0, 0,5430)
	addevent(11, 66, 0, 0, 0,5436)
	addevent(11, 67, 0, 0, 0,5432)
	addevent(11, 68, 0, 0, 0,5440)
	addevent(11, 69, 0, 0, 0,5444)
	addevent(11, 70, 0, 0, 0,5432)
	addevent(11, 3, 0, 0, 0,5452)
	addevent(11, 6, 0, 0, 0,5334)
	addevent(11, 7, 0, 0, 0,5348)
	addevent(11, 8, 0, 0, 0,5364)
	addevent(11, 9, 0, 0, 0,5378)
	addevent(11, 10, 0, 0, 0,5362)
	for i = 11,18 do 
	addevent(11, i, 0, 0, 0,5412)
	end
	addevent(11, 19, 0, 0, 0,5434)
	for i = 20,27 do 
	addevent(11, i, 0, 0, 0,5404)
	end
	addevent(11, 28, 0, 0, 0,5428)
	for i = 29,35 do 
	addevent(11, i, 0, 0, 0,5182)
	end
	for i = 36,46 do 
	addevent(11, i, 0, 0, 0,5426)
	end
	addevent(11, 37, 0, 0, 0,5426)
	addevent(11, 47, 0, 0, 0,5444)
	for i = 48,56 do 
	addevent(11, i, 0, 0, 0,5402)
	end
	addevent(11, 57, 0, 0, 0,5436)
	for i = 58,64 do 
	addevent(11, i, 0, 0, 0,5392)
	end
	addevent(11, 77, 0, 0, 0,5302)
	addevent(11, 78, 0, 0, 0,5302)
	addevent(11, 79, 0, 0, 0,5308)
	addevent(11, 80, 0, 0, 0,5310)
	addevent(11, 82, 0, 0, 0,5312)
	addevent(11, 81, 0, 0, 0,5302)
	addevent(11, 83, 0, 0, 0,5310)
	addevent(11, 84, 0, 0, 0,5314)
	-------------------------------------
	null(11,103)
	null(11,102)
	null(11,90)
	null(11,94)
	null(11,100)
	addevent(11, 105, 1, 0, 0)
	addevent(11, 0, 0, 5030, 3)
end

OEVENTLUA[5030] = function() --光明顶
dark()
null(-2,0)
light()
instruct_30(29,48,29,38)
say("见过各位掌门。")
say("少侠你来啦，不知无忌在何处？",171)
say("晚辈去的时候，无忌已不再那里，想来是先行离开了。")
say("待当下事情处理完，我等便一同寻找无忌。",171)
say("魔教已然一败涂地，再不投*降，还待怎的？空闻大师，*咱们这便去毁了魔教三十三*代教主的牌位吧！",8)
say("什么投不投降？*魔教之众，*今日不能留下任何活口。*除恶务尽，*否则他日死灰复燃，*又将为害江湖。*魔崽子们！*识时务的快快自我了断，*省得大爷们动手。",7)
say("华山派和崆峒派各位，*请将顶上的魔教余孽一概诛*灭了。*武当派从西往东搜索，峨嵋*派从东往西搜索，别让魔教*有一人漏网。*崑仑派预备火种，焚烧魔教*巢穴。**少林弟子各取法器，诵念往*生经文，替六派殉难英雄，*魔教教众超渡，化除冤孽。",169)
dark()
instruct_3(-2,109,0,0,0,0,0,5284,5284,5284,-2,28,32);
light()
say("大家都别打了，因为*这中间着实有许多误会，*让我好好说给你们听。",9)
say("（那不是无忌么，怎么跑到明教去了？）")
say("你是何人？*还请速速离去，*以免受池鱼之殃。",169)
say("都是成崑那奸贼所计划的，大家都罢手吧。",9)
say("现在年轻人都这麽狂妄吗？*你自以为是武林盟主吗！*要我们听你说。",6)
say("你这小贼，跟魔教勾结，*想要拖延时间，好施什么诡*计么？先杀了你再说。",8)
dark()
light()
bgtalk("一番战斗之后........")
say("现在就看武当派的了。",6)
say("这个……。",171)
say("宋大侠，他就是无忌。")
say("什么！当真？",171)
say("千真万确，只是不清楚无忌为何会出现在明教。")
say("大师伯，别打了。",9)
say("你，你，你真是无忌！你是我*五弟的儿子张无忌！",171)
say("大师伯，是我，太师父他老*人家还好吧？",9)
say("好，好，孩子，你身上的寒*毒好了吗？",171)
say("谢谢大师伯挂怀，我想已经*好了吧。大师伯，六大派和*明教，这其中确有不少误会*，你们不要再打了",9)
say("什么误会？",171)
say("事情的经过是这样的。。。*如此如此。。。。。。。。*这般这般。。。。。。。。*总之，一切的阴谋，*都是成崑那奸贼所计划的。**所以我说呢，你们两方还是*握手言和吧，反正明教杀过*六大派的人，六大派也杀过*明教的人，大家半斤八两，*差不了多少，就都罢手吧。",9)
say("话都是你在说的，*是不是真的，*我们怎麽知道。",8)
say("武当派既认亲，看来这次六*大派围攻光明顶是一败涂地*了，我们走！",6)
say("阿弥陀佛。",169)
say("哼！技不如人，*说这麽多做什麽，*走吧！",7)
dark()
for i = 3,70 do 
null(-2,i)
end
for i = 77,100 do 
null(-2,i)
end
light()
say("无忌，今日*你们救了明教，今后要多所*规劝引导，总要使明教改邪*归正，少做坏事。*少侠我们走吧。",171)
say("为了防止一些宵小之辈，我准备带领明教一起转移到安全的地方",9)
say("那么无忌，保重。")
dark()
null(-2,113)
null(-2,114)
null(-2,109)
light()
instruct_3(109,20,0,0,0,0,5031,0,0,0,-2,42,32);
instruct_3(109,21,0,0,0,0,5031,0,0,0,-2,42,31);
end

OEVENTLUA[5031] = function() --小树林
dark()
null(-2,20)
null(-2,21)
instruct_19(42,31);
light()
instruct_30(42,31,32,31)
say("少侠，今夜就在此露宿一宿吧。",171)
say("好，嗯？什么味？")
say("糟糕！中毒了，全身提不起劲。",171)
say("（九阳神功百毒不侵果然奇效）什么人！！")
say("少侠小心！",171)
dark()
addevent(-2, 5, 0, 0, 0,3390*2)
addevent(-2, 6, 0, 0, 0,3388*2)
addevent(-2, 7, 0, 0, 0,3389*2)
addevent(-2, 8, 0, 0, 0,3387*2)
light()
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
null(-2,5)	
null(-2,6)	
null(-2,7)	
null(-2,8)	
light()
say("宋大侠，我来给你们解毒.")
say("这些是什么人？",171)
say("刚离开明教就遭到袭击，而且明教有无忌在，不太可能是明教干的。")
say("其他各派也有可能遇到同样的事，先回去再说,这本剑法少侠拿去参悟吧。",171)
say("多谢宋大侠的。")
addthing(271)
for i = 5,10 do 
addevent(43, i, 0, 5032, 3)
end
end

OEVENTLUA[5032] = function() --武当
for i = 5,10 do 
null(-2,i)
end
say("师傅。",171)
say("远桥回来啦，找到无忌了么？",5)
say("回禀师傅，找到无忌了。",171)
bgtalk("一番叙述之后........")
say("无忌没事就好。",5)
say("对了师傅，在回来的路途中，我们遭到了不明人士的袭击，若非少侠相救，徒儿等人怕是见不到师傅了。",171)
say("小友，老朽感激不尽。",5)
bgtalk("明教教主到～")
dark()
    instruct_19(16,28);   --  19(13):主角移动至2D-12
    instruct_40(1);   --  40(28):改变主角站立方向1
instruct_17(-2,1,19,28,4669*2)
instruct_17(-2,1,20,27,4633*2)
instruct_17(-2,1,20,29,4637*2)
instruct_17(-2,1,21,27,3389*2)
instruct_17(-2,1,21,28,3389*2)
instruct_17(-2,1,21,29,3389*2)
light()
say("明教教主张无忌拜见张真人。",639)
say("哦？张教主和我那无忌孩儿同名？。",5)
say("张真人不要信她的话，此人并非明教教主。",0)
say("阁下又是何人？",639)
say("明教众人我亲眼见过，而且现下明教教主乃是张真人的徒孙，你假冒明教有何居心。",0)
say("哼，既如此我也不拐弯抹角了。",639)
say("本郡主想邀请张真人投靠我朝廷。",639)
say("想来路途中袭击我徒儿的就是姑娘吧。",5)
say("不错，如今六大派高手皆以被擒，张真人和不考虑考虑。",639)
say("老朽平生所愿便是驱逐鞑子，姑娘怕是白费心机了。",5)
say("敬酒不吃吃罚酒，阿三，去陪张真人玩玩。",639)
say("张真人，请。",640)
say("区区杂兵何须张真人动手，让我来。",0)
say("小友...你...",5)
say("张真人请放心。",0)
say("如此，小友我便教你几招老朽最近所悟武学。",5)
say("谢张真人。",0)
instruct_35(0,2,16,0)
instruct_35(0,3,46,0)
instruct_35(0,2,16,0)
instruct_35(0,3,46,0)
if GetS(111,0,0,0) == 0 then 
if yesno("要领悟纯阳无极么？") then
SetS(111,0,0,0,99)
end
end
if MPPD(0) == 4 then 
say("原来小友也是我武当弟子，如此，再看几招。",5)
say("谢师傅。",0)
JoinMP(0,4,4)
end
	if WarMain(351) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	instruct_37(1)
	light()
	say("阿二，你上。", 639)
	say("是！", 641)	
	if WarMain(352) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	instruct_37(1)
	light()	
	say("阿大，你去试一试少侠的剑法。", 639)
	say("是！", 642)	
	if WarMain(353) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end		
	instruct_37(1)
	light()
	say("佐佐木师傅，有劳你了。", 639)
	say("嗨！", 517)
	say("东瀛人？",0)
	SetS(106, 63, 1, 0, 0)
    SetS(106, 63, 2, 0, 517)
	if WarMain(288) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	instruct_37(1)
	light()
	addHZ(63)
say("少侠当真武功了得，我们走。", 639)
say("想来就来想走就走，给我留下。",0)
say("玄冥二老。", 639)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end	
instruct_17(-2,1,19,28,0)
instruct_17(-2,1,20,27,0)
instruct_17(-2,1,20,29,0)
instruct_17(-2,1,21,27,0)
instruct_17(-2,1,21,28,0)
instruct_17(-2,1,21,29,0)
	light()
say("又是这两个家伙，果然是她派人袭击我们，可惜让他们跑了。",0)
say("五大派高手被擒，还需想办法搭救才行。",5)
say("不知道他们被关押在哪里，我这就去打探一下消息。",0)
say("有劳小友了，这本轻功，小友拿去吧。",5)
addthing(238)
addevent(106, 0, 0, 5033, 3)
end

OEVENTLUA[5033] = function() --绿柳山
if hasthing(152) then
dark()
null(-2,0)
	addevent(-2, 15, 0, 0, 0, 3046*2)
	addevent(-2, 16, 0, 0, 0, 3046*2)
	addevent(-2, 17, 0, 0, 0, 3046*2)
	addevent(-2, 4, 0, 0, 0, 2685*2)
	addevent(-2, 11, 0, 0, 0, 2685*2)
	addevent(-2, 12, 0, 0, 0, 2685*2)
	addevent(-2, 13, 0, 0, 0, 2681*2)
	addevent(-2, 14, 0, 0, 0, 2709*2)
	addevent(-2, 3, 0, 0, 0, 2677*2)
	instruct_17(-2,1,28,40,4662*2)
	instruct_17(-2,1,31,38,4530*2)
light()
	say("诸位掌门，这里的规矩你们是知道的了，如果你们能胜得了郡主，你们立刻就能走。如若败了，便斩断一根手指，囚禁一月，再问你降也不降。", 642)
	say("那么少侠请吧。", 639)
	say("（原来她命人逐一与各家掌门相斗，她在旁察看，得以偷学各门各派的精妙招数，当真好计谋）")
	say("好了，把他们押回万安寺。", 639)
dark()
null(-2,15)
null(-2,16)
null(-2,17)
null(-2,4)
null(-2,11)
null(-2,12)
null(-2,13)
null(-2,14)
null(-2,3)
	instruct_17(-2,1,28,40,0)
	instruct_17(-2,1,31,38,0)
light()
say("（原来她把人关在万安寺，得想办法就他们出来）")
JY.Scene[8]["名称"] = "万安寺"
instruct_17(8,1,15,28,2134*2)
instruct_17(8,1,17,27,2682*2)
instruct_17(8,1,17,28,2682*2)
instruct_17(8,1,16,27,2679*2)
instruct_17(8,1,16,28,4611*2)
instruct_17(8,1,17,29,2706*2)
instruct_17(8,1,17,30,2674*2)
instruct_17(8,1,17,31,4529*2)
addevent(8, 0, 0, 5034, 3)
addevent(8, 1, 0, 5034, 3)
addevent(8, 2, 1, 238, 1, 3046*2)
addevent(8, 13, 1, 238, 1, 3046*2)
addevent(8, 14, 1, 238, 1, 3046*2)
addevent(8, 15, 1, 238, 1, 3046*2)
addevent(8, 3, 1, 5035, 1, 4662*2)
end
end

OEVENTLUA[5034] = function() --万安寺
dark()
null(-2,0)
null(-2,1)
instruct_17(-2,1,32,26,2642*2)
light()
say("谁？")
say("啊？大哥是你啊。",9)
say("无忌？你怎么在这？")
say("教中传来消息说六大派被擒，所以我就赶过来救人了。",9)
say("想不到明教消息如此灵通。")
say("是我教中左使潜伏在朝廷多年，不然我们也得不到消息。",9)
say("这万安寺戒备森严，想要救人恐非易事。")
say("各门各派的高手都中了毒，无法运功，这万安寺如此之高....",9)
say("...啊，大哥我有乾坤大挪移",9)
say("可以将六大派的人挪移下来。",9)
say("哦？这样的话由我去吸引兵力，无忌你去救人。")
say("大哥你要小心啊。",9)
say("放心吧无忌。")
dark()
instruct_17(-2,1,32,26,0)
light()
end

OEVENTLUA[5035] = function() --万安寺
say("我就知道你们会来救人。",639)
say("......")
say("给我上，这次你们休想逃掉。",639)
say("郡主不好了，有人劫囚。", 642)
say("什么！！给我放火烧塔。",639)
say("是。", 642)
say("休想得逞！")
SetS(11,60,15,0,1)
	if WarMain(362) == false then
		instruct_15(0);   
		instruct_0();  
		do return; end			
	end
	instruct_37(2)
	instruct_17(-2, 1, 25, 26, 2685*2)
	instruct_17(-2, 1, 25, 27, 2685*2)
	instruct_17(-2, 1, 25, 28, 2685*2)
	instruct_17(-2, 1, 25, 29, 4612*2)
	instruct_17(-2, 1, 25, 30, 2709*2)
	instruct_17(-2, 1, 25, 31, 2677*2)
	instruct_17(-2, 1, 25, 32, 4530*2)
	instruct_17(-2, 1, 24, 28, 2642*2)
	
instruct_17(8,1,15,28,0)
instruct_17(8,1,17,27,0)
instruct_17(8,1,17,28,0)
instruct_17(8,1,16,27,0)
instruct_17(8,1,16,28,0)
instruct_17(8,1,17,29,0)
instruct_17(8,1,17,30,0)
instruct_17(8,1,17,31,0)
light()
say("大哥，人救出来了，快走。",9)
say("撤！")
say("可恶！",639)
dark()
null(-2,2)
null(-2,3)
null(-2,13)
null(-2,14)
null(-2,15)
	instruct_17(-2, 1, 25, 26, 0)
	instruct_17(-2, 1, 25, 27, 0)
	instruct_17(-2, 1, 25, 28, 0)
	instruct_17(-2, 1, 25, 29, 0)
	instruct_17(-2, 1, 25, 30, 0)
	instruct_17(-2, 1, 25, 31, 0)
	instruct_17(-2, 1, 25, 32, 0)
	instruct_17(-2, 1, 24, 28, 0)
My_Enter_SubScene(109,32,31,2)
instruct_17(109,1,30,29,2682*2)
instruct_17(109,1,30,30,2682*2)
instruct_17(109,1,30,31,4609*2)
--instruct_17(8,1,16,28,4611*2)
instruct_17(109,1,30,32,2706*2)
instruct_17(109,1,30,33,2674*2)
instruct_17(109,1,30,34,4529*2)
instruct_17(109,1,32,29,2642*2)
light()
say("怎么不见灭绝师太？")
say("师傅她老人家..仙逝了？",638)
say("姑娘，请节哀。")
say("感谢张教主和少侠的救命之恩。",169)
say("多谢。",8)
say("多谢救命之恩。",8)
say("我等就此别过，这是我等一点心意。",169)
dark()
instruct_17(109,1,30,29,0)
instruct_17(109,1,30,30,0)
--instruct_17(8,1,16,28,4611*2)
instruct_17(109,1,30,32,0)
instruct_17(109,1,30,33,0)
instruct_17(109,1,30,34,0)
light()
addthing(288)
addthing(267)
addthing(267)
addthing(142)
addthing(124)
say("无忌，我也要去寻找天书了，在此别过了。")
say("天书？大哥，我知道《倚天屠龙记》的下落。",9)
say("当真？")
say("那本书就在我义父那里。",9)
say("我这就前去。")
say("我也好久没有见过义父了，我陪你去。",9)
say("好，有你同去，想必会顺利不少。")
say("我也去！",638)
say("芷若妹妹，你也要去？",9)
say("我...我...",638)
say("周姑娘想去就一同去吧。（这周姑娘神色怎的如此慌张）")
addevent(104, 46, 1, 948, 1, 7226)
dark()
instruct_17(109,1,30,31,0)
instruct_17(109,1,32,29,0)
light()
JY.Person[9]["携带物品3"] = 74
	if instruct_20() then
	addevent(70, 17, 1, 107, 1, 5284)
	else 
	instruct_10(9)
	end
	teammate(638)
	JY.Scene[72]["进入条件"] = 0
	addevent(72,4, 1, 5036, 1)
end

OEVENTLUA[5036] = function() --冰火岛
    if inteam(9) then
	null(-2,4)
    say("这是谢狮王的毛发，人哪去了？",0)
	say("义父双眼失明不可独自离开冰火岛，一定是仇家把他害了*……。",9)
	say("我看不会，冰火岛地处偏远*，你要不告诉我，我也很难*找到。而且岛上并没有打斗*的痕迹，我看多半是谢法王*自己离开了。",0)
	say("我义父双目失明，是不会一*个人走的。",9)
	say("那说不定是一个值得他信任*的人带他走的。",0)
	say("他在外面几乎全是仇家，哪*有什么朋友？",9)
	say("你忘了紫衫龙王么。",0)
	say("对！我们立刻去找她。",9)
	addevent(73,2, 0, 5037, 3)
	end
end

OEVENTLUA[5037] = function() --灵蛇
    if inteam(9) then
	dark()
	null(-2,2)
	null(44,0)
	null(44,1)
	addevent(-2, 0, 0, 0, 0, 5288)
	addevent(-2, 1, 0, 0, 0, 7008)
	addevent(-2, 4, 0, 0, 0, 5294)
	light()
	end
	instruct_25(48,24,26,23)
	say("谢三哥，你还信不过紫杉老*妹子么？",15)
	say("我说过了，除非见到我那无*忌孩儿，否则我是不会把屠*龙刀借给你的。",13)
	say("＜义父，怎么在这里？那金*花婆婆就是紫杉龙王？＞",9)
	say("＜无忌，我们进去相认吧＞",0)
	say("明教圣火令到，护教龙王、*狮王，还不下跪迎接，更待*何时。",174)
	say("＜圣火令？我教圣火令已经*遗失多年，这来的是什么人*？＞",9)
	dark()
	addevent(-2, 5, 0, 0, 0, 5222)
	addevent(-2, 6, 0, 0, 0, 5222)
	addevent(-2, 7, 0, 0, 0, 5222)
	light()
	say("本人早已破门出教，'护教*龙王'四字，再也休提。阁*下尊姓大名？这圣火令是真*是假，从何处得来？",15)
	say("明教源於何土？",174)
	say("源起波斯。",13)
	say("然也，然也！我乃波斯明教*总教流云使，另外两位是妙*风使、辉月使。我等奉总教*主之命，特从波斯来至中土*。",174)
	say("中土明教虽然出自波斯，但*数百年来独立成派，自来不*受波斯总教管辖。",13)
	say("这是中土明教的圣火令，前*任姓石的教主不肖，失落在*外，今由我等取回。自来见*圣火令如见教主。",174)
	say("我已说过，本人早已破门出*教，这圣火令与我何干？",15)
	say("本教教规，入教之后终身不*能叛教。你自称破门出教，*为本教叛徒，需留你不得。",174)
	dark()
	addevent(-2, 9, 0, 0, 0, 5288)
	null(-2,0)
	light()
	say("啊！",66)
	say("＜这三人一招之间就抓住了*紫杉龙王，功夫着实了得！*＞",0)
	say("快救救我妈妈！",66)
	say("大胆胡人，还不快放人。",0)
	if instruct_6(14,3,0,0) == false then 
	   instruct_15(0)
	   do return; end
	end
	instruct_37(1)
	null(-2,5)
	null(-2,6)
	null(-2,7)
	null(-2,9)
	addevent(-2, 0, 0, 0, 0, 5288)
	addevent(-2, 10, 0, 0, 0, 5284)
	instruct_19(26,24)
	instruct_40(0)
	light()
	say("多谢少侠出手相助。",13)
	say("狮王不必客气。",0)
	say("老婆子多谢啦。",15)
	say("龙王不必客气。这三个家伙*的武功真是怪异。咦？这是*什么？",0)
	say("这就是圣火令。",15)
	say("这上面好像有字？",0)
	say("我来看看。哦，这是波斯文*字，我给你译出来。",15)
	dark()
	light()
	addthing(70)
	say("却不知这些人为何要为难婆*婆？",0)
	say("说来话长。我本是波斯明教*的圣女。",15)
	say("啊？",0)
	say("我来到中原，加入明教，本*是寻找乾坤大挪移心法的。*没想到对银叶先生动了真情*，结为夫妻，这是犯了波斯*明教的大忌，按照教规理应*处死。我这么多年隐姓埋名*，没想到还是被找到了。",15)
	say("哦。",0)
	say("看，又来了好多人。",66)
	say("此地不宜久留，我们还是离*开这里吧。",0)
	say("我还要找我的无忌孩儿。",13)
	say("义父，孩儿无忌不孝，没能早日前来相接，累义父受尽辛苦。", 9)
	say("你....你说什么？", 13)
	say("拳学之道在凝神，意在力先方制胜............", 9)
	say("你....你当真便是我那无忌孩儿？", 13)	
	say("好教您老人家得知，无忌现在已经是明教的教主，以后您老人家还要向他行礼呢。")
	say("真的吗？太好了！金毛狮王谢逊参见教主！", 13)
	say("义父不要这样。孩儿有个不情之请，大哥对我有有恩，还请义父将《倚天屠龙记》这本天书送与大哥。", 9)
	say("好！不过，在此之前，少侠需将成昆的人头拿来，我便将天书和屠龙宝刀拱手相送。", 13)
	say("一言为定。",0)
	say("我在冰火岛等你。", 13)
	dark()
	null(-2,0)
	null(-2,10)
	null(-2,1)
	null(-2,4)
	addevent(72,2, 1, 5038, 1, 5294)
	addevent(9, 2, 1, 5039, 1, 2648*2)
	light()
end

OEVENTLUA[5038] = function() --冰火岛
   say("成昆的人头带来了吗？",13) 
end

OEVENTLUA[5039] = function() --成昆
	say("没想到还能有人找到这里，小子，你就是江湖上传闻在找十四天书的那个人吧。", 18)
	say("你是谁？")
	say("我就是混元霹雳手成昆。", 18)
	say("原来你就是成昆，受死吧！")
	say("狂妄的小子", 18)
		if WarMain(361) == false then
			instruct_15(0);   
			instruct_0();  
			do return; end			
		end				
		null(-2, 2)
		null(72, 2)
		light()
		addevent(72,0, 0, 5040, 3)
		addevent(72,1, 0, 5040, 3)
    say("逃得好快！这下麻烦了。")
end

OEVENTLUA[5040] = function() --冰火岛
   dark()
   null(-2,0)
   null(-2,1)
   light()
   say("奇怪，谢狮王去哪了？",0) 
   say("打斗的痕迹？糟糕！！",0) 
   say("赶紧回明教看看，他们消息灵通一点！！",0) 
   addevent(11,110, 1, 5041, 1,2671*2)
   addevent(11,101, 1, 5041, 1,2667*2)
   instruct_3(11,109,1,0,5041,0,0,2663*2,2663*2,2663*2,-2,30,15)
   --addevent(11,109, 1, 5041, 1,2663*2)
end

OEVENTLUA[5041] = function() --冰火岛
   say("大事不好了，刚收到消息，谢狮王被抓，关在了少林！！",11) 
   say("我们去就狮王吧！！",14) 
   say("是啊，狮王树敌太多，怕是危险了！！",10) 
   say("我马上动身去少林救狮王",0) 
   dark()
   null(-2,101)
   null(-2,110)
   null(-2,109)
   instruct_17(28,1,5,44,5294)
   instruct_3(28,100,1,0,5042,0,0,2711*2,2711*2,2711*2,-2,4,47)
   light()
end

OEVENTLUA[5042] = function() --冰火岛
   say("少林后山重地不得擅闯！！",485) 
   if inteam(9) then 
   say("快点让开，否则不客气了！",0) 
   say("多说无益，看阵！！",485) 
   SetS(86,1,2,5,3)
   if WarMain(217) == false then
      instruct_15(0)
      do return; end
   end
   say("少林岂容你放肆。",70)
   say("今日无论如何也要带走谢逊！",0) 
    if WarMain(80) == false then
	   instruct_15()
	   do return; end
	end
	addHZ(114)
   say("谢逊多谢少侠前来相救，但是我谢逊一生作恶多端，我想留在少林，出家为僧！",13) 
   say("........这！",0) 
   say("少侠，你走吧，谢逊感激不尽！",13) 
   say("........！<我天书还没拿到呢~~>",0)
   say("义父！！",9)
   say("无忌孩儿，快走吧，义父要在此赎罪。",13) 
   addevent(-2,100, 1, 5043, 1)
   instruct_3(28,101,1,0,5044,0,0,2648*2,2648*2,2648*2,-2,18,12)
   light()
   end
end

OEVENTLUA[5043] = function() --冰火岛
   say("少林后山重地不得擅闯！！",485)
   if hasthing(219) and inteam(9) then 
      say("谢狮王，成昆已经死了，这是他的人头。",0)
	  dark()
	  light()
	  addthing(219,-1)
	  say("哈哈哈，成昆恶贼，你终于死了，啊啊啊啊！！！。",13)
	  say("少侠，这《倚天屠龙记》就送于少侠了，那屠龙刀却是被少林拿去了,这本狮吼功秘籍少侠拿去吧。",13)
	  say("无妨，有天书即可。",0)
	  say("义父，你当真要在削发为僧么。",9)
	  say("无忌孩儿，这是义父应得的报应，你不要伤心。",13)
	  say("可是......",9)
	  say("不用再劝了，无忌孩儿，明教以后就靠你了。",13)
	  say("义父，以后我再来看你。",9)
	  light()
	  addthing(155)
	  addthing(69)
	  say("危险！！",0)
   if WarMain(128) == false then
      instruct_15(0)
      do return; end
   end
   light()
   addHZ(130)
   say("这些东瀛人也在找天书？",0)
   end
end

OEVENTLUA[5044] = function() --冰火岛
   say("可恶的小子，居然让你找到这！！",18)
   say("成昆，今日你插翅难逃",0)
   if WarMain(10) == false then
      instruct_15(0)
      do return; end
   end
   null(-2,101)
   light()
   say("这恶贼终于死了，也算了却了狮王的一桩心愿。",0)
   addthing(219)
end



